{
  "last_updated": "2026-02-12T22:35:29.683035+00:00",
  "articles": [
    {
      "title": "Automattic planned to target 10 competitors with royalty fees, WP Engine claims in new filing",
      "link": "https://techcrunch.com/2026/02/12/automattic-planned-to-target-10-competitors-with-royalty-fees-wp-engine-claims-in-new-filing/",
      "author": "Sarah Perez",
      "date": "2026-02-12T11:02:07-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/11/wordpress-automattic-v1.jpg?resize=1200,800",
      "category": "Commerce",
      "content": "Web hosting company WP Engine has filed an amended complaint with brow-raising new allegations in itsongoing legal battlewith WordPress co-founder Matt Mullenweg and his company Automattic (WordPress.com’s parent company). The company now claims that Mullenweg intended to target 10 different hosting companies with royalty payments for their use of the WordPress trademark and tried to get payment processor Stripe to cancel its contract with WP Engine.\n\nAt the heart of the dispute, Mullenweg believes WP Engine isprofitingfrom the open source WordPress project without contributing back to the community, and demanded the hosting company pay 8% of its monthly gross revenues as a royalty fee for using the WordPress brand.\n\nThe suit,originally filedby WP Engine inOctober 2024, accused Automattic and Mullenweg ofdefamation and abuse of power. Automattic filed itscounterclaimslast year, alleging that the hosting company has been abusing the WordPress trademark and engaging in deceptive marketing practices.\n\nIn this latest filing, WP Engine has amended its complaint for the third time after gaining access to information that was uncovered during the discovery process. The information, now unredacted, had been previously sealed at Automattic’s request.\n\nNotably, one of the new claims accuses Automattic of allegedly planning to target 10 other competitors with royalty claims similar to those aimed at WP Engine.\n\nThe complaint also states that Newfold, a company whose portfolio includes hosting providers like Bluehost and HostGator, among others, is already paying Automattic for use of its trademarks and that Automattic is in conversations with others. (Names of the other hosts were redacted in the complaint, which referenced email conversations between those companies and Mullenweg.)\n\nWP Engine is also alleging that Mullenweg reached out to a Stripe executive via email to pressure the company to cancel WP Engine’s contract. This occurred after WP Engine had filed its lawsuit ag",
      "excerpt": "Web hosting company WP Engine has filed an amended complaint with brow-raising new allegations in itsongoing legal battlewith WordPress co-founder Matt Mullenweg and his company Automattic (WordPress.com’s parent company). The company now claims that Mullenweg intended to target 10 different hosting",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Aurora’s driverless trucks can now travel farther distances faster than human drivers",
      "link": "https://techcrunch.com/2026/02/12/auroras-driverless-trucks-can-now-travel-farther-distances-faster-than-human-drivers/",
      "author": "Kirsten Korosec",
      "date": "2026-02-12T09:58:30-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/05/Aurora-Launch-6-e1746107306339.jpg?resize=1200,886",
      "category": "Transportation",
      "content": "Aurora’s self-driving trucks can now travel nonstop on a 1,000-mile route between Fort Worth and Phoenix — exceeding what a human driver can legally accomplish.\n\nThe distance, and the time it takes to travel it, offers up positive financial implications for Aurora — and any other company hoping to commercialize self-driving semitrucks.\n\nIt takes Aurora about 15 hours to carry freight in its driverless trucks on the 1,000-mile journey, according to the company. Human truck drivers take much longer to complete the same distance due to federal regulations that limit how long they can be behind the wheel. For instance, truck drivers must stop for a 30-minute break after eight hours and can operate a semitruck for a maximum of 11 hours at a time, according to federal regulations. Once drivers hit that threshold, they cannot get behind the wheel for another 10 hours.\n\n“This represents more than a technological achievement,” Aurora co-founder and CEO Chris Urmson said during the company’s earnings call Wednesday afternoon. “It is the dawn of a superhuman future for freight.”\n\nIt also offers compelling economics to its customers, which includes Uber Freight, Werner, FedEx, and Schneider. The company said that eventually it can cut transit times nearly in half, a stat that has won over companies like Hirschbach, an early customer on the Fort Worth-to-Phoenix route.\n\nAurora said in aletter to shareholdersthat it is poised to expand across the Sun Belt of the United States. Today, the company operates driverless trucks — some with a human observer still in the cab — on routes between Dallas and Houston, Fort Worth and El Paso, El Paso and Phoenix, Fort Worth and Phoenix, and Laredo and Dallas.\n\nThe expansion has helped Aurora transition from a developer of autonomous trucks to a commercial operator who is earning money on its driverless routes.\n\nAurora has brought in revenue since April 2025 when it firstdeployed driverless, heavy-duty trucks for commercial useon public roads.",
      "excerpt": "Aurora’s self-driving trucks can now travel nonstop on a 1,000-mile route between Fort Worth and Phoenix — exceeding what a human driver can legally accomplish.\n\nThe distance, and the time it takes to travel it, offers up positive financial implications for Aurora — and any other company hoping to c",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Hacker linked to Epstein removed from Black Hat cyber conference website",
      "link": "https://techcrunch.com/2026/02/12/hacker-linked-to-epstein-removed-from-black-hat-cyber-conference-website/",
      "author": "Lorenzo Franceschi-Bicchierai",
      "date": "2026-02-12T11:15:04-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/jeffrey-epstein_8ef3e8.jpg?resize=1200,800",
      "category": "Security",
      "content": "Vincenzo Iozzo, a renowned hacker linked to convicted sex offender Jeffrey Epstein, is no longer listed on the website of Black Hat, one of the largest cybersecurity conferences in the world, nor on the Japanese security conference Code Blue.\n\nAs of Thursday, Iozzo does not appear on the official review board pages ofBlack HatorCode Blue. He was still listed on both pages as of last week. Iozzo had been on the Black Hat review board since 2011, according to his LinkedIn profile.\n\nIn a statement shared with TechCrunch through a spokesperson, Iozzo said he told Black Hat that he “will not willingly resign” and welcomed “a full investigation.”\n\nSpokespeople for Black Hat did not respond to requests for comment.\n\nIozzo, currently the founder and chief executive of cybersecurity startup SlashID, has had a long career in the industry. Iozzo authored one of the first manuals for hackers researching Apple’s mobile software, and in 2015, founded cybersecurity startup IperLane, which was later bought by CrowdStrike, leading him to serve as a senior director at the company for almost four years.\n\nIozzo’s name appears in more than 2,300 documents, some of which containseveral emails, released on January 30 as part of the Department of Justice’s legally required effort to publish materials from its investigation into the late financier and sex trafficker.\n\nIozzo’s interactions with Epstein span from October 2014 until December 2018. In late 2018, the Miami Heraldpublished news storiesdetailing allegationsthat Epsteinabused more than 60 women, some of them teenage girls.\n\nAfter these stories were published, newly releasedemails showIozzo was trying to meet with Epstein at his New York town house.\n\nContact UsDo you have more information about Epstein’s connections in the cybersecurity world?? From a non-work device, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram, Keybase and Wire @lorenzofb, orby email.\n\nAmong the new material ",
      "excerpt": "Vincenzo Iozzo, a renowned hacker linked to convicted sex offender Jeffrey Epstein, is no longer listed on the website of Black Hat, one of the largest cybersecurity conferences in the world, nor on the Japanese security conference Code Blue.\n\nAs of Thursday, Iozzo does not appear on the official re",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "US FTC airs concerns over allegations that Apple News suppresses right-wing content",
      "link": "https://techcrunch.com/2026/02/12/us-ftc-airs-concerns-over-allegations-that-apple-suppresses-right-wing-content-on-apple-news/",
      "author": "Ram Iyer",
      "date": "2026-02-12T06:40:03-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-2193735641.jpg?w=1024",
      "category": "Government & Policy",
      "content": "The U.S. Federal Trade Commission (FTC) has raised concerns over allegations that Apple is censoring conservative content on the Apple News app.\n\nIn aletterto Apple CEO Tim Cook, FTC chair Andrew Ferguson citedreportsfrom Media Research Center, a right-leaning think tank, which accused Apple of excluding right-leaning outlets from the top 20 articles in the Apple News feed.\n\n“These reports raise serious questions about whether Apple News is acting in accordance with its terms of service and its representations to consumers […] I abhor and condemn any attempt to censor content for ideological reasons,” Ferguson’s letter reads.\n\nFerguson, a Big Tech critic who Trump appointed to lead the competition regulator, noted the FTC doesn’t have any powers to require Apple to take ideological or political positions when curating news, but he said that if the company’s practices are “inconsistent” its terms of service or “reasonable expectations of consumers,” they may be in violation of the FTC Act.\n\nBrendan Carr, the chairman of the Federal Communications Commission (another Trump appointee critical of Big Tech),supportedFerguson’s stance, writing, “Apple has no right to suppress conservative viewpoints in violation of the FTC Act.”\n\nFerguson has urged Apple to conduct a “comprehensive review” of its terms of service and ensure that the content curated on Apple News is consistent with its policies, and “take corrective action swiftly” if the curation isn’t in line.\n\nThe letter comes a day after President Donald Trumpsharedthe report by Media Research Center on his social media platform, Truth Social. Trump has repeatedly accused Big Tech companies of censoring right-leaning content, though many major platforms have rolled back several measures to curb fake news and disinformation they had imposed in the years prior to his second stint at the White House.\n\nApple’s relationship with the Trump administration has oscillated between warm and cold over the past year. Trump has crit",
      "excerpt": "The U.S. Federal Trade Commission (FTC) has raised concerns over allegations that Apple is censoring conservative content on the Apple News app.\n\nIn aletterto Apple CEO Tim Cook, FTC chair Andrew Ferguson citedreportsfrom Media Research Center, a right-leaning think tank, which accused Apple of excl",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Eclipse backs all-EV marketplace Ever in $31M funding round",
      "link": "https://techcrunch.com/2026/02/12/eclipse-backs-all-ev-marketplace-ever-in-31m-funding-round/",
      "author": "Sean O'Kane",
      "date": "2026-02-12T06:00:09-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/ever-car-founders.jpg?resize=1156,1200",
      "category": "Transportation",
      "content": "If you want to buy or sell a used EV right now, what’s the first step you’d take?\n\nA startup called Ever wants to be the answer to that question. The company, which bills itself as the first “AI-native, full-stack auto retail business” for electric vehicles, already has thousands of customers buying and selling their EVs on the platform.\n\nNow it’s looking to scale with help from a $31 million Series A funding round led by Eclipse, with Ibex Investors, Lifeline Ventures, and JIMCO — the investment arm of the Saudi Arabian Jameel family (an early investor in Rivian) — as co-investors.\n\nOver the last decade, companies like Carvana and CarMax helped usher in the digital car-buying experience. More recently, myriad startups have tried to improve the car-buying experience with AI, pitching ideas like voice agents or smarter scheduling software. Eclipse’s Jiten Behl thinks this is the wrong approach if you want to really modernize the automotive retail experience, though.\n\n“These bolt-on AI tools are band-aids,” he said in an interview with TechCrunch. He likened it to how many major automakers’ first EVs were essentially combustion vehicles that were repackaged to fit electric drivetrains. That approach came with major tradeoffs compared to designing a new EV from the ground up, which was the approach companies like Tesla and Rivian took.\n\n“Auto retail is a perfect candidate for disrupting with AI, you know? It’s a lot of process, lot of labor, [very] rules-based,” he said.\n\nLasse-Mathias Nyberg, Ever co-founder and CEO, said in an interview that buying or selling a car typically triggers “hundreds or thousands of different actions” that a retailer needs to perform in order to complete the transaction. “There’s massive complexities or frictions on both sides.”\n\nIn 2022, he and his team set out to reduce or remove those complexities. What they settled on after a year of research was a digital-first auto retailer. The core tech is an orchestration layer or “operating system",
      "excerpt": "If you want to buy or sell a used EV right now, what’s the first step you’d take?\n\nA startup called Ever wants to be the answer to that question. The company, which bills itself as the first “AI-native, full-stack auto retail business” for electric vehicles, already has thousands of customers buying",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "AI inference startup Modal Labs in talks to raise at $2.5B valuation, sources say",
      "link": "https://techcrunch.com/2026/02/11/ai-inference-startup-modal-labs-in-talks-to-raise-at-2-5b-valuation-sources-say/",
      "author": "Marina Temkin",
      "date": "2026-02-11T14:48:35-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2024-02-14-at-9.26.16AM.png?resize=1200,607",
      "category": "Startups",
      "content": "Modal Labs, a startup specializing in AI inference infrastructure, is talking to VCs about a new round at a valuation of about $2.5 billion, according to four people with knowledge of the deal. Should the deal close at these terms, the funding round would more than double the company’s valuation of$1.1 billionannounced less than five months ago, when it announced an$87 millionSeries B round.\n\nGeneral Catalyst is in talks to lead the round, the people told TechCrunch. Modal’s annualized revenue run rate (ARR) is approximately $50 million, our sources said. The discussions are early, and terms could still change.\n\nModal Labs co-founder and CEO Erik Bernhardsson denied that his company was actively fundraising and characterized his recent interactions with VCs as general conversations. General Catalyst did not respond to our requests for comment.\n\nModal is focused on optimizing inference, the process of running trained AI models to generate answers from user requests. Improving inference efficiency reduces compute costs and cuts down the lag time between a user’s prompt and the AI’s response.\n\nModal is one of the handful of inference-focused companies attracting intense investor attention now. Last week, its competitor Baseten announced a$300 million raiseat a $5 billion valuation, more than doubling the $2.1 billion valuation it reached just months prior in September. Similarly, Fireworks AI, an inference cloud provider, secured $250 million at a $4 billion valuation in October.\n\nIn January, the creators of the open source inference project vLLM announced they had transitioned the tool into a VC-backed startup, Inferact, raising $150 million in seed funding led by Andreessen Horowitz at an$800 million valuation. Meanwhile, TechCrunch reported that the team behind SGLang has commercialized as RadixArk, which sources told us secured seed funding at a$400 millionvaluation led by Accel.\n\nModal was co-founded by CEO Erik Bernhardsson in 2021 after he spent more than 15 yea",
      "excerpt": "Modal Labs, a startup specializing in AI inference infrastructure, is talking to VCs about a new round at a valuation of about $2.5 billion, according to four people with knowledge of the deal. Should the deal close at these terms, the funding round would more than double the company’s valuation of$",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Microsoft says hackers are exploiting critical zero-day bugs to target Windows and Office users",
      "link": "https://techcrunch.com/2026/02/11/microsoft-says-hackers-are-exploiting-critical-zero-day-bugs-to-target-windows-and-office-users/",
      "author": "Zack Whittaker",
      "date": "2026-02-11T12:46:40-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/07/microsoft-logo-1865237814.jpg?resize=1200,863",
      "category": "Security",
      "content": "Microsoft has rolled out fixes for security vulnerabilities in Windows and Office, which the company says are being actively abused by hackers to break into people’s computers.\n\nThe exploits areone-click attacks, meaning that a hacker can plant malware or gain access to a victim’s computer with minimal user interaction. At least two flaws can be exploited by tricking someone into clicking a malicious link on their Windows computer. Another can result in a compromise on opening a malicious Office file.\n\nThe vulnerabilities are known aszero-days, because the hackers were exploiting the bugs before Microsoft had time to fix them.\n\nDetails of how to exploit the bugs have been published, Microsoft said, potentially increasing the chance of hacks. Microsoft did not say where they had been published, and a Microsoft spokesperson did not immediately comment when reached by TechCrunch. In its bug reports, Microsoft acknowledged the input of security researchers in Google’s Threat Intelligence Group in their discovery of the vulnerabilities.\n\nMicrosoft said one of the bugs, officially tracked asCVE-2026-21510, was found in the Windows shell, which powers the operating system’s user interface. The bug affects all supported versions of Windows, the company said. When a victim clicks on a malicious link from their computer, the bug allows hackers to bypass Microsoft’s SmartScreen feature that would typically screen malicious links and files for malware.\n\nAccording tosecurity expert Dustin Childs, this bug can be abused toremotely plant malwareon the victim’s computer.\n\n“There is user interaction here, as the client needs to click a link or a shortcut file,” Childs wrote in his blog post. “Still, a one-click bug to gain code execution is a rarity.”\n\nA Google spokesperson confirmed that the Windows shell bug was under “widespread, active exploitation,” and said successful hacks allowed the silent execution of malware with high privileges, “posing a high risk of subsequent system c",
      "excerpt": "Microsoft has rolled out fixes for security vulnerabilities in Windows and Office, which the company says are being actively abused by hackers to break into people’s computers.\n\nThe exploits areone-click attacks, meaning that a hacker can plant malware or gain access to a victim’s computer with mini",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Elon Musk suggests spate of xAI exits have been push, not pull",
      "link": "https://techcrunch.com/2026/02/11/senior-engineers-including-co-founders-exit-xai-amid-controversy/",
      "author": "Rebecca Bellan",
      "date": "2026-02-11T12:47:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2199701496.jpg?resize=1200,800",
      "category": "AI",
      "content": "Elon Musk is addressing a wave of departures from xAI, including two more co-founders who left this week, bringing the total to six out of the original 12.\n\nAt an all-hands meeting Tuesday night, Musk suggested the exits were about fit, not performance. “Because we’ve reached a certain scale, we’re organizing the company to be more effective at this scale,” he said,according to The New York Times. “And actually, when this happens, there’s some people who are better suited for the early stages of a company and less suited for the later stages.”\n\nWednesday afternoon on X, he went further, making clear these departuresweren’t voluntary. “xAI was reorganized a few days ago to improve speed of execution,” Musk wrote. “As a company grows, especially as quickly as xAI, the structure must evolve just like any living organism. This unfortunately required parting ways with some people.”\n\nHe added that the company is “hiring aggressively” and closed with a quintessentially Musk pitch: “Join xAI if the idea of mass drivers on the Moon appeals to you.”\n\nLosing half your co-founders in a relatively short period raises questions, and Musk’s comments seem designed to control the narrative, reframing the exits as necessary rather than a problem for the outfit.\n\nIn total, at least 10 engineers, including thetwo co-founders, have publicly announced their departure from xAI in the past week — though two of those exits appear to have occurred a few weeks ago.\n\nThree of the departing staff members have said they will be starting something new alongside other former xAI engineers, although no details are available about the new venture. Others have hinted at a desire for more autonomy and smaller teams to build frontier tech more rapidly, pointing to the anticipated surge in AI productivity.\n\nYuhuai (Tony) Wu, an xAI co-founder and reasoning lead,said in a postannouncing his resignation: “It’s time for my next chapter. It is an era with full possibilities: a small team armed with AIs can ",
      "excerpt": "Elon Musk is addressing a wave of departures from xAI, including two more co-founders who left this week, bringing the total to six out of the original 12.\n\nAt an all-hands meeting Tuesday night, Musk suggested the exits were about fit, not performance. “Because we’ve reached a certain scale, we’re ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Musk needed a new vision for SpaceX and xAI. He landed on Moonbase Alpha.",
      "link": "https://techcrunch.com/2026/02/12/musk-needed-a-new-vision-for-spacex-and-xai-he-landed-on-moonbase-alpha/",
      "author": "Tim Fernholz",
      "date": "2026-02-12T14:10:55-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Screenshot-2026-02-12-at-10.37.51-AM.png?resize=1200,666",
      "category": "AI",
      "content": "“Join xAI if the idea of mass drivers on the Moon appeals to you,” CEO Elon Muskproclaimedyesterday following a restructuring that saw a stream of former executivesexit the AI lab.\n\nThis is an interesting recruitment strategy after the company’s merger with Musk’s rocket maker, SpaceX, and the combined company’s anticipated IPO. You might think that xAI employees ought to be fascinated with achieving AGI, using deep learning models to disrupt traditional software companies, or simply bad wordplay like “Macrohard.” But instead, Elon is going to the moon.\n\nAfter outlining plans tobuild AI data centers in orbit, the primary synergy between the two companies, Musk took the idea further. “What if you want to go beyond a mere terawatt per year?” Musk asked. “To do that, you have to go to the moon…I really want to see a mass driver on the moon that is shooting AI satellites into deep space.”\n\nIn Musk’s telling, the step beyond data centers orbiting Earth is even larger computers in deep space. And furthermore, Musk says the best way to achieve that is to build a city on the moon to manufacture space computers and hurl them into the solar system using a big maglev train.\n\nIf that all feels a bit much, veteran Musk watchers know there’s a clue about where the discussion appears in a video of anall-hands meetingxAI shared with the public. The slide describing the moon base comes at the end of the presentation deck, where, during SpaceX pep talks, Musk typically shares renderings of SpaceX rockets landing on Mars and waxes rhapsodic about the future of multi-planetary humanity.\n\nNotably, the Moonbase comes just after SpaceX has publicly backed away from its long-held goal of colonizing Mars. Now, with xAI in the corporate fold, Musk needs a new science fiction metaphor for the future: In this case, theKardashev Scale, a theoretical measure of galactic civilizations coined by the eponymous Soviet astronomer in the 1960s. The idea is climbing the scale of energy usage — early ci",
      "excerpt": "“Join xAI if the idea of mass drivers on the Moon appeals to you,” CEO Elon Muskproclaimedyesterday following a restructuring that saw a stream of former executivesexit the AI lab.\n\nThis is an interesting recruitment strategy after the company’s merger with Musk’s rocket maker, SpaceX, and the combi",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Didero lands $30M to put manufacturing procurement on ‘agentic’ autopilot",
      "link": "https://techcrunch.com/2026/02/12/didero-lands-30m-to-put-manufacturing-procurement-on-agentic-autopilot/",
      "author": "Marina Temkin",
      "date": "2026-02-12T12:31:47-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Founders_Exterior_Mid-3.jpg?resize=1200,800",
      "category": "Startups",
      "content": "Tim Spencer realized just how complicated manufacturing procurement can be while runningMarkai, an e-commerce startupin Asia, during the pandemic.\n\n“We had thousands of suppliers, and we were distributing products into dozens of countries around the world,” Spencer (pictured left) told TechCrunch. His staff was overwhelmed by the manual complexity of sourcing suppliers, negotiating pricing, tracking orders, and managing payments.\n\n“I found myself running this big team that was not really set up for success,” he said. He sold Markai in 2023, just as it was becoming clear that generative AI could streamline the most time-consuming procurement hurdles for manufacturers and distributors.\n\nLater that year, Spencer launchedDiderowith Lorenz Pallhuber (pictured center), a veteran of McKinsey’s procurement practice, and Tom Petit, the former technical co-founder ofLandis.\n\nDidero, whose mission is to automate many of the complexities of global procurement, just raised a $30 million Series A co-led by Chemistry and Headline, with participation from Microsoft’s venture fund M12.\n\n“Global trade runs on natural language communication,” Spencer said. “It’s emails, WeChat, phone calls, purchase orders, and packing lists.”\n\nUntil the advent of generative AI, these fragmented pieces had to be tracked by humans who spent their days chasing suppliers and manually updating systems of record. Didero claims its platform can ingest that communication, putting a significant portion of the procurement workflow on autopilot.\n\nDidero functions as an agentic AI layer that sits on top of a company’s existing ERP, acting as a coordinator that reads incoming communications and automatically executes the necessary updates and tasks.\n\n“The goal is to go from ‘I need a good’ to payment without having to lift a finger,” Spencer said.\n\nUnlike Levelpath, Zip, or Oro Labs, which use AI to streamline corporate purchasing, Didero focuses on the supply chain. Its platform is designed for manufacturers and",
      "excerpt": "Tim Spencer realized just how complicated manufacturing procurement can be while runningMarkai, an e-commerce startupin Asia, during the pandemic.\n\n“We had thousands of suppliers, and we were distributing products into dozens of countries around the world,” Spencer (pictured left) told TechCrunch. H",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}