{
  "last_updated": "2026-02-10T23:40:34.151892+00:00",
  "articles": [
    {
      "title": "Google sent personal and financial information of student journalist to ICE",
      "link": "https://techcrunch.com/2026/02/10/google-sent-personal-and-financial-information-of-student-journalist-to-ice/",
      "author": "Lorenzo Franceschi-Bicchierai",
      "date": "2026-02-10T12:41:21-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/google-logo.jpg?resize=1200,800",
      "category": "Security",
      "content": "Google handed over a trove of personal data about a student and journalist to U.S. Immigration and Customs Enforcement in response to a subpoena that had not been approved by a judge,according to a report by The Intercept.\n\nThe search and advertising tech giant provided ICE with the usernames, physical addresses, and an itemized list of services associated with the Google account of Amandla Thomas-Johnson, a British student and journalist who briefly attended a pro-Palestinian protest in 2024 while attending Cornell University in New York.\n\nGoogle also turned over Thomas-Johnson’s IP addresses, phone numbers, subscriber numbers and identities, and credit card and bank account numbers linked to his account.\n\nThe subpoena, which reportedly included a gag order, did not include a specific justification for why ICE was requesting Thomas-Johnson’s personal data, but the studentpreviously saidthat the demand for his data came within two hours of Cornell informing him that the U.S. government had revoked his student visa.\n\nThis is the latest example of how the U.S. government is using a controversial type of legal request, called an administrative subpoena, to demand that tech companiesturn over the private data of individualswho have been critical of the Trump administration. This has included anonymous Instagram accounts that share information about ICE presence and raids, as well as people who criticize or protest Trump and his policies.\n\nICE and Google did not immediately respond to a request for comment.\n\nAdministrative subpoenas are issued directly by federal agencies without the intervention of a judge. These legal demands cannot compel companies to turn over the contents of a person’s email accounts, online searches, or location data, but can request metadata and other identifiable information, such as email addresses, in an attempt to de-anonymize the owner of a certain online account.\n\nUnlike a court order, tech companies are under no obligation to provide someon",
      "excerpt": "Google handed over a trove of personal data about a student and journalist to U.S. Immigration and Customs Enforcement in response to a subpoena that had not been approved by a judge,according to a report by The Intercept.\n\nThe search and advertising tech giant provided ICE with the usernames, physi",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "VC Masha Bucher, Epstein associate and Day One founder, explains herself",
      "link": "https://techcrunch.com/2026/02/10/vc-masha-bucher-epstein-associate-and-day-one-founder-explains-herself/",
      "author": "Julie Bort",
      "date": "2026-02-10T13:07:44-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/12/WhatsApp-Image-2025-11-26-at-12.51.48.jpeg?resize=909,1200",
      "category": "Venture",
      "content": "Masha Bucher, a Silicon Valley VC and founder of Day One Ventures,took to Xthis week to address news reports documenting her close business and personal relationship with convicted sex offender Jeffrey Epstein. Bucher’s name — primarily under her maiden name, Masha Drokova — appeared in the latest dump of Epstein files over 1,600 times,The San Francisco Standard reported.\n\n“He made me feel I could be safe from the regime, someone with power and connections who could shield me” from threats she associated with her home country Russia, which she said she feared after she obtained her U.S. green card, she wrote in the post.\n\n“I was naive; I didn’t dig deep enough early on,” she wrote about why she agreed to work with Epstein. “I believed his story that his earlier conviction was about sleeping with a girl who lied about her age and trusted validations from multiple investors and scientists.” She also apologized to her founders, team, and investors, saying that this situation has “caused pain I never intended.”\n\nThe files paint a picture of how Bucher — whose Silicon Valley career began in social media and public relations — agreed to become Epstein’s publicist in 2017, helping rehabilitate his reputation after his 2008 sex-trafficking conviction and setting up meetings between him and various journalists,as Forbes reported.\n\nThe documents show that Epstein supported and encouraged her in the early days of Day One Ventures. The firm has since grown substantially — as Buchertold TechCrunch, it closed its most recent fund, a $150 million third vehicle, in 2024, bringing its assets under management to $450 million.\n\nSome of the most salacious details from the emails involve Epstein giving her money and a Prada bag, and on one occasion, asking her for nude photos — though there’s no indication whether she complied — according toSFGate. Bucher is certainly a well-known VC in the Valley, having backed breakout companies like Superhuman, Remote, Worldcoin, and Truebill (whiche",
      "excerpt": "Masha Bucher, a Silicon Valley VC and founder of Day One Ventures,took to Xthis week to address news reports documenting her close business and personal relationship with convicted sex offender Jeffrey Epstein. Bucher’s name — primarily under her maiden name, Masha Drokova — appeared in the latest d",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Nearly half of xAI’s founding team has now left the company",
      "link": "https://techcrunch.com/2026/02/10/nearly-half-of-xais-founding-team-has-now-left-the-company/",
      "author": "Russell Brandom",
      "date": "2026-02-10T12:31:51-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2223576505.jpg?resize=1200,800",
      "category": "AI",
      "content": "Monday night, xAI co-founder Yuhuai (Tony) Wu announced he was leaving the company. “It’s time for my next chapter,” Wu wrotein a late-night poston X. “It is an era with full possibilities: a small team armed with AIs can move mountains and redefine what’s possible.”\n\nOn its own, it’s a pretty standard tech departure announcement — but it’s part of a troubling pattern for the lab. Five members ofthe company’s 12-person founding teamhave now left the company, with four of the departures coming in just the last year. Infrastructure lead Kyle Kosic left for OpenAI in mid-2024, followed by Google veteran Christian Szegedy in February 2025. This past August, Igor Babuschkinleft to found a venture firm, and Microsoft alum Greg Yang departed just last month,citing health issues.\n\nBy all accounts, the splits have all been amicable, and there are lots of reasons why, nearly three years in, some founders might decide to move on. Elon Musk is a notoriously demanding boss, and with the SpaceX’s acquisition of xAI complete and an IPO pending in the coming months, everyone involved has a pretty big windfall coming. It’s a great time to be fundraising for an AI startup, so it’s only natural for high-level researchers to want to strike out on their own.\n\nThere are also less amicable reasons that might factor in. The company’s flagship product, the Grok chatbot, has struggled withbizarre behaviorandapparent internal tampering— the kind of thing that might easily create friction on the technical team. Then there were the recent changes to xAI’s image-generation tools thatflooded the platform with deepfake pornography, sparking slow-moving but reallegal consequences.\n\nWhatever the cause, the cumulative impact is alarming. There is a lot of work left to do at xAI, and an IPO will bring more scrutiny than the lab has ever faced before. With Musk alreadyspinning up plans for orbital data centers, the pressure to make good on those plans will be intense. The pace of model development isn’",
      "excerpt": "Monday night, xAI co-founder Yuhuai (Tony) Wu announced he was leaving the company. “It’s time for my next chapter,” Wu wrotein a late-night poston X. “It is an era with full possibilities: a small team armed with AIs can move mountains and redefine what’s possible.”\n\nOn its own, it’s a pretty stand",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Vega raises $120M Series B to rethink how enterprises detect cyber threats",
      "link": "https://techcrunch.com/2026/02/10/vega-raises-120m-series-b-to-rethink-how-enterprises-detect-cyber-threats/",
      "author": "Rebecca Bellan",
      "date": "2026-02-10T08:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Shay-Sandler-Eli-Rosen.-Credit-Ohad-Kab.jpeg?resize=1200,802",
      "category": "AI",
      "content": "Modern enterprises generate enormous amounts of security data, but legacy tools like Splunk still require companies to store all of it in one place before they can detect threats — a slow and costly process that’s increasingly breaking down in cloud environments where volumes are exploding and data lives everywhere.\n\nAI cybersecurity startupVega Securitywants to flip that approach by running security where the data already lives, implementing in cloud services, data lakes, and existing storage systems. And the two-year-old firm just raised a $120 million Series B round to scale that vision, TechCrunch has exclusively learned.\n\nLed by Accel with participation from Cyberstarts, Redpoint, and CRV, the new round nearly doubles Vega’s valuation to $700 million, and brings its total funding to $185 million, money the startup will use to further develop its AI-native security operations suite, beef up its go-to-market team, and expand globally.\n\nShay Sandler, co-founder and CEO of Vega, told TechCrunch that the current operating model of the SIEM (security information and event management) — the dominant technology in this domain for the last two decades — is not only “crazy expensive,” but is also increasingly causing AI-native security operations to fail. In complex cloud environments, he says, the current model often increases exposure to threat actors.\n\n“Vega has defined a new operating model that enables organizations to leverage the full potential of their enterprise data to achieve incident response readiness, without all the complexity, the cost, the drama,” Sandler told TechCrunch. “We want to simply enable them to reach AI-native detection response capability anywhere the data is, at scale.”\n\nLike so many cybersecurity founders, Sandler did his time in the Israeli military’s cybersecurity unit before being one of the founding employees behind Granulate, whichIntel acquired for $650 millionin 2022. After a year at Intel, Sandler decided to “do it big time in the c",
      "excerpt": "Modern enterprises generate enormous amounts of security data, but legacy tools like Splunk still require companies to store all of it in one place before they can detect threats — a slow and costly process that’s increasingly breaking down in cloud environments where volumes are exploding and data ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Former Tesla product manager wants to make luxury goods impossible to fake, starting with a chip",
      "link": "https://techcrunch.com/2026/02/10/former-tesla-product-manager-wants-to-make-luxury-goods-impossible-to-fake-starting-with-a-chip/",
      "author": "Ivan Mehta",
      "date": "2026-02-10T08:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Veritas-feat-photo.jpg?w=1200",
      "category": "Commerce",
      "content": "The fake goods crisis cuts two ways. Luxury brands lose more than$30 billion a yearto counterfeits, while buyers in the booming$210 billion second-hand markethave no reliable way to verify that what they’re purchasing is genuine.Veritaswants to solve both problems with a solution that combines custom hardware and software.\n\nThe startup claims that it has developed a “hack-proof” chip that can’t be bypassed by devices like Flipper Zero, a widely available hacking tool that can be used to tamper with wireless systems. These chips are linked with digital certificates to verify the authenticity of the products.\n\nVeritas founder Luci Holland has experienced life as both a technologist and an artist. She has worked in different artistic mediums, including mixed media painting and metal sculpture. She has also worked at Tesla as a technical product manager and has held several business development, community growth, and product management roles at tech companies and venture funds.\n\nHolland noted that traditionally, luxury goods makers use various symbols or physical marks to authenticate their products. However, with the growing demand for these goods, counterfeiters have learned to create convincing copies of these marks along with high-quality fake certificates. These goods are often called “superfakes.”\n\nHolland mentioned that she spoke with maisons — established luxury fashion houses — that said some of their locations had to stop authenticating goods because fakes were becoming too convincing to reliably detect. She said that drawing on her experience in both the tech and art worlds, she wanted to solve the problem.\n\n“For me, as someone who has a background in being a designer and then also has experience in tech, I saw this problem and thought about the different ways we could solve it. I think what’s truly innovative is we’ve used and combined elements from both hardware and software to create this solution that helps protect brands in this way to convey the informa",
      "excerpt": "The fake goods crisis cuts two ways. Luxury brands lose more than$30 billion a yearto counterfeits, while buyers in the booming$210 billion second-hand markethave no reliable way to verify that what they’re purchasing is genuine.Veritaswants to solve both problems with a solution that combines custo",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Former GitHub CEO raises record $60M dev tool seed round at $300M valuation",
      "link": "https://techcrunch.com/2026/02/10/former-github-ceo-raises-record-60m-dev-tool-seed-round-at-300m-valuation/",
      "author": "Julie Bort",
      "date": "2026-02-10T06:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Github-Thomas.jpeg?resize=1200,800",
      "category": "Startups",
      "content": "Former GitHub CEO Thomas Dohmke has raised the largest-ever seed round for a dev tool startup, according to its lead backer, Felicis. The startup,Entire, has raised $60 million at a $300 million valuation.\n\nEntire offers an open source tool to help developers better manage code written by AI agents.\n\nEntire’s tech has three components. One is a Git-compatible database to unify the AI-produced code. Git is a distributed version control system popular with enterprises and used by open source sites like GitHub and GitLab.\n\nAnother component is what it calls “a universal semantic reasoning layer” intended to allow multiple AI agents to work together. The final piece is an AI-native user interface designed with agent-to-human collaboration in mind.\n\nThe first product Entire is releasing is an open source tool it calls Checkpoints that automatically pairs every bit of software the agent submits for use in a software project with the context that created it, including prompts and transcripts. The idea is to allow the human developer to review, search, and perhaps even learn from why the AI did what it did.\n\nEntire hopes to help developers better deal with the large volumes of software created by AI coding agents. Popular open source projects areparticularly overwhelmed these days with suggested code contributionsthat may or may not be AI slop — meaning poorly designed and possibly unusable code.\n\nDohmke explains in the press release: “We are living through an agent boom, and now massive volumes of code are being generated faster than any human could reasonably understand. The truth is, our manual system of software production — from issues, to git repositories, to pull requests, to deployment — was never designed for the era of AI in the first place.”\n\nDohmke was CEO of Microsoft’s GitHub for four years, leaving in August 2025 to found a startup, he said in aposton X at the time. During his time there, he oversaw the rise of the popular coding agent GitHub Copilot.\n\nOther ",
      "excerpt": "Former GitHub CEO Thomas Dohmke has raised the largest-ever seed round for a dev tool startup, according to its lead backer, Felicis. The startup,Entire, has raised $60 million at a $300 million valuation.\n\nEntire offers an open source tool to help developers better manage code written by AI agents.",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Singapore says China-backed hackers targeted its four largest phone companies",
      "link": "https://techcrunch.com/2026/02/10/singapore-china-backed-hackers-targeted-largest-phone-companies-salt-typhoon/",
      "author": "Zack Whittaker",
      "date": "2026-02-10T08:19:39-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/singapore-2152482714.jpg?resize=1200,800",
      "category": "Security",
      "content": "Singapore’s government has blamed a known Chinese cyber-espionage group for targeting four of its top telecommunication companies as part of a months-long attack.\n\nIna statement Monday, Singapore confirmed for the first time that the hackers, known as UNC3886, targeted the country’s telecoms infrastructure, including its largest companies: Singtel, StarHub, M1, and Simba Telecom. The government previously said that it was responding to an unspecified attack on its critical infrastructure.\n\nWhile the intruders were able to breach and access some systems, they did not disrupt services or access personal information, said K. Shanmugam, the country’s coordinating minister for national security.\n\nGoogle-owned cybersecurity unit Mandiantpreviously linkedUNC3886 as an espionage group likely working on behalf of China. The Chinese government is known to conduct regular cyber-espionage operations, as well asprepositioning for disruptive attacksahead of an anticipated invasion of Taiwan, which Beijing has routinely denied,per Reuters.\n\nUNC3886 is known for exploitingzero-day vulnerabilitiesin routers, firewalls, and virtualized environments, where cybersecurity tools that are designed to spot malware cannot typically reach. The hacking group hastargeted the defense, technology, and telecom industriesacross the U.S. and the Asia-Pacific region.\n\nIn the case of the attack on Singapore’s top telcos, Shanmugam said the hackers used advanced tools, like rootkits, to gain long-term persistence to their systems.\n\n“In one instance, they were able to gain limited access to critical systems but did not get far enough to have been able to disrupt services,” according to the government’s statement.\n\nPer Reuters, the telcos said in a joint statement that the companies regularly face distributed denial-of-service and other malware attacks. “We adopt defence-in-depth mechanisms to protect our networks and conduct prompt remediation when any issues are detected,” the statement read.\n\nThe att",
      "excerpt": "Singapore’s government has blamed a known Chinese cyber-espionage group for targeting four of its top telecommunication companies as part of a months-long attack.\n\nIna statement Monday, Singapore confirmed for the first time that the hackers, known as UNC3886, targeted the country’s telecoms infrast",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Google expands tools to let users remove sensitive data about themselves from Search",
      "link": "https://techcrunch.com/2026/02/10/google-remove-sensitive-personal-data-from-search/",
      "author": "Aisha Malik",
      "date": "2026-02-10T07:54:48-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2198713751.jpg?w=1024",
      "category": "Apps",
      "content": "As part of Safer Internet Day, Googleunveiled updatesto its “Results about you” and non-consensual explicit image removal tools.\n\nThe “Results about you” tool already allows users to remove Search results containing their phone number, email address, or home address, and it can now also be used to request the removal of results that include information such as a driver’s license, passport, or Social Security number, the company said in the update Tuesday.\n\nYou can access the tool in the Google app by tapping your Google account photo and selecting “Results about you.” If it’s your first time using the tool, you need to click “Get started” and then add the personal contact information you want to monitor. You’ll then be prompted to add your government ID numbers. Existing users can add their ID numbers and select which ones they want to monitor.\n\nOnce you’ve confirmed your details, Google will automatically monitor Search results and notify you if it finds results that contain your information. Google notes that removing this information from Search doesn’t remove it from the web entirely, but that doing so can help keep your information private.\n\nThe update is rolling out in the U.S. over the coming days. Google plans to bring it to additional regions in the future.\n\nThe tech giant also announced that it’s making it easier to request the removal of non-consensual explicit images on Search. Now, users just have to click on the three dots on an image, select “remove result,” then tap “It shows a sexual image of me.” Additionally, you no longer need to report images one by one, as you can now select and submit requests for multiple images from Search results using a single form. Users can also track the status of all requests in one place within the “Results about you” hub.\n\n“We understand that removing existing content is only part of the solution,” Google wrote in itsblog post. “For added protection, the new process allows you to opt-in to safeguards that will proact",
      "excerpt": "As part of Safer Internet Day, Googleunveiled updatesto its “Results about you” and non-consensual explicit image removal tools.\n\nThe “Results about you” tool already allows users to remove Search results containing their phone number, email address, or home address, and it can now also be used to r",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Amazon may launch a marketplace where media sites can sell their content to AI companies",
      "link": "https://techcrunch.com/2026/02/10/amazon-may-launch-a-marketplace-where-media-sites-can-sell-their-content-to-ai-companies/",
      "author": "Lucas Ropek",
      "date": "2026-02-10T15:16:28-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2198353077.jpg?w=1024",
      "category": "AI",
      "content": "The AI industry’s pursuit of licensable content has beena messy affair, filled with lawsuits and accusations of copyright infringement. Now, as tech companies look for legally safe sources of AI training data, Amazon is reportedly considering launching a marketplace where publishers can license their content directly to AI companies.\n\nThe InformationreportedMonday that the e-commerce giant has been meeting with publishing executives and alerting them to its plans to launch such a marketplace. Ahead of an AWS conference for publishers that occurred Tuesday, Amazon “circulated slides that mention a content marketplace,” wrote the outlet.\n\nReached by TechCrunch, an Amazon spokesperson didn’t deny the story but didn’t directly address the would-be marketplace either, saying only: “Amazon has built long-lasting, innovative relationships with publishers across many areas of our business, including AWS, Retail, Advertising, AGI, and Alexa. We are always innovating together to best serve our customers, but we have nothing specific to share on this subject at this time.”\n\nAmazon wouldn’t be the first major tech company to take this route. Microsoft recentlylaunchedwhat it calls a Publisher Content Marketplace (PCM), which it says will give publishers “a new revenue stream” while also providing AI systems with “scaled access to premium content.” Microsoft added that the PCM was designed to “empower publishers with a transparent economic framework for licensing” their content.\n\nThe move is a natural next step for the AI industry, which has already sought to solve the legally nebulous problem of how copyrighted material ends up in AI training data by forging deals with major news outlets and media organizations. OpenAI, for instance, has already signedcontent-licensing partnershipswith the Associated Press, Vox Media, News Corp, and The Atlantic, among others.\n\nThose efforts haven’t been enough to stem the legal fallout. The fight over copyrighted material in AI algorithms has ",
      "excerpt": "The AI industry’s pursuit of licensable content has beena messy affair, filled with lawsuits and accusations of copyright infringement. Now, as tech companies look for legally safe sources of AI training data, Amazon is reportedly considering launching a marketplace where publishers can license thei",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "An ice dance duo skated to AI music at the Olympics",
      "link": "https://techcrunch.com/2026/02/10/olympics-czech-ice-dancers-duo-ai-music/",
      "author": "Amanda Silberling",
      "date": "2026-02-10T14:31:13-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2260763822.jpg?resize=1200,800",
      "category": "AI",
      "content": "Czech ice dancers Kateřina Mrázková and Daniel Mrázek made their Olympic debut on Monday, an unfathomable feat that takes a lifetime of dedication and practice. But the sibling duo used AI music in their rhythm dance program, which doesn’t break any official rules, but serves as a depressing symbol of how absolutely cooked we are.\n\nAs Mrázek spun his sister in a crazy cartwheel-lift-sort-of-move that made them look superhuman, one of the NBC commentators mentioned in passing, “This is AI generated, this first part,” referring to the music. Somehow, that admission is even more baffling than the gravity-defying tricks that the siblings showed off on the pressure of Olympic ice.\n\nThe Olympic ice dance competition is split into two events: the rhythm dance, where pairs must perform a routine that meets a specific theme, and the free dance. This season’s theme is “The Music, Dance Styles, and Feeling of the 1990s.” British ice dancing duo Lilah Fear and Lewis Gibson paid tribute to the Spice Girls, while United States favorites Madison Chock and Evan Bates skated to a Lenny Kravitz medley.\n\nBut, for whatever reason — licensing issues? — Mrázková and Mrázek danced to a routine with music that’s half AC/DC and half AI. It’s weird. What’s even weirder is that this isn’t the duo’s first use of AI, nor is it the first time that this choice backfired.\n\nPer the International Skating Union, the governing body that oversees competitive ice skating, theduo’s music choicefor the rhythm dance this season has been “One Two by AI (of 90s style Bon Jovi)” and “Thunderstruck by AC/DC.” The official Olympics websiteconfirmsthat the duo is using the AI-generated song for the rhythm dance portion.\n\nok I know this is an art account but I have been seething about this ever since Shana Bartel caught it and wrote about it in her blog (which you should be reading it’s very good – link below) and I just NEEDED to get it out of me.  https://www.patreon.com/posts/142706982?utm_campaign=postshare_f",
      "excerpt": "Czech ice dancers Kateřina Mrázková and Daniel Mrázek made their Olympic debut on Monday, an unfathomable feat that takes a lifetime of dedication and practice. But the sibling duo used AI music in their rhythm dance program, which doesn’t break any official rules, but serves as a depressing symbol ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}