{
  "last_updated": "2026-02-04T03:59:38.667649+00:00",
  "articles": [
    {
      "title": "The Minneapolis tech community holds strong during ‘tense and difficult time’",
      "link": "https://techcrunch.com/2026/02/03/minnesota-tech-community-founders-investors-ice-response/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-03T14:17:45-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2257689472.jpg?w=1024",
      "category": "Startups",
      "content": "The city’s tech scene is reeling as U.S. immigration agents have escalated their crackdown in Minneapolis,killing several people, including at least two U.S. citizens.\n\nEight Minneapolis-based founders and investors told TechCrunch that they have put much of their work on hold and now spend their days focused on their communities, volunteering at churches, and helping buy food. It’s part of a grassroots effort, across race and class, that is seeing people speak out, donate money, protest, and offer emotional support to one another.\n\n“There’s a lot of commonality between how a teacher is reacting right now and how a tech professional is reacting,” Scott Burns, an investor in the area, told TechCrunch. He said people are “very fatigued.” Burns is going to church more often to help pack food to deliver to those too frightened to leave their homes. “It was like what happens after a natural disaster,” he said of the effort.\n\nBurns and other members of the Minneapolis tech industry told TechCrunch that the immigration raids have been very disruptive to their lives, describing a city that has seen itself united in the last several weeks in theface of escalating violencefrom U.S. Immigration and Customs Enforcement.\n\nHow can building a company remain a focal point when ICE agents appear to be everywhere,plainclothedandarmed with military-grade weapons? Federal agents have been seen searching public transportation and prowling around workplaces. They are outside homes andin parking lots. They have beenspotted circling schools.\n\nOne Black founder, who spoke on condition of anonymity to protect members of his staff, said he now carries his passport with him everywhere he goes. He is a U.S. citizen but has seen people of color throughout the city profiled and picked up by ICE and border patrol agents.\n\n“People aren’t exaggerating how hard it has been. It’s hard to focus; it’s been a challenge just navigating even my team through it,” he said.\n\nHe recalled a routine phone meetin",
      "excerpt": "The city’s tech scene is reeling as U.S. immigration agents have escalated their crackdown in Minneapolis,killing several people, including at least two U.S. citizens.\n\nEight Minneapolis-based founders and investors told TechCrunch that they have put much of their work on hold and now spend their da",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Homeland Security is trying to force tech companies to hand over data about Trump critics",
      "link": "https://techcrunch.com/2026/02/03/homeland-security-is-trying-to-force-tech-companies-to-hand-over-data-about-trump-critics/",
      "author": "Zack Whittaker",
      "date": "2026-02-03T10:35:19-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2259748542_ba5e93.jpg?w=800",
      "category": "Security",
      "content": "The Department of Homeland Security has been quietly demanding tech companies turn over user information about critics of the Trump administration, according to reports.\n\nIn several cases over recent months, Homeland Security has relied on the use of administrative subpoenas to seek identifiable information about individuals who run anonymous Instagram accounts, which share posts about ICE immigration raids in their local neighborhoods. These subpoenas have also been used to demand information about people who have criticized Trump officials or protested government policies.\n\nUnlike judicial subpoenas, which are authorized by a judge after seeing enough evidence of a crime to authorize a search or seizure of someone’s things, administrative subpoenas are issued by federal agencies, allowing investigators to seek a wealth of information about individuals from tech and phone companies without a judge’s oversight.\n\nWhile administrative subpoenas cannot be used to obtain the contents of aperson’s emails, online searches, or location data, they can demand information specifically about the user, such as what time a user logs in, from where, using which devices, and revealing the email addresses and other identifiable information about who opened an online account. But because administrative subpoenas are not backed by a judge’s authority or a court’s order, it’s largely up to a company whether to give over any data to the requesting government agency.\n\nAdministrative subpoenas are not new; the use of these self-signed demands by Trump officials to seek identifiable information about people who are critical of the president’s policies has raised alarm.\n\nBloombergreported last weekthat Homeland Security sought the identity of an anonymous Instagram account called@montocowatch, which says its goal is to share resources to help protect immigrant rights and due process across Montgomery County in Pennsylvania. This comes amid an ongoing federal immigration crackdown across th",
      "excerpt": "The Department of Homeland Security has been quietly demanding tech companies turn over user information about critics of the Trump administration, according to reports.\n\nIn several cases over recent months, Homeland Security has relied on the use of administrative subpoenas to seek identifiable inf",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "2026 plans: What’s next for Startup Battlefield 200",
      "link": "https://techcrunch.com/2026/02/03/looking-ahead-to-2026-whats-next-for-startup-battlefield-200/",
      "author": "Isabelle Johannessen",
      "date": "2026-02-03T10:57:30-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/11/54889460445_20c033b45a_o-2.jpg?resize=1200,800",
      "category": "Startups",
      "content": "TechCrunch Startup Battlefield 200is the flagship early-stage startup competition held atTechCrunch Disruptin San Francisco, spotlighting the world’s most promising young companies. Each year, thousands of applicants from around the globe vie for one of 200 slots in the cohort, which provides unparalleled visibility, access to top-tier investors, and opportunities to grow.\n\nEarly-stage startups from around the world are joining theStartup Battlefield email listto be the first to know when applications open this month. Don’t miss a beat if you’re ready to join the action.\n\nStartup Battlefield 200is a highly selective startup launch program designed to prepare early-stage startups for visibility, investment, and scale. Each year, TechCrunch hand-selects 200 companies to gain unmatched exposure, credibility, and opportunities to scale faster than they ever imagined:\n\nStartup Battlefield’s track record is among the strongest in the industry — alumni represent1,700+ companiesthat have collectively raised over $32 billion and include well-known names such as:\n\nIn 2026,Startup Battlefield 200will once again bring together a global cohort of high-potential early-stage startups building across AI, climate, health, fintech, and beyond.\n\nApplications will open in the middle of this month and close in mid-June. Selected startups will be notified aroundSeptember 1, when the virtual preparation program begins — designed to help founders refine their story, sharpen their pitch, and get ready for the pitch of a lifetime on the TechCrunch Disrupt stage.\n\nFor founders and investors alike, Startup Battlefield 200 remains one of the most influential global early-stage startup stages — a place where breakout companies get seen, funded, and scaled.\n\nDon’t miss a moment of the action:Join the Startup Battlefield mailing listto be the first to know when applications open next month.",
      "excerpt": "TechCrunch Startup Battlefield 200is the flagship early-stage startup competition held atTechCrunch Disruptin San Francisco, spotlighting the world’s most promising young companies. Each year, thousands of applicants from around the globe vie for one of 200 slots in the cohort, which provides unpara",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "YC startups can now receive investment in stablecoin",
      "link": "https://techcrunch.com/2026/02/03/yc-startups-can-now-recieve-investment-in-stablecoin/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-03T11:54:12-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/06/shrinking-yc.jpg?resize=1200,675",
      "category": "",
      "content": "All startups accepted into YC will soon have the option to receive their seed checks via stablecoins, crypto YC partner Nemil Dalaltold The Block.\n\nYC’s famous“standard deal”is that it invests $500,000 into startups accepted into its program in exchange for 7% of their companies. Now that deal is hitting the blockchain (Base, Solana, and Ethereum, to be exact), starting with the upcoming spring batch.\n\nDalal said that stablecoin transfers are often more effective, specifically for founders working in emerging markets. But also, YC is putting its money where its mouth is, so to speak.Last fall, YCpartnered withBase and Coinbase Ventures to encourage founders to build more blockchain-related companies.\n\nInterest in blockchain tech is on the rise again in Silicon Valley as the U.S.has taken steps towardmore formal, crypto-friendly regulation of the industry.",
      "excerpt": "All startups accepted into YC will soon have the option to receive their seed checks via stablecoins, crypto YC partner Nemil Dalaltold The Block.\n\nYC’s famous“standard deal”is that it invests $500,000 into startups accepted into its program in exchange for 7% of their companies. Now that deal is hi",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Intel will start making GPUs, a market dominated by Nvidia",
      "link": "https://techcrunch.com/2026/02/03/intel-will-start-making-gpus-a-market-dominated-by-nvidia/",
      "author": "Rebecca Szkutak",
      "date": "2026-02-03T13:01:34-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2228936694.jpg?resize=1200,800",
      "category": "",
      "content": "As Intel continues to try to turn itself around, its CEO promised that the company will start producing a new type of chip, one that has been made very popular by rival Nvidia.\n\nAt theCisco AI Summiton Tuesday, Intel CEO Lip-Bu Tan announced that the company will start producing graphics processing units (GPUs). These are more specialized processors, compared to the CPUs Intel traditionally produces, and are used for gaming and tasks like training artificial intelligence models.\n\nTechCrunch reached out to Intel for more information.\n\nThe project will be overseen by Kevork Kechichian, the executive vice president and general manager of Intel’s data center group, according toreporting from Reuters. Kechichian was hired in September among aslew of new engineer-focused hires.\n\nIntel also hired Eric Demers for the effort in January. Demers was previously at Qualcomm for more than 13 years, most recently serving as a senior vice president of engineering.\n\nThis initiative seems to be in relatively early stages as Tan said the company plans to develop its strategy around customer demands and needs.\n\nWhile Nvidia didn’t invent the GPU, that specific kind of chip has played a large role in its success. Its GPUs for AI systems are so advanced and popular, the chipmaker currently holds acommanding market lead.\n\nIt’s interesting to see Intel expand into this area now as Tan said the company would beconsolidating and focusing on its core businesseswhen he took the helm as CEO last March. While GPUs are still semiconductors, of course, this is still a notable expansion.",
      "excerpt": "As Intel continues to try to turn itself around, its CEO promised that the company will start producing a new type of chip, one that has been made very popular by rival Nvidia.\n\nAt theCisco AI Summiton Tuesday, Intel CEO Lip-Bu Tan announced that the company will start producing graphics processing ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Skyryse lands another $300M to make flying, even helicopters, simple and safe",
      "link": "https://techcrunch.com/2026/02/03/skyryse-lands-another-300m-to-make-flying-even-helicopters-simple-and-safe/",
      "author": "Kirsten Korosec",
      "date": "2026-02-03T10:21:23-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/skyryse-helicopters.jpg?resize=1200,675",
      "category": "Transportation",
      "content": "Skyryse, an El Segundo, California-based aviation automation startup, has raised more than $300 million in a Series C investment, pushing its valuation to $1.15 billion and into unicorn territory.\n\nThe round, which was announced Tuesday and led by Autopilot Ventures, provided a multimillion-dollar accelerant for the startup as it nears the end of a lengthy Federal Aviation Administration certification process for its flight control system. The capital will also be used to integrate its operating system, known as SkyOS, across numerous aircraft, including U.S. military Black Hawk helicopters.\n\nOther investors in this round include Fidelity Management & Research Company, ArrowMark Partners, Atreides Management LP, BAM Elevate, Baron Capital Group, Durable Capital Partners, Positive Sum, Qatar Investment Authority, RCM Private Markets Fund managed by Rokos Capital Management, and Woodline Partners. The startup, which was founded in 2016, has raised more than $605 million in equity capital.\n\nSkyryse has made inroads with investors as well as the U.S. military, emergency medical service operators, law enforcement, and private operators for its simplified flight system. The startup has stripped out dozens of mechanical flight controls like gauges and switches and replaced them with a system containing several flight computers that automate the more complicated and dangerous aspects of flying.\n\nThis is not a fully autonomous system; a pilot must still handle the operations. But it’s designed to automate the trickiest aspects of flying, enhance the skills of pilots, and improve safety.\n\nThat simplicity and ease of operation — a literalswipe of the finger on a touchscreen— has won over companies like United Rotorcraft, Air Methods, and Mitsubishi Corporation, which have contracts with Skyryse to integrate SkyOS on a variety of helicopters and airplanes.\n\nSkyryse started building and testing its system on helicopters, one of the most unstable aircraft to operate. But the idea",
      "excerpt": "Skyryse, an El Segundo, California-based aviation automation startup, has raised more than $300 million in a Series C investment, pushing its valuation to $1.15 billion and into unicorn territory.\n\nThe round, which was announced Tuesday and led by Autopilot Ventures, provided a multimillion-dollar a",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Fitbit founders launch AI platform to help families monitor their health",
      "link": "https://techcrunch.com/2026/02/03/fitbit-founders-launch-ai-platform-to-help-families-monitor-their-health/",
      "author": "Aisha Malik",
      "date": "2026-02-03T07:53:36-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Luffu_Family_Morning_Land.jpg?resize=1200,675",
      "category": "Apps",
      "content": "Fitbit founders James Park and Eric Friedman haveannouncedthe launch of a new AI startup called Luffu that aims to help families proactively monitor their health. The duo are developing an “intelligent family care system” that will start with an app experience and then expand into hardware devices.\n\nTwo years after their exit from Google, Park and Friedman are betting on AI to help lighten the mental burden of caregiving. According to arecent report, 63 million, or nearly 1 in 4, U.S. adults are family caregivers, up 45% from 10 years ago.\n\nLuffu uses AI in the background to gather and organize family information, learn day-to-day patterns, and flag notable changes so families can stay aligned and address potential well-being issues.\n\n“At Fitbit, we focused on personal health—but after Fitbit, health for me became bigger than just thinking about myself,” Park said in apress release. “I was caring for my parents from across the country, trying to piece together my mom’s health care across various portals and providers, with a language barrier that made it hard to get complete, timely context from her about doctor visits. I didn’t want to constantly check in, and she didn’t want to feel monitored. Luffu is the product we wished existed—to stay on top of our family’s health, know what changed and when to step in—without hovering.”\n\nThe pair note that today’s consumer health market is filled with tools for individuals, but that real life health is shared across partners, kids, parents, pets, and caregivers. Family information is scattered across devices, portals, calendars, attachments, spreadsheets, and paper documents.\n\nWith Luffu, people will be able to track the whole family’s details, including health stats, diet, medications, symptoms, lab tests, doctor visits, and more. Users can log health information using voice, text, or photos. Luffu proactively watches for changes, and surfaces insights and alerts, such as unusual vitals or changes in sleep.\n\nThe pairtold Ax",
      "excerpt": "Fitbit founders James Park and Eric Friedman haveannouncedthe launch of a new AI startup called Luffu that aims to help families proactively monitor their health. The duo are developing an “intelligent family care system” that will start with an app experience and then expand into hardware devices.\n",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Vema predicts cheap hydrogen could change where data centers are built",
      "link": "https://techcrunch.com/2026/02/03/vema-predicts-cheap-hydrogen-could-change-where-data-centers-are-built/",
      "author": "Tim De Chant",
      "date": "2026-02-03T04:15:49-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2166404383.jpeg?resize=1200,800",
      "category": "Climate",
      "content": "The automotive industry has struggled to adopt hydrogen at scale, but industrial users and data centers might have better luck.\n\nVema Hydrogeninked a deal in December to supply California data centers, and now it has completed a pilot project in Quebec to power industry with hydrogen that it produces deep underground.\n\nThe startup drills wells in regions with specific types of iron-rich rock that release hydrogen gas when treated with water, heat, pressure, and some catalysts. Vema then draws the hydrogen to the surface and sells it to industrial users.\n\n“To supply the Quebec local market, which is about 100,000 tons per year, you would need 3 square kilometers, which is nothing,” Pierre Levin, CEO of Vema, told TechCrunch.\n\nVema’s first pilot well will produce several tons of hydrogen per day, and next year, it plans to drill its first commercial well, which will reach 800 meters into the earth. Vema expects to produce hydrogen from the first wells for less than $1 per kilogram, a widely used benchmark for clean hydrogen.\n\nMost hydrogen today is made by a process known as steam reforming of methane (SMR), in which steam is used to break hydrogen molecules off methane from natural gas. It’s energy intensive, and both the process to make steam and the chemical reaction itself release carbon dioxide.\n\nLess polluting sources of hydrogen exist, but they tend to cost more. Hydrogen from SMR costs between 70 cents and $1.60 per kilogram,accordingto the IEA. Capturing carbon from SMR can add around 50% to those prices, while the cleanest process, which uses zero carbon electricity to power an electrolyzer, drives costs up several fold.\n\nStimulated geologic hydrogen, or “engineered mineral hydrogen,” as Vema calls it, promises to be one of the cleanest sources of hydrogen,accordingto the Oxford Institute for Energy Studies.\n\nOnce Vema has refined its techniques, Levin expects it to produce hydrogen for less than 50 cents per kilogram. At that price, Vema’s hydrogen would be",
      "excerpt": "The automotive industry has struggled to adopt hydrogen at scale, but industrial users and data centers might have better luck.\n\nVema Hydrogeninked a deal in December to supply California data centers, and now it has completed a pilot project in Quebec to power industry with hydrogen that it produce",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Epstein-linked longevity guru Peter Attia leaves David Protein, and his own startup ‘won’t comment’",
      "link": "https://techcrunch.com/2026/02/03/epstein-linked-longevity-guru-peter-attia-leaves-david-protein-and-his-own-startup-wont-comment/",
      "author": "Julie Bort",
      "date": "2026-02-03T16:11:48-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2019/10/unsplash_exit_sign-e1770157478202.jpeg?w=1102",
      "category": "Startups",
      "content": "The founder of David Protein, maker of popular high-protein nutrition bars,announcedon X on Monday that longevity guru Dr. Peter Attia “has stepped down from his role as Chief Science Officer at David.”\n\nThe announcement comes after Attia’s name appeared in more than 1,700 documents, including email correspondence, released on Friday as part of a massive file dump related to convicted sex offender Jeffrey Epstein,according to The New York Times. Attia served on the executive team of the food startup and was also anearly investor.\n\nFor those unfamiliar, Attia is a Canadian American physician who has become one of the most prominent voices in longevity and preventive health. He’s best known for his bestselling book “Outlive: The Science and Art of Longevity” and his now seven-year-old podcast, wherein he explores optimization strategies. He was also hired just last month as a contributor to CBS.\n\nThree-year-old, New York-based David Protein raised a $75 million Series A funding round in May of last year led by Greenoaks, with participation from Valor Equity Partners. The company has experienced significant growth since launching its flagship protein bar in September 2024, a product it describes as having 28 grams of protein, zero sugar, and 150 calories.\n\nIn a lengthypost on X, Attia wrote that he was “ashamed” of some of the crude content in his emails with Epstein, but he also said he was not involved in criminal activity and never visited Epstein’s island or traveled on his plane. Attia also discussed at length how he came to know Epstein and why he stayed involved with him even after Epstein’s2008 conviction.\n\nThe fallout appears to extend beyond David Protein. It also appears that Biograph, the healthcare testing and longevity startup that Attia co-founded with entrepreneur John Hering, may be distancing itself from the physician. The company declined to comment on Attia’s ongoing participation with the startup or about the pages on its website that used to menti",
      "excerpt": "The founder of David Protein, maker of popular high-protein nutrition bars,announcedon X on Monday that longevity guru Dr. Peter Attia “has stepped down from his role as Chief Science Officer at David.”\n\nThe announcement comes after Attia’s name appeared in more than 1,700 documents, including email",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "India’s Varaha bags $20M to scale carbon removal from the Global South",
      "link": "https://techcrunch.com/2026/02/03/indias-varaha-bags-20m-to-scale-carbon-removal-from-the-global-south/",
      "author": "Jagmeet Singh",
      "date": "2026-02-03T15:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/varaha-farm-work.jpg?resize=1200,800",
      "category": "Climate",
      "content": "Varaha, an India-based climate tech startup, has raised $20 million in fresh funding as it looks to scale carbon removal projects from the Global South and position itself as a lower-cost supplier for verified emissions reductions.\n\nThe investment marks the first portion of a planned $45 million Series B round led by WestBridge Capital, the venture firm’s first investment in climate tech, with participation from existing investors including RTP Global and Omnivore. Founded in 2022, Varaha has raised about $33 million in equity to date, alongside $35 million inproject financingand $500,000 in grants, as it builds carbon removal projects across Asia and Africa.\n\nIndia has emerged as an increasingly important base for carbon removal projects, offering lower operating costs, deep agricultural supply chains, and a large pool of technical talent as corporate demand for verified removals rises, including from companies facing growing energy use from data centers and AI workloads. Varaha is positioning itself to capitalize on those advantages, arguing that its execution-focused model allows it to deliver carbon removal at lower cost while meeting the same international verification standards as higher-priced competitors in Europe and North America.\n\nVaraha’s advantage lies less in proprietary technology and more in execution, said co-founder and chief executive Madhur Jain in an interview, arguing that high operating costs could become a constraint for carbon removal developers in wealthier markets as prices come under pressure.\n\n“If carbon credit is a cost to the businesses that are buying these carbon credits … it’s a cost on their balance sheet. It’s not a CSR item,” Jain told TechCrunch. “And hence, if the cost of a certain geography is going to be so high by an order of magnitude of like, 1.5x to 3x credit production, it is going to be extremely hard for those companies to survive.”\n\nVaraha develops carbon removal projects across four main pathways: regenerative agricu",
      "excerpt": "Varaha, an India-based climate tech startup, has raised $20 million in fresh funding as it looks to scale carbon removal projects from the Global South and position itself as a lower-cost supplier for verified emissions reductions.\n\nThe investment marks the first portion of a planned $45 million Ser",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}