{
  "last_updated": "2026-02-22T06:53:24.685991+00:00",
  "articles": [
    {
      "title": "Google VP warns that two types of AI startups may not survive",
      "link": "https://techcrunch.com/2026/02/21/google-vp-warns-that-two-types-of-ai-startups-may-not-survive/",
      "author": "Rebecca Bellan",
      "date": "2026-02-21T08:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Darren-Mowry-headshot.png?resize=1200,960",
      "category": "AI",
      "content": "Loading the player…\n\nThe generative AI boom minted a startup a minute. But as the dust starts to settle, two once-hot business models are looking more like cautionary tales: LLM wrappers and AI aggregators.\n\nDarren Mowry, who leads Google’s global startup organization across Cloud, DeepMind, and Alphabet, says startups with these hooks have their “check engine light” on.\n\nLLM wrappers are essentially startups that wrap existing large language models, like Claude, GPT, or Gemini, with a product or UX layer to solve a specific problem. An example would be a startup thatuses AI to help students study.\n\n“If you’re really just counting on the back-end model to do all the work and you’re almost white-labeling that model, the industry doesn’t have a lot of patience for that anymore,” Mowry said on thisweek’s episode of Equity.\n\nWrapping “very thin intellectual property around Gemini or GPT-5” signals you’re not differentiating yourself, Mowry says.\n\n“You’ve got to have deep, wide moats that are either horizontally differentiated or something really specific to a vertical market” for a startup to “progress and grow,” he said. Examples of the deep-moat LLM wrapper type include Cursor, a GPT-powered coding assistant, or Harvey AI, a legal AI assistant.\n\nIn other words, startups can no longer expect to slap a UI on top of a GPT and get traction on their product like they could, perhaps, in mid-2024 when OpenAIlaunched its ChatGPT store. The challenge now is to build sustainable product value.\n\nAI aggregators are a subset of wrappers — they’re startups that aggregate multiple LLMs into one interface or API layer to route queries across models and give users access to multiple models. These companies typically provide an orchestration layer that includes monitoring, governance, or eval tooling. Think: AI search startup Perplexity or developer platform OpenRouter, which provides access to multiple AI models via a single API.\n\nWhile many of these platforms have gained ground, Mowry’s message is clear to incoming startups: “Stay out of the aggregator business.”\n\nGenerally speaking, aggregators aren’t seeing much growth or progression these days because, he says, users want “some intellectual property built in” to ensure they’re routed to the right model at the right time based on their needs — not because of behind-the-scenes compute or access constraints.\n\nMowry has been in the cloud game for decades, cutting his teeth at AWS and Microsoft before setting up shop at Google Cloud, and he’s seen how this plays out. He said the situation today mirrors the early days of cloud computing in the late 2000s/early 2010s as Amazon’s cloud business started taking off.\n\nAt that time, a crop of startups sprang up to resell AWS infrastructure, marketing themselves as easier entry points that provided tooling, billing consolidation, and support. But when Amazon built its own enterprise tools and customers learned to manage cloud services directly, most of those startups were squeezed out. The only survivors were the ones that added real services, like security, migration, or DevOps consulting.\n\nAI aggregators today face similar margin pressure as model providers expand into enterprise features themselves, potentially sidelining middlemen.\n\nFor his part, Mowry is bullish on vibe coding and developer platforms, which had a record-breaking year in 2025 with startups like Replit, Lovable, and Cursor (all Google Cloud customers, per Mowry) attracting major investment and customer traction.\n\nMowry also expects strong growth in direct-to-consumer tech, in companies that put some of these powerful AI tools into the hands of customers. He pointed to the opportunity for film and TV students to use Google’s AI video generator Veo to bring stories to life.\n\nBeyond AI, Mowry also thinks biotech and climate tech are having a moment — both in terms of venture investment going into the two industries and the “incredible amounts of data” startups can access to create real value “in ways we would never have been able to before.”",
      "excerpt": "Loading the player…\n\nThe generative AI boom minted a startup a minute. But as the dust starts to settle, two once-hot business models are looking more like cautionary tales: LLM wrappers and AI aggregators.\n\nDarren Mowry, who leads Google’s global startup organization across Cloud, DeepMind, and Alp",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Wikipedia blacklists Archive.today after alleged DDoS attack",
      "link": "https://techcrunch.com/2026/02/21/wikipedia-blacklists-archive-today-after-alleged-ddos-attack/",
      "author": "Anthony Ha",
      "date": "2026-02-21T12:20:15-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-1873370000.jpg?resize=1200,800",
      "category": "Media & Entertainment",
      "content": "Wikipedia editors have decided to remove all links to Archive.today, a web archiving service that they said has been linked to more than 695,000 times across the online encyclopedia.\n\nArchive.today — which also operates under several other domain names, includingarchive.isandarchive.ph— is perhaps most widely used to access content that’s otherwise inaccessible behind paywalls. That also makes it useful as a source for Wikipedia citations.\n\nHowever, according tothe Wikipedia discussion page about this topic, “There is consensus to immediately deprecate archive.today, and, as soon as practicable, add it to the spam blacklist […] and to forthwith remove all links to it.” (Ars Technicafirst reported on the decision.)\n\nThe discussion page says that Archive.today was previously blacklisted in 2013, only to be removed from the blacklist in 2016.\n\nWhy reverse course again? Because, the discussion page says, “Wikipedia should not direct its readers towards a website that hijacks users’ computers to run a DDoS attack.” Plus, “evidence has been presented that archive.today’s operators have altered the content of archived pages, rendering it unreliable.”\n\nThe distributed denial of service (DDoS) attack in question was allegedly directed at blogger Jani Patokallio. Patokallio wrote that beginning on January 11, users who loaded the archive’s CAPTCHA page have beenunknowingly loading and executing JavaScriptthat sends a search request to his Gyrovague blog, in an apparent attempt to get Patokallio’s attention and increase his hosting bill.\n\nBack in 2023, Patokallio publisheda blog postexamining Archive.today, whose ownership he described as “an opaque mystery.” And while he wasn’t able to track down a specific owner, he concluded the site was likely “a one-person labor of love, operated by a Russian of considerable talent and access to Europe.”\n\nMore recently, Patokallio said the webmaster at Archive.today asked him to take the post down for two or three months.\n\n“I do not mind the post, but the issue is: journos from mainstream media (Heise, Verge, etc) cherry-pick just a couple of words from your blog, and then construct very different narratives having your post the only citable source; then they cite each other and produce a shitty result to present for a wide audience,” the webmaster said, according toemails shared by Patokallio.\n\nPatokallio said that after he declined to take the post down, the webmaster responded with “an increasingly unhinged series of threats.”\n\nWikipedia editors alsopointed to webpage snapshotsin Archive.today that appeared to have been altered to insert Patokallio’s name — hence the concern that it’s become “unreliable” as an archive.\n\nWikipedia’sguidancenow calls for editors to remove links to Archive.today and related sites, replacing them with links to the original source or to other archives like the Wayback Machine.\n\nOna bloglinked from the Archive.today website, the site’s apparent ownerwrotethat Archive.today’s value to Wikipedia was “not about paywalls” but rather “the ability to offload copyright issues.” They laterwrotethat things had turned out “pretty well” and said they would “scale down the ‘DDoS’.”\n\n“Why didn’t you write about such events earlier, folks of the tabloids?” they said. “I don’t expect you to write anything good, because then who would read you, but there was plenty of dramas, wasn’t there? Because there was no Jani to nudge you?”",
      "excerpt": "Wikipedia editors have decided to remove all links to Archive.today, a web archiving service that they said has been linked to more than 695,000 times across the online encyclopedia.\n\nArchive.today — which also operates under several other domain names, includingarchive.isandarchive.ph— is perhaps m",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Sam Altman would like remind you that humans use a lot of energy, too",
      "link": "https://techcrunch.com/2026/02/21/sam-altman-would-like-remind-you-that-humans-use-a-lot-of-energy-too/",
      "author": "Anthony Ha",
      "date": "2026-02-21T13:38:01-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-2198353376.jpg?resize=1200,800",
      "category": "AI",
      "content": "OpenAI CEO Sam Altman addressed concerns about AI’s environmental impact this week whilespeaking at an event hosted by The Indian Express.\n\nFor one thing, Altman — who wasin India for a major AI summit— said concerns about AI’s water usage are “totally fake,” though he acknowledged it was a real issue when “we used to do evaporative cooling in data centers.”\n\n“Now that we don’t do that, you see these things on the internet where, ‘Don’t use ChatGPT, it’s 17 gallons of water for each query’ or whatever,” Altman said. “This is completely untrue, totally insane, no connection to reality.”\n\nHe added that it’s “fair” to be concerned about “the energy consumption — not per query, but in total, because the world is now using so much AI.” In his view, this means the world needs to “move towards nuclear or wind and solar very quickly.”\n\nThere’s no legal requirement for tech companies to disclose how much energy and water they use, so scientists have beentrying to study it independently. Data centers have also been connected torising electricity prices.\n\nCiting a previous conversation with Bill Gates, the interviewer asked whether it’s accurate to say a single ChatGPT query currently uses the equivalent of 1.5 iPhone battery charges, to which Altman replied, “There’s no way it’s anything close to that much.”\n\nAltman also complained that many discussions about ChatGPT’s energy usage are “unfair,” especially when they focus on “how much energy it takes to train an AI model, relative to how much it costs a human to do one inference query.”\n\n“But it also takes a lot of energy to train a human,” Altman said. “It takes like 20 years of life and all of the food you eat during that time before you get smart. And not only that, it took the very widespread evolution of the 100 billion people that have ever lived and learned not to get eaten by predators and learned how to figure out science and whatever, to produce you.”\n\nSo in his view, the fair comparison is, “If you ask ChatGPT a question, how much energy does it take once its model is trained to answer that question versus a human? And probably, AI has already caught up on an energy efficiency basis, measured that way.”\n\nYou can watch the full interview below. The conversation about water and energy usage begins at around 26:35.",
      "excerpt": "OpenAI CEO Sam Altman addressed concerns about AI’s environmental impact this week whilespeaking at an event hosted by The Indian Express.\n\nFor one thing, Altman — who wasin India for a major AI summit— said concerns about AI’s water usage are “totally fake,” though he acknowledged it was a real iss",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Remember HQ? ‘Quiz Daddy’ Scott Rogowsky is back with TextSavvy, a daily mobile game show",
      "link": "https://techcrunch.com/2026/02/20/remember-hq-quiz-daddy-scott-rogowsky-is-back-with-textsavvy-a-daily-mobile-game-show/",
      "author": "Amanda Silberling",
      "date": "2026-02-20T13:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/text-savvy-scott-rogowsky.jpg?resize=1200,665",
      "category": "Apps",
      "content": "Scott Rogowsky is a comedian — he knows how to make fun of himself. That’s how he ended uproamingNew York City Comic Con with his own photo printed out like a “Wanted” poster, filming himself asking strangers, “Have you seen this man?”\n\nThese passersby showed a flicker of recognition, looking at the tall, bearded man like someone they had known in a past life, but couldn’t quite place.\n\n“You look familiar! Where do I know you from?” someone asks, as though Rogowsky could be a friend of a friend they had met at a party.\n\n“I know your face,” another person says, staring thoughtfully at the 41-year-old.\n\nA cosplayer dressed as a Ghostbuster finally figures it out.\n\n“Did you used to do that game show online?” he asks. “Like, every night?”\n\nRogowsky was just poking fun at himself, embracing the persona of a washed-up internet sensation. “I know my place,” he tells TechCrunch. “I’m not walking around like everybody’s supposed to know who I am.”\n\nBut seven years ago, everyone did.\n\nRogowsky was once the face of HQ Trivia, an app that exploded into popular culture, then faded out of the public consciousness almost as fast. Between 2017 and 2019, Rogowsky hosted the live mobile game show twice a day. At its peak, it drew more than 2.4 million daily viewers each night. It garnered 20 million lifetime downloads.\n\nNow the comedian is back with an app of his own called Savvy, which shares a lot of the DNA of HQ. Savvy’s first game,TextSavvy,is a daily live game show where players can earn cash — only this time, viewers are competing against Rogowsky in a word puzzle game that’s something like a hybrid of The New York Times’ Wordle and Connections, rather than trivia.\n\n“I believe this is my calling in a weird way,” Rogowsky says. “I get up there in front of that camera, there’s thousands of people watching at home — millions, back in the HQ days — and it just flows.”\n\nHQ Trivia was founded by the creators of Vine — the short-video platform that predated TikTok — and became a genuine cultural sensation.National newschannelsran storiesabout office workers dropping everything in the middle of the day to play HQ at 3 p.m. It wasgroundbreaking— appointment entertainment in a new format for the streaming era — until the company imploded in a barrage of unfortunate circumstances.\n\nOne founder, Colin Kroll, died of a drug overdose; the other founder, Rus Yusupov, was a divisive leader who clashed with his staff. He oncethreatened a journalistthat he would fire Rogowsky if she published an interview with Rogowsky where he mentioned liking Sweetgreen salads (Yusupov apparently didn’t want to give the fast-food chain free publicity). Most of all, HQ Trivia fell victim to the same trap that dooms so many startups. The company had raised a$15 million funding roundat a $100 million valuation, but it was — quite literally — giving away money, and it never developed a meaningful plan to monetize or build a sustainable business model. The company ultimately filed for bankruptcy in February 2020, with its demise later becoming fodder fordramatic documentariesandtrue-crime-adjacent podcastsdissecting how such a promising app failed so spectacularly.\n\nThis was, understandably, a real blow for Rogowsky. But more bad luck followed. A baseball superfan, Rogowsky had left HQ Trivia in 2019 for a job hostinga daily MLB Network show. He felt like he finally made it — he still lights up recalling running into Hall of Fame pitcher Pedro Martinez in the bathroom. But his show was canceled when the pandemic shut down baseball. He tried a handful of times over the years to recreate a company like HQ, but it was a journey of false starts.\n\n“Crazy s–t happened that I had no control over, and I felt like I was being tossed and turned on this raft in the ocean, just getting battered by things I can’t control, and that was sort of my attitude about life in general,” he says.\n\nHe considered himself retired from show business and opened a vintage store in California. But he missed comedy.\n\n“I went through this very meaningful personal transformation in the last couple of years,” he said. That process culminated in a seven-day mountain retreat called “the Hoffman Process,” a program that he describes as a digital detox combining lessons in psychology and neuroscience that helped him “take control of [his] life again.”\n\n“It gave me a lot of clarity to say, you know what, I have more to do here,” Rogowsky says. “I got out of that retreat and I was like, ‘I have something to say. People find me funny and entertaining. I find myself funny and entertaining.’”\n\nPeople tuned into HQ Trivia for the prospect of winning a cash prize, but the odds of winning were slim. Millions of viewers came back each night because of Rogowsky’s quick wit and charm, which earned him a cult following of fans who still call him “Quiz Daddy.”\n\n“From the psychological, emotional side, I couldn’t really process what was going on,” Rogowsky says, reflecting on his viral fame. “And in the seven humbling years since, I have a vastly new perspective… I have my fanbase, I have my core followers right here. They’re on board with me, and it’s a matter of getting the word out.”\n\nRogowsky received a lot of messages over the years from people who wanted to help him build the next HQ. But last year, a direct message on X from European game designer Johan de Jager grabbed his attention.\n\n“The idea was the host plays against the audience, so it’s like a two-way interaction,” Rogowsky says. “Imagine HQ if I wasn’t just asking the questions but also answering [them]… That adds another layer to it that no one had thought of before.”\n\nBut in the age of AI, where players can easily look up answers, Rogowsky was skeptical that a trivia game could work fairly, so Savvy embraced word puzzles instead.\n\nThe most that Savvy has paid out in a single game is around $400 — small compared to HQ’s occasional six-figure prize pools. That’s because Rogowsky and his co-founders are funding the company themselves.\n\n“Look, I know this isn’t the thousands of dollars that you saw on HQ, the hundreds of thousands that we eventually got to,” Rogowsky said on one recentTextSavvy broadcast. “But the difference is HQ was funded by venture capital. They had $8 million in the bank to start. They got another $15 million from other venture capitalists. We don’t got that… This is a low-budge operashe because I’m paying for it!”\n\nRogowsky says he has spoken with investors about Savvy and even gotten some enticing offers. But venture backing often comes with pressure on founders to maximize returns as fast as they can, a model that can set a business up to fail, as HQ demonstrated.\n\n“People want to 10x and 100x [their investment]… I’d be very happy to get to a point of profitability, to where we can just keep growing the company, keep hiring more people, keep making more games,” Rogowsky says. “I’m not looking for some type of eight-figure, nine-figure exit. This is what I want to do. I’m going to do this as long as I continue to wake up every morning and say, ‘Goddamn, I’m excited to get up there in front of that camera and have fun.’”\n\nTextSavvy is currently running a “Season 0,” a soft launch that allows the team to work through technical kinks before formally launching on March 1. So far, without much promotion, TextSavvy has peaked at about 4,000 viewers in one night.\n\nThat’s not much compared to the HQ days. Then again, when TechCrunch firstwrote about HQ, the app only had about 3,300 concurrent viewers. Who’s to say Savvy can’t do it again?\n\n“We’re not going anywhere this time,” Rogowsky said. “There’s no one to fire me. There’s no drama, there’s no tension. There’s not going to be a documentary about Savvy the way there was about HQ.”",
      "excerpt": "Scott Rogowsky is a comedian — he knows how to make fun of himself. That’s how he ended uproamingNew York City Comic Con with his own photo printed out like a “Wanted” poster, filming himself asking strangers, “Have you seen this man?”\n\nThese passersby showed a flicker of recognition, looking at the",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Great news for xAI: Grok is now pretty good at answering questions about Baldur’s Gate",
      "link": "https://techcrunch.com/2026/02/20/great-news-for-xai-grok-is-now-pretty-good-at-answering-questions-about-baldurs-gate/",
      "author": "Russell Brandom",
      "date": "2026-02-20T10:26:54-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-2087343879.jpg?w=1024",
      "category": "AI",
      "content": "Different AI labs have different priorities. OpenAI has traditionally focused on consumer users, for instance, while its rival Anthropic tends to target enterprises. Elon Musk’s xAI, we discovered recently, has been placing particular emphasis on video-game walkthroughs.\n\nOn Friday, Business Insider’s Grace Kay publisheda detailed and far-reaching report about xAI, the AI startup recentlyacquired by SpaceX, with particular emphasis on how Musk is making life difficult for employees. But this particular anecdote stood out:\n\nIn one instance last year, a model release was delayed for several days because Musk was dissatisfied with how the chatbot answered detailed questions about the video game “Baldur’s Gate,” according to people familiar with the matter. High-level engineers were pulled from other projects to improve the responses before launch, they said.\n\nOf course, you can imagine the frustration of any respected and experienced engineer who shows up to work thinking he’ll be tackling fundamental problems of knowledge and machine intelligence, only to be sidetracked into helping a 54-year-old man beat his video game. But the anecdote raises an even more pressing question: Did Musk end up getting the gaming skills he wanted?\n\nTo answer that question, our resident RPG enthusiast Ram Iyer put together a set of five general questions about Baldur’s Gate, which we ran against xAI and the three major models in a kind of quasi-benchmark that I’ve decided to call “BaldurBench.”\n\nIn the interest of journalistic transparency, I’ve made all the chat transcripts public, so you can see them here:Grok,ChatGPT,Claude, andGemini.\n\nFirst, the good news: Grok actually gives pretty good information. Its responses were a bit dense with gamer jargon — “save-scumming” instead of saving and “DPS” instead of damage — but the answers were both useful and well-informed, provided you knew what it was talking about. Grok also really loves tables andtheorycraft, which is about what you would expect.\n\nThere are lots of Baldur’s Gate guides out there and the models were generally drawing from the same ones, so the biggest differences were stylistic. ChatGPT prefers bulleted lists and sentence fragments, while Gemini loves to bold important words.\n\nThe biggest surprise was Claude, which was particularly concerned about giving me information that would spoil my experience of the game. When I asked about good party compositions, it closed the guidance by saying, “Don’t stress too much and just play what sounds fun to you.” Thanks, Claude!\n\nIt’s important to bear in mind, this is a subject area we know (thanks toBusiness Insider’s reporting) that xAI has specifically focused on reaching parity. So we shouldn’t read too much into the fact that, after the reported sprint, Grok’s advice turned out about the same as the other models. Still, it’s nice to know xAI can make it work if it tries.\n\nLoading the player…",
      "excerpt": "Different AI labs have different priorities. OpenAI has traditionally focused on consumer users, for instance, while its rival Anthropic tends to target enterprises. Elon Musk’s xAI, we discovered recently, has been placing particular emphasis on video-game walkthroughs.\n\nOn Friday, Business Insider",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "OpenAI debated calling police about suspected Canadian shooter’s chats",
      "link": "https://techcrunch.com/2026/02/21/openai-debated-calling-police-about-suspected-canadian-shooters-chats/",
      "author": "Tim Fernholz",
      "date": "2026-02-21T07:25:44-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=1024",
      "category": "",
      "content": "An 18-year-old who allegedly killed eight people in a mass shooting in Tumbler Ridge, Canada, reportedly used OpenAI’s ChatGPT in ways that alarmed the company’s staff.\n\nJesse Van Rootselaar’s chats describing gun violence were flagged by tools that monitor the company’s LLM for misuse and banned in June 2025.\n\nStaff at the company debated whether or not to reach out to Canadian law enforcement over the behavior but ultimately did not, accordingto the Wall Street Journal. An OpenAI spokesperson said Van Rootselaar’s activity did not meet the criteria for reporting to law enforcement; the company reached out to Canadian authorities after the incident.\n\n“Our thoughts are with everyone affected by the Tumbler Ridge tragedy,” an OpenAI spokesperson said in a statement. “We proactively reached out to the Royal Canadian Mounted Police with information on the individual and their use of ChatGPT, and we’ll continue to support their investigation.”\n\nChatGPT transcripts weren’t the only concerning part of Van Rootselaar’s digital footprint. She apparently created a game on Roblox, the world simulation platform frequented by children, which simulated a mass shooting at a mall. She also posted about guns on Reddit.\n\nVan Rootselaar’s instability was also known to local police, who had been called to her family’s home after she started a fire while under the influence of unspecified drugs.\n\nLLM chatbots built by OpenAI and its competitors have been accused of triggering mental breakdowns in users who lose grip on reality while conversing with digital models.Multiplelawsuitshavebeen filed that cite chat transcripts that encourage people to commit suicide or offer assistance in doing so.\n\nIf you are in a crisis or having thoughts of suicide, call or text 988 to reach the 988 Suicide and Crisis Lifeline.\n\nThis post has been updated with comment from OpenAI.",
      "excerpt": "An 18-year-old who allegedly killed eight people in a mass shooting in Tumbler Ridge, Canada, reportedly used OpenAI’s ChatGPT in ways that alarmed the company’s staff.\n\nJesse Van Rootselaar’s chats describing gun violence were flagged by tools that monitor the company’s LLM for misuse and banned in",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Ukrainian man jailed for identity theft that helped North Koreans get jobs at US companies",
      "link": "https://techcrunch.com/2026/02/20/ukrainian-man-jailed-for-identity-theft-that-helped-north-koreans-get-jobs-at-us-companies/",
      "author": "Zack Whittaker",
      "date": "2026-02-20T09:38:59-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/laptop-farm-upscale.jpeg?resize=1200,802",
      "category": "Security",
      "content": "A U.S. federal court has sentenced a Ukrainian man to five years in prison for his part in a long-running identity theft operation that helped overseas North Korean workers gain fraudulent employment at dozens of U.S. companies.\n\nU.S. prosecutorsbrought charges in 2024against Oleksandr Didenko, 29, a resident of Kyiv, for setting up North Koreans with stolen identities of U.S. citizens to get hired and earn a wage. Under this scheme, the workers’ earnings were funneled back to Pyongyang, which the regime used to fund its internationally sanctioned nuclear weapons program.\n\nThis is thelatest in a string of recent convictionsof individuals involved in facilitating ongoing North Koreanso-called “IT worker” schemes. Security researchers have described North Korean workers as a “triple threat” to U.S. and Western businesses, as they violate U.S. sanctions, all the while enabling North Koreans to steal sensitive company data, and then later extort those victim companies into not publicly releasing corporate secrets.\n\nProsecutors said Didenko ran a website called Upworksell, which allowed people working overseas, including North Koreans, to buy or rent stolen identities for gaining employment with U.S. firms. Didenko handled more than 870 stolen identities, per the Justice Department.\n\nThe FBI seized Upworksell in 2024 and diverted its traffic to its own servers. Polish authorities arrested Didenko, who was then extradited to the U.S. and later pleaded guilty.\n\nIna statement this week, the U.S. Department of Justice said Didenko also paid people to receive and host computers at their homes in California, Tennessee, and Virginia. These “laptop farms” are rooms containing racks of open laptops, allowing North Koreans to remotely perform their work as if they were physically in the United States.\n\nSecurity giant CrowdStrike saidlast yearthat it has seen a sharp rise in the number of North Korean workers infiltrating companies, often as remote developers or other technical software engineering jobs. The scheme is among many that the North Korean regime uses to enrich itself, while unable to use the global financial system, thanks to international sanctions.\n\nNorth Koreans are also known toimpersonate recruiters and VCsin efforts to trick unsuspecting high-profile and high-net-worth victims into granting access to their computers, including crypto.",
      "excerpt": "A U.S. federal court has sentenced a Ukrainian man to five years in prison for his part in a long-running identity theft operation that helped overseas North Korean workers gain fraudulent employment at dozens of U.S. companies.\n\nU.S. prosecutorsbrought charges in 2024against Oleksandr Didenko, 29, ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Lucid Motors slashes 12% of its workforce as it seeks profitability",
      "link": "https://techcrunch.com/2026/02/20/lucid-motors-slashes-12-of-its-workforce-as-it-seeks-profitability/",
      "author": "Sean O'Kane",
      "date": "2026-02-20T07:51:18-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/04/LM250408_GPD-2.jpg?resize=1200,675",
      "category": "Transportation",
      "content": "Lucid Motors is laying off 12% of its workforce in a bid to “improve operational effectiveness and optimize our resources as we continue on our path toward profitability,” according to an internal memo that was obtained by TechCrunch.\n\nHourly workers on the manufacturing, logistics, and quality teams are not affected by the cuts, according to the memo, which was sent to employees being spared by the layoffs. It’s unclear exactly how many workers are being laid off, but it is likely in the hundreds. Lucid Motors reported having 6,800 full-time employees globallyat the end of 2024.\n\n“Saying goodbye to colleagues is never easy,” interim CEO Marc Winterhoff wrote in the memo. “We are grateful for the contributions of those impacted by today’s actions, and we are providing severance, bonus, continued health benefits, and transition support to help them through this period.” The company did not immediately respond to a request for comment.\n\nThe cuts come as the company is in the middle of ramping up production and deliveries of its Gravity SUV. While Lucid Motors struggled with Gravity production and quality issues during the first few months, the company has been able to pick up the pace, and ultimatelydoubled its 2024 outputlast year.\n\nThe company is also preparing to launch a more affordable mid-size EV later this year that is expected to cost around $50,000. It’s collaborating with Uber and autonomous vehicle company Nuro on launching a robotaxi service in the San Francisco area this year, too. The company is scheduled to release its financial results for 2025 next week.\n\n“Importantly, today’s actions do not affect our strategy,” Winterhoff wrote in the memo. “Our core priorities remain unchanged, and we continue to focus on the start of production of our Midsize platform. With disciplined execution, we are also focused on further expansion into the robotaxi market, continued ADAS and software development, and growth in sales of Lucid Gravity and Air across existing and new geographies.”\n\nLucid Motors has now gone almost a full year without a permanent CEO. Peter Rawlinson, who was the company’s chief executive and chief technical officer,abruptly resignedon February 25, 2025. Since then, Lucid Motors has seen asignificant amount of turnover in its executive ranks, including the loss of its chief engineer, whosued the companyin December for wrongful termination and discrimination. (Lucid Motors has called his legal claims “absurd.”)",
      "excerpt": "Lucid Motors is laying off 12% of its workforce in a bid to “improve operational effectiveness and optimize our resources as we continue on our path toward profitability,” according to an internal memo that was obtained by TechCrunch.\n\nHourly workers on the manufacturing, logistics, and quality team",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Microsoft’s new gaming CEO vows not to flood the ecosystem with ‘endless AI slop’",
      "link": "https://techcrunch.com/2026/02/21/microsofts-new-gaming-ceo-vows-not-to-flood-the-ecosystem-with-endless-ai-slop/",
      "author": "Anthony Ha",
      "date": "2026-02-21T09:41:27-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/10/GettyImages-2174641784.jpg?resize=1200,800",
      "category": "",
      "content": "Microsoft announced a major gaming shakeup on Friday, with Microsoft Gaming CEO Phil Spencer departing the company, along with Xbox President Sarah Bond.\n\nSpencer will be replaced by former Instacart and Meta executive Asha Sharma. With Sharma’s most recent role as the president of Microsoft’s CoreAI product, these moves suggest that Microsoft might be doubling down on bringing AI into video games.\n\nThe company had already been experimenting with ways to combine AI and gaming, for exampledeveloping an AI gaming companionandreleasing a buggy, AI-generated level from “Quake II.”\n\nIndeed, in an internal memopublished by The Verge, Sharma wrote that Microsoft “will invent new business models and new ways to play” and said that “monetization and AI” will both “evolve and influence this future.” At the same time, she said that the company “will not chase short-term efficiency or flood our ecosystem with soulless AI slop.”\n\n“Games are and always will be art, crafted by humans, and created with the most innovative technology provided by us,” Sharma added.\n\nThat’s just one of three “commitments” Sharma made in her memo. The others involve building “great games beloved by players” and prioritizing Xbox.",
      "excerpt": "Microsoft announced a major gaming shakeup on Friday, with Microsoft Gaming CEO Phil Spencer departing the company, along with Xbox President Sarah Bond.\n\nSpencer will be replaced by former Instacart and Meta executive Asha Sharma. With Sharma’s most recent role as the president of Microsoft’s CoreA",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "7 days until ticket prices rise for TechCrunch Disrupt 2026",
      "link": "https://techcrunch.com/2026/02/21/7-days-until-ticket-prices-rise-for-techcrunch-disrupt-2026/",
      "author": "TechCrunch Events",
      "date": "2026-02-21T07:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/TCD26_7Days-16X9-Dark.png?resize=1200,675",
      "category": "Startups",
      "content": "Super Early Bird pricing forTechCrunch Disrupt 2026ends February 27 at 11:59 p.m. PT. That gives you one week to secure the biggest savings of the year — up to $680 off individual passes and up to 30% off community passes.Register now to lock in at the lowest rate.\n\nFrom October 13-15 at Moscone West in San Francisco, Disrupt will bring together 10,000 founders, investors, and operators for three days engineered for results.\n\nExplore300+ exhibiting startups. ExperienceStartup Battlefield 200, where one standout company wins a $100,000 equity-free prize. Meet the leaders who can change your company’s trajectory.\n\nDisrupt has a long track record of bringing together the most influential voices in tech. Previous speakers have included WordPress co-founderMatt Mullenweg,Phia co-foundersPhoebe Gates and Sophia Kianni, and renowned investorElad Gil, alongside leaders from Google Cloud, Netflix, Waymo, and more — all sharing actionable insights for building and scaling what’s next. Stay tuned to theevent siteto see when the 2026 agenda drops.\n\nSeven days remain to secure the lowest rate of the year. Whether you’re scaling a company or sourcing your next investment, there’s a pass built for you.Lock in your savings before February 27 at 11:59 p.m. PT.",
      "excerpt": "Super Early Bird pricing forTechCrunch Disrupt 2026ends February 27 at 11:59 p.m. PT. That gives you one week to secure the biggest savings of the year — up to $680 off individual passes and up to 30% off community passes.Register now to lock in at the lowest rate.\n\nFrom October 13-15 at Moscone Wes",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}