{
  "last_updated": "2026-02-17T22:35:40.028182+00:00",
  "articles": [
    {
      "title": "Running AI models is turning into a memory game",
      "link": "https://techcrunch.com/2026/02/17/running-ai-models-is-turning-into-a-memory-game/",
      "author": "Russell Brandom",
      "date": "2026-02-17T08:44:14-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2009/01/samsung_50nm_dram.jpg?w=425",
      "category": "AI",
      "content": "When we talk about the cost of AI infrastructure, the focus is usually on Nvidia and GPUs — but memory is an increasingly important part of the picture. As hyperscalers prepare to build out billions of dollars worth of new data centers, the price for DRAM chips has jumpedroughly 7x in the last year.\n\nAt the same time, there’s a growing discipline in orchestrating all that memory to make sure the right data gets to the right agent at the right time. The companies that master it will be able to make the same queries with fewer tokens, which can be the difference between folding and staying in business.\n\nSemiconductor analyst Doug O’Laughlinhas an interesting look at the importance of memory chips on his Substack, where he talks with Val Bercovici, chief AI officer at Weka. They’re both semiconductor guys, so the focus is more on the chips than the broader architecture; the implications for AI software are pretty significant too.\n\nI was particularly struck by this passage, in which Bercovici looks at the growing complexity ofAnthropic’s prompt-caching documentation:\n\nThe tell is if we go to Anthropic’s prompt caching pricing page. It started off as a very simple page six or seven months ago, especially as Claude Code was launching — just “use caching, it’s cheaper.” Now it’s an encyclopedia of advice on exactly how many cache writes to pre-buy. You’ve got 5-minute tiers, which are very common across the industry, or 1-hour tiers — and nothing above. That’s a really important tell. Then of course you’ve got all sorts of arbitrage opportunities around the pricing for cache reads based on how many cache writes you’ve pre-purchased.\n\nThe question here is how long Claude holds your prompt in cached memory: you can pay for a 5-minute window, or pay more for an hour-long window. It’s much cheaper to draw on data that’s still in the cache, so if you manage it right, you can save an awful lot. There is a catch though: every new bit of data you add to the query may bump somethin",
      "excerpt": "When we talk about the cost of AI infrastructure, the focus is usually on Nvidia and GPUs — but memory is an increasingly important part of the picture. As hyperscalers prepare to build out billions of dollars worth of new data centers, the price for DRAM chips has jumpedroughly 7x in the last year.",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "SpaceX vets raise $50M Series A for data center links",
      "link": "https://techcrunch.com/2026/02/17/spacex-vets-raise-50m-series-a-for-data-center-links/",
      "author": "Tim Fernholz",
      "date": "2026-02-17T09:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Screenshot-2026-02-16-at-11.06.38-AM.png?resize=1200,679",
      "category": "AI",
      "content": "Travis Brashears, Cameron Ramos and Serena Grown-Haeberli began collaborating at SpaceX, developing optical communications links that keep thousands of Starlink internet satellites in constant contact.\n\nNow, the three engineers are co-founders of Mesh Optical Technologies, a Los Angeles startup that announced a $50 million Series A led by Thrive Capital on Tuesday.\n\nMesh aims to mass-produce optical transceivers, devices that convert optical signals from fiber or laser into electrical signals for computers. CEO Brashears, President Ramos, and VP of Product Grown-Haeberli realized the opportunity when designing a new generation of compute-hungry SpaceX satellites forced them to assess the optical transceiver market, and they saw its limitations.\n\nOptical transceivers are particularly important for data centers aimed at training and operating large deep learning models, because they allow multiple GPUs to work in concert. One established U.S. supplier, AOI,won a contractworth $4 billion to provide components for AWS data centers last year.\n\n“Someone will brag about a million GPU cluster; you have to multiply by four to five for the number of transceivers in that cluster,” Brashears explained.\n\nThe company’s goal is to manufacture a thousand units per day within the year so they can begin qualifying for bulk orders in 2027 and 2028.\n\nThe optical transceiver market is dominated by Chinese firms and suppliers, and Mesh sees an advantage in building its supply chain outside of that country. While trade restrictions haven’t impacted the market yet, the founders and their backers see themselves as getting in front of a national security dilemma.\n\n“If AI is the most important technology in several generations (which we believe to be true), to have critical parts of AI data center capex run through misaligned/competitive countries is a problem,” Thrive Partner Philip Clark wrote TechCrunch. “In the immediate term, Mesh is solving our need for better ways to do interconnect if",
      "excerpt": "Travis Brashears, Cameron Ramos and Serena Grown-Haeberli began collaborating at SpaceX, developing optical communications links that keep thousands of Starlink internet satellites in constant contact.\n\nNow, the three engineers are co-founders of Mesh Optical Technologies, a Los Angeles startup that",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "European Parliament blocks AI on lawmakers’ devices, citing security risks",
      "link": "https://techcrunch.com/2026/02/17/european-parliament-blocks-ai-on-lawmakers-devices-citing-security-risks/",
      "author": "Zack Whittaker",
      "date": "2026-02-17T08:30:43-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/EU-ai-1258475609.jpg?w=1024",
      "category": "Security",
      "content": "The European Parliament has reportedly blocked lawmakers from using the baked-in AI tools on their work devices, citing cybersecurity and privacy risks with uploading confidential correspondence to the cloud.\n\nPer an emailseen by Politico, the parliament’s IT department said it could not guarantee the security of the data uploaded to the servers of AI companies and that the full extent of what information is shared with AI companies is “still being assessed.”\n\nAs such, the email said, “It is considered safer to keep such features disabled.”\n\nUploading data to AI chatbots, like Anthropic’s Claude, Microsoft’s Copilot, and OpenAI’s ChatGPT, for example, means that U.S. authorities can demand the companies that run the chatbots turn over information about their users.\n\nAI chatbots also typically rely on using information that users provide or upload to improve their models, increasing the chance that potentially sensitive information uploaded by one person may be shared and seen by other users.\n\nEurope has some of the strongest data protection rules in the world. But the European Commission, the executive body that oversees the 27-member state bloc, last yearfloated new legislative proposalsaimed at relaxing its data protection rules to make it easier for tech giants to train their AI models on Europeans’ data, drawing ire from critics who said the move caves in to U.S. technology giants.\n\nThe move to restrict European lawmakers from accessing AI products on their devices comes as several EU member countriesreevaluate their relationshipswith U.S. tech giants, which remain subject to U.S. law and the unpredictable whims and demands of the Trump administration.\n\nIn recent weeks, the U.S. Department of Homeland Security hassent hundreds of subpoenasdemanding U.S. tech and social media giants turn over information about people, including Americans, who have been publicly critical of the Trump administration’s policies.\n\nGoogle, Meta, and Redditcomplied in several cases, ev",
      "excerpt": "The European Parliament has reportedly blocked lawmakers from using the baked-in AI tools on their work devices, citing cybersecurity and privacy risks with uploading confidential correspondence to the cloud.\n\nPer an emailseen by Politico, the parliament’s IT department said it could not guarantee t",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Here are the 17 US-based AI companies that have raised $100M or more in 2026",
      "link": "https://techcrunch.com/2026/02/17/here-are-the-17-us-based-ai-companies-that-have-raised-100m-or-more-in-2026/",
      "author": "Rebecca Szkutak",
      "date": "2026-02-17T06:58:09-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/07/ai-deals.jpg?resize=1200,675",
      "category": "AI",
      "content": "Nearly 20 U.S.-based AI startups have raised mega-rounds of $100 million or more in 2026 — and it’s been less than two months.\n\nIf the first few weeks of 2026 are any indicator, the AI startup market is in for another year of monster funding rounds at eye-watering valuations. U.S. AI startups raised more than $76 billion through mega-rounds in 2025, per TechCrunch’s count.\n\nWill startups see the same success in 2026? Time will tell.\n\nHere are all the U.S.-based AI startups that have raised $100 million or more thus far:",
      "excerpt": "Nearly 20 U.S.-based AI startups have raised mega-rounds of $100 million or more in 2026 — and it’s been less than two months.\n\nIf the first few weeks of 2026 are any indicator, the AI startup market is in for another year of monster funding rounds at eye-watering valuations. U.S. AI startups raised",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Just 8 months in, India’s vibe-coding startup Emergent claims ARR of over $100M",
      "link": "https://techcrunch.com/2026/02/17/emergent-hits-100m-arr-eight-months-after-launch-rolls-out-mobile-app/",
      "author": "Jagmeet SinghIvan Mehta6:00 AM PST · February 17, 2026",
      "date": "2026-02-17T06:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/emergent-mobile-app.jpg?resize=1200,800",
      "category": "AI",
      "content": "Indian vibe-coding platformEmergentwas launched just eight months ago, and it now says it’s generating annual run-rate revenue of more than $100 million, thanks to surging demand by small businesses and non-technical users.\n\nThe startup on Tuesday said it had doubled its annual run-rate revenue to $100 million in the past month, and it now has more than 6 million users worldwide across 190 countries, of which about 150,000 are paying customers. Emergent claims its users have created over 7 million applications on its platform.\n\nNearly 40% of Emergent’s users are small businesses, and about 70% have no prior coding experience. People mostly use the platform to digitize operations previously run on spreadsheets, email, or messaging apps, and to build custom software, co-founder and CEO Mukund Jha told TechCrunch.\n\nEmergent’s rapid growth comes as interest in “vibe-coding,” or using AI to code software, skyrockets around the world. The demand seems to be mostly driven by non-technical users who want to build production-ready applications using natural language and AI agents, though plenty of developers have turned to using such platforms to reduce their workloads.\n\nThe startup competes with the likes of Replit, Lovable,Rocket.new,Wabi,andAnything, among others.\n\nJha said most users on Emergent are building business-facing apps such as custom CRMs, ERPs, and inventory management and logistics tools. About 80% to 90% of new projects are focused on mobile apps, reflecting demand for software that can be deployed quickly and used on the go.\n\nEmergent generates revenue through a mix of subscriptions, usage-based pricing, and deployment and hosting fees, Jha said, adding that all three segments are growing rapidly and that the company’s gross margins are improving every month.\n\n“Growth is accelerating,” Jha told TechCrunch. “As the models and platforms are improving, we’re seeing a lot more users getting to success.”\n\nWhile usage today is dominated by consumers and small bus",
      "excerpt": "Indian vibe-coding platformEmergentwas launched just eight months ago, and it now says it’s generating annual run-rate revenue of more than $100 million, thanks to surging demand by small businesses and non-technical users.\n\nThe startup on Tuesday said it had doubled its annual run-rate revenue to $",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Airbnb expands its ‘Reserve Now, Pay Later’ globally",
      "link": "https://techcrunch.com/2026/02/17/airbnb-expands-its-reserve-now-pay-later-globally/",
      "author": "Ivan Mehta",
      "date": "2026-02-17T05:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/08/First-time-booking-Airbnb.jpg?resize=1200,874",
      "category": "Apps",
      "content": "Airbnb said on Tuesday that it is launching its “Reserve Now, Pay Later” feature — which lets users secure bookings without immediate payment — globally. This allows users to cancel their bookings if there is a change of plans without losing money up front.\n\nThe company launched the feature in the U.S. last yearfor domestic travel. Airbnb said that properties with a “flexible” or “moderate” cancellation policy are eligible for the upfront reservation. With this option, users get charged closer to their check-in date rather than at the time of booking. The feature mirrors “buy now, pay later” payment plans that have become popular in e-commerce, making expensive travel more accessible by spreading out costs. The company noted that since the launch, the feature saw 70% adoption for eligible bookings.\n\nDuring its earnings calls for Q4 2025, Airbnb said that the feature helped grow nights booked in the quarter.\n\n“Reserve Now, Pay Later saw significant adoption among eligible guests in Q4. It’s also led to longer booking lead times and a mix shift towards larger entire homes, especially those with four or more bedrooms, contributing to the increase in average daily rate,” Ellie Mertz, CFO of Airbnb, said during the call.\n\nMertz noted that Airbnb’s overall cancellation rate jumped from 16% to 17% for the quarter, and it was higher among customers who use the upfront booking product. However, she said that this was “not hugely material relative to the broader cancellations on the platform.”\n\nLast year, the company surveyed U.S. travelers along with Focaldata, a London-based market research and polling company. Of those surveyed, 60% of participants said that a flexible payment option is important while booking a holiday, and 55% said they would use a flexible payment option.\n\nThe company has been experimenting with pay-later products for years now. Back in 2018, Airbnb launched a product that allowed users to book a property by paying20% or 50% of the total chargesup front",
      "excerpt": "Airbnb said on Tuesday that it is launching its “Reserve Now, Pay Later” feature — which lets users secure bookings without immediate payment — globally. This allows users to cancel their bookings if there is a change of plans without losing money up front.\n\nThe company launched the feature in the U",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Flapping Airplanes on the future of AI: ‘We want to try really radically different things’",
      "link": "https://techcrunch.com/2026/02/16/flapping-airplanes-on-the-future-of-ai-we-want-to-try-really-radically-different-things/",
      "author": "Russell Brandom",
      "date": "2026-02-16T06:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Flapping-Airplanes-founders-photo.jpg?resize=1200,821",
      "category": "AI",
      "content": "There’s been a bunch of exciting research-focused AI labs popping upin recent months, and Flapping Airplanes is one of the most interesting. Propelled by its young and curious founders,Flapping Airplanesis focused on finding less data-hungry ways to train AI. It’s a potential game-changer for the economics and capabilities of AI models — and with $180 million in seed funding, they’ll have plenty of runway to figure it out.\n\nLast week, I spoke with the lab’s three co-founders — brothers Ben and Asher Spector, and Aidan Smith — about why this is an exciting moment to start a new AI lab and why they keep coming back to ideas about the human brain.\n\nI want to start by asking, why now? Labs like OpenAI and DeepMind have spent so much on scaling their models. I’m sure the competition seems daunting. Why did this feel like a good moment to launch a foundation model company?\n\nBen:There’s just so much to do. So, the advances that we’ve gotten over the last five to 10 years have been spectacular. We love the tools. We use them every day. But the question is, is this the whole universe of things that needs to happen? And we thought about it very carefully and our answer was no, there’s a lot more to do. In our case, we thought that the data efficiency problem was sort of really the key thing to go look at. The current frontier models are trained on the sum totality of human knowledge, and humans can obviously make do with an awful lot less. So there’s a big gap there, and it’s worth understanding.\n\nWhat we’re doing is really a concentrated bet on three things. It’s a bet that this data efficiency problem is the important thing to be doing. Like, this is really a direction that is new and different and you can make progress on it. It’s a bet that this will be very commercially valuable and that will make the world a better place if we can do it. And it’s also a bet that’s sort of the right kind of team to do it is a creative and even in some ways inexperienced team that can go ",
      "excerpt": "There’s been a bunch of exciting research-focused AI labs popping upin recent months, and Flapping Airplanes is one of the most interesting. Propelled by its young and curious founders,Flapping Airplanesis focused on finding less data-hungry ways to train AI. It’s a potential game-changer for the ec",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Have money, will travel: a16z’s hunt for the next European unicorn",
      "link": "https://techcrunch.com/2026/02/16/have-money-will-travel-a16zs-hunt-for-the-next-european-unicorn/",
      "author": "Anna Heim",
      "date": "2026-02-16T10:53:56-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-157503102.jpg?resize=1200,776",
      "category": "Venture",
      "content": "Gabriel Vasquez, a partner at Andreessen Horowitz, recently revealed hetook nine flightsfrom NYC to Stockholm in one year. While his visits included stops at companies like Lovable — where hepostedfrom its office — the trips were also about finding future Swedish unicorns before they cross the Atlantic.\n\nThis all came to light whennews emergedthat a16z had led a$2.3 million pre-seed roundintoDentio, a Swedish startup that uses AI to help dentists’ practices with admin work. While this is a small check for a firm that just announced new funds totaling$15 billion, it confirms that U.S. VCs are actively seeking deal flow outside of the U.S., even without local offices.\n\nStockholm is a natural stop for a16z, which previously achieved significant returns from backing Skype, co-founded by Swedish entrepreneur Niklas Zennström. Since then, a significant number of fast-growing startups have been created in the Swedish capital, and the VC heavyweight tracked down where many of them were coming from.\n\n“We spend a lot of time developing a deep understanding of specific markets and knowing where innovation is emerging. In Sweden, that has meant closely tracking ecosystems like [SSE Business Lab] — the startup incubator of the Stockholm School of Economics — and the companies coming out of it,” Vasquez told TechCrunch.\n\nLike fintech giant Klarna, legal AI startup Legora, and e-scooter company Voi, Dentio is an alum of SSE Business Lab — a startup incubator that has produced several successful Swedish companies. The three former high school classmates Elias Afrasiabi, Anton Li, and Lukas Sjögren joined the incubator after reconnecting as students at both the SSE (Stockholm School of Economics) and KTH (Royal Institute of Technology), then joined the incubator with additional backing from KTH’sInnovation Launch program. They tackled a problem close to home: Li’s mom, a dentist, had told them how admin work detracted from clinical care.\n\nThe trio intuited that they could leverage L",
      "excerpt": "Gabriel Vasquez, a partner at Andreessen Horowitz, recently revealed hetook nine flightsfrom NYC to Stockholm in one year. While his visits included stops at companies like Lovable — where hepostedfrom its office — the trips were also about finding future Swedish unicorns before they cross the Atlan",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Meta’s own research found parental supervision doesn’t really help curb teens’ compulsive social media use",
      "link": "https://techcrunch.com/2026/02/17/metas-own-research-found-parental-supervision-doesnt-really-help-curb-teens-compulsive-social-media-use/",
      "author": "Sarah Perez",
      "date": "2026-02-17T12:45:33-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2021/12/GettyImages-1237098710.jpeg?resize=1200,800",
      "category": "Social",
      "content": "An internal research study at Meta dubbed “Project MYST” created in partnership with theUniversity of Chicago, found that parental supervision and controls — such as time limits and restricted access — had little impact on kids’ compulsive use of social media. The study also found that kids who experienced stressful life events were more likely to lack the ability to moderate their social media use appropriately.\n\nThis was one of the notable claims revealed during testimony at the social media addiction trial that began last week in Los Angeles County Superior Court. The plaintiff in the lawsuit is identified by her initials “KGM” or her first name, “Kaley.” She, along with her mother and others joining the case, is accusing social media companies of creating “addictive and dangerous” products that led the young users to suffer anxiety, depression, body dysmorphia, eating disorders, self-harm, suicidal ideation, and more.\n\nThe case is now one of several landmark trials that will take place this year, which accuse social media companies of harming children. The results of these lawsuits will impact these companies’ approach to their younger users and could prompt regulators to take further action.\n\nIn this case, the plaintiff sued Meta, YouTube, ByteDance (TikTok), and Snap, but the latter two companieshadsettledtheir claims before the trial’s start.\n\nIn the jury trial now underway in L.A., Kaley’s lawyer, Mark Lanier, brought up an internal study at Meta, which he said found evidence that Meta knew of, yet didn’t publicize, these specific harms.\n\nIn Project MYST, which stands for the Meta and Youth Social Emotional Trends survey, Meta’s research concluded that “parental and household factors have little association with teens’ reported levels of attentiveness to their social media use.”\n\nOr, in other words, even when parents try to control their children’s social media use, either by using parental controls or even just household rules and supervision, it doesn’t im",
      "excerpt": "An internal research study at Meta dubbed “Project MYST” created in partnership with theUniversity of Chicago, found that parental supervision and controls — such as time limits and restricted access — had little impact on kids’ compulsive use of social media. The study also found that kids who expe",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Apple is reportedly cooking up a trio of AI wearables",
      "link": "https://techcrunch.com/2026/02/17/apple-is-reportedly-cooking-up-a-trio-of-ai-wearables/",
      "author": "Lucas Ropek",
      "date": "2026-02-17T12:14:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/tim-cook-speaking-GettyImages-2234517834.jpg?w=1024",
      "category": "",
      "content": "Late last month, The Informationreported thatApple was developing an AI wearable—an AirTag-sized pendant with cameras that could be pinned to a user’s shirt. Now, Bloombergwrites thatthe development of such a device—along with two other AI-powered items—is accelerating as Apple looks to stay competitive with other tech giants that are racing to release similar products.\n\nIn addition to the AI pin, Apple is also speeding up the development of its upcoming AI-powered smart glasses,which have been code-named N50, the report claims. Apple obviously has competition in this space, as other companies—including Meta (which is arguably the mostsuccessful playerwhen it comes to smart glasses) and Snap (whichplans to releaseits “Specs” later this year)—are working on similar products.\n\nApple’s new smart glasses, which will supposedly include a high-resolution camera, may see a public release sooner rather than later, with Bloomberg reporting that the company is “targeting the start of production as early as December, ahead of a public release in 2027.”\n\nAdditionally, Bloomberg reports that Apple is working on AirPods with new AI capabilities.\n\nAll of these items will be designed to connect to the iPhone and will include Siri, the company’s virtual assistant, as a critical component of the user experience, the outlet notes. The glasses are being described as “more upscale and feature-rich” than the AirPods and the AI pendant, however. TechCrunch reached out to Apple for more information.",
      "excerpt": "Late last month, The Informationreported thatApple was developing an AI wearable—an AirTag-sized pendant with cameras that could be pinned to a user’s shirt. Now, Bloombergwrites thatthe development of such a device—along with two other AI-powered items—is accelerating as Apple looks to stay competi",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}