{
  "last_updated": "2026-02-02T16:18:14.883599+00:00",
  "articles": [
    {
      "title": "Why Tether’s CEO is everywhere right now",
      "link": "https://techcrunch.com/2026/02/01/why-tethers-ceo-is-everywhere-right-now/",
      "author": "Connie Loizos",
      "date": "2026-02-01T12:32:21-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2258508694.jpg?w=1024",
      "category": "Crypto",
      "content": "If you read the news, you might have noticed a trend this past week. In addition to splashy features inFortuneandBloomberg, Tether CEO Paolo Ardoino talked withReuters, He also talked with TechCrunch. Why did the man behind the stablecoin that everyone loves to hate launch a full-scale media blitz? The timing isn’t arbitrary. This week, Tether launchedUSAT, a U.S.-regulated stablecoin issued through Anchorage Digital Bank — its first product designed to comply with new federal rules and compete directly with Circle’s USDC. Fidelity Investments also just launched acompeting stablecoinon Wednesday, joining JPMorgan Chase and PayPal in a broadening race. It’s a big shift from one extreme to the other. For years, Ardoino avoided the United States, watching from offshore as regulators circled and prosecutors investigated. His company was portrayed as opaque, possibly fraudulent, and, according to a piece by The Economist last summer, a “money launderer’s dream.” But when Ardoino and I chatted by video call this week, it was clear those days are over. Tether is meeting with White House officials, collaborating with the FBI and Secret Service, and betting USAT can break Circle’s grip on the U.S. market. (USAT is separate from Tether’s flagship USDT, which has $187 billion in circulation globally but doesn’t meet new U.S. regulatory requirements.) Speaking from Lugano, Switzerland, where Tether maintains an office, the 41-year-old – who joined the company just two months after its 2014 launch – spent over an hour describing Tether’s transformation from a crypto play to mainstream acceptance. Its momentum is undeniable, certainly. Tether’s USDT — essentially a digital dollar that uses blockchain technology to move across borders without being tied to any single institution — has a market capitalization larger than all of its stablecoin competitors combined. It also has some 536 million users, growing at 30 million per quarter. “It’s growing at a pace more like Facebook rathe",
      "excerpt": "If you read the news, you might have noticed a trend this past week. In addition to splashy features inFortuneandBloomberg, Tether CEO Paolo Ardoino talked withReuters, He also talked with TechCrunch. Why did the man behind the stablecoin that everyone loves to hate launch a full-scale media blitz? ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Amazon’s ‘Melania’ documentary makes $7M on opening weekend",
      "link": "https://techcrunch.com/2026/02/01/amazons-melania-documentary-makes-7m-on-opening-weekend/",
      "author": "Anthony Ha",
      "date": "2026-02-01T11:16:27-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-2202598378.jpg?resize=1200,787",
      "category": "Media & Entertainment",
      "content": "“Melania,” a documentary about First Lady Melania Trump, isexceeding box office expectations, with Sunday estimates suggesting it will make $7.04 million on its opening weekend. The documentary is coming in third overall for the weekend, behind the Sam Raimi-directed thriller “Send Help” ($20 million) and “Iron Lung” ($17.8 million), a video game adaptation from YouTuber Mark Fischbach (better known as Markiplier). Amazon paid $40 million to acquire “Melania” and is reportedly spending $35 million to promote it. So even though the documentary is outperforming pre-release estimates predicting a $3 to $5 million opening weekend, it’s unlikely to make a profit in theaters. Amazon’s bid came in $26 million ahead of the next highest bidder, Disney, leading critics to suggest the deal had less to do with the film’s box office potential and more with winning over the Trump administration. Veteran film executive Ted Hope, who worked at Amazon from 2015 to 2020,told The New York Timesthat the film “has to be the most expensive documentary ever made that didn’t involve music licensing.” “How can it not be equated with currying favor or an outright bribe?” Hope said. “How can that not be the case?” This is the first film directed by Brett Ratner since 2017, whenmultiple women accused him of sexual harassment and misconduct.(Ratner has denied those accusations.) Rolling Stone reports thattwo-thirds of the “Melania”‘s New York crew asked not to be formally creditedin the film. While Apple CEO Tim Cookattended a preview screening of “Melania”at the White House last weekend, “Melania” was not screened in advance for critics, and the subsequent reviews have been brutal. The documentary currentlysits at 7% on review aggregator Metacritic, indicating “overwhelming dislike,” andat 10% on Rotten Tomatoes. New York Times film criticManohla Dargis described itas “a very circumscribed and carefully stage-managed chronicle of Mrs. Trump’s day-to-day life” during the 20 days before Presiden",
      "excerpt": "“Melania,” a documentary about First Lady Melania Trump, isexceeding box office expectations, with Sunday estimates suggesting it will make $7.04 million on its opening weekend. The documentary is coming in third overall for the weekend, behind the Sam Raimi-directed thriller “Send Help” ($20 millio",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Bye-bye corporate conglomerates. Hello personal conglomerates.",
      "link": "https://techcrunch.com/2026/02/01/bye-bye-corporate-conglomerates-hello-personal-conglomerates/",
      "author": "Tim De Chant",
      "date": "2026-02-01T07:39:08-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/04/GettyImages-2147789843.jpg?resize=1200,737",
      "category": "Transportation",
      "content": "Aerospace, energy, healthcare, mobility, and media. Thirty years ago, we’d be talking about General Electric. Today, we’re talking about Elon Musk. He’s the CEO of Tesla, xAI, and SpaceX, which also owns the telecoms company Starlink. He owns the social media platform X. He’s developing neural implants and underground tunnels. He’s put at least $10 million behindfertility research. Musk also appears to be merging several of these ventures intoone conglomerate. Musk has frequently been likened to Henry Ford. A more apt comparison might be to John D. Rockefeller or Jack Welch, who took GE from an ailing industrial company into a sprawling conglomerate. The Welch comparison could turn out to be particularly valid if Musk follows through on rumors that he’strying to merge some combination of SpaceX, xAI and Tesla. The similarities aren’t all encompassing, of course. GE was a company, and Musk is a person. But the distinction can get a bit blurry in an era when his net worth eclipses the market cap of 97% of the S&P 500. In fact, Musk’s net worth is approaching $800 billion, almost as much as GE at its peak when adjusted for inflation. At its height, GE was often inseparable from its chairman, Jack Welch. Musk, the individual, captivates many of his peers, just like Welch did. Executives today talk of being “hardcore” and espouse “first-principles thinking,” just like CEOs of the 1980s sought to emulate Welch through “accretive” mergers and mass layoffs. Today, Musk’s empire spans Tesla, SpaceX, xAI (including with X), Neuralink, and The Boring Company, all companies with very different goals. Sure, Teslas drive through The Boring Company’s holes, xAI’s Grok is available in the automaker’s vehicles, and Tesla has supplied its Megapack batteries to xAI’s data centers. But apart from sharing Musk’s ownership or leadership, they’ve had limited interaction with each other until recently, when Tesla and SpaceXseparatelyinvestedin xAI. At one time, not so long ago, GE was the ",
      "excerpt": "Aerospace, energy, healthcare, mobility, and media. Thirty years ago, we’d be talking about General Electric. Today, we’re talking about Elon Musk. He’s the CEO of Tesla, xAI, and SpaceX, which also owns the telecoms company Starlink. He owns the social media platform X. He’s developing neural impla",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Meet the new European unicorns of 2026",
      "link": "https://techcrunch.com/2026/01/31/meet-the-new-european-unicorns-of-2026/",
      "author": "Anna Heim",
      "date": "2026-01-31T23:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-1464151513.jpg?resize=1200,800",
      "category": "Fundraising",
      "content": "January was such a long month that it has already brought us five fresh European unicorns: from Belgium to Ukraine, several tech startups raised funding at valuations above the $1 billion threshold. But before we take a closer look at who joined the club, two caveats. First: This count includes startups that may be incorporated elsewhere but have their roots or a large part of their team in Europe. Untila pan-European corporate structureexists (often called “EU Inc”), this split will remain common — and we’ve decided to overlook it. TakeLovable, which is incorporated in Delaware but cannot be dissociated from Stockholm’s startup scene. Second: valuation doesn’t equal commercial success, and it is too early to tell whether all of these companies will achieve the kind of traction that Lovable has, with the company recentlycrossing $300 million in annual recurring revenue. But in the current climate, the fact that VCs were willing to invest in them at unicorn valuations is a strong signal of where the appetite is. With these caveats out of the way, let’s dive in. Belgium-based cybersecurity startupAikido Securityreached unicorn status with its$60 million Series Bfunding round. Valuing the company at $1 billion, the round was led by DST Global, with participation from PSG Equity, Singular, Notion Capital, and others. According to a press release, the funding will help Aikido enhance its platform, which was built to unify security across the entire software lifecycle and is already used by more than 100,000 teams globally. The company also reported “five-times revenue growth and nearly three-times customer growth” over the last year. In ablog post, the startup celebrated this milestone and its significance. According to its team, “in an industry dominated by Palo Alto and Tel Aviv heavyweights, Aikido shows that Europe can build a world-class software security company and win globally.” Cloud optimization companyCast AIis headquartered in Florida, but has Lithuanian root",
      "excerpt": "January was such a long month that it has already brought us five fresh European unicorns: from Belgium to Ukraine, several tech startups raised funding at valuations above the $1 billion threshold. But before we take a closer look at who joined the club, two caveats. First: This count includes star",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Indonesia ‘conditionally’ lifts ban on Grok",
      "link": "https://techcrunch.com/2026/02/01/indonesia-conditionally-lifts-ban-on-grok/",
      "author": "Anthony Ha",
      "date": "2026-02-01T09:20:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2207699717.jpg?resize=1200,800",
      "category": "AI",
      "content": "Indonesia has followed Malaysia and the Philippines in lifting a ban on xAI’s chatbot Grok. The Southeast Asian countries banned Grok after it was used to create a flood of nonconsensual, sexualized imagery on X (now a subsidiary of xAI), including images of real women and minors. In late December and January,Grok was used to create at least 1.8 million sexualized images of women, according to separate analyses by The New York Times and the Center for Countering Digital Hate. Ina statement, Indonesia’s Ministry of Communication and Digital Affairs said that it was lifting the ban after X sent a letter “outlining concrete steps for service improvements and the prevention of misuse” (translationvia The New York Times). Alexander Sabar, the ministry’s director general of digital space monitoring, said the ban is only being lifted “conditionally” and could be reinstated if “further violations are discovered.” Malaysia and the Philippines lifted their bans on January 23. Grok’s deepfakes have spurred criticism and investigations — but only a few outright bans — from governments around the world. In the United States, California Attorney General Rob Bonta said his office wasinvestigating xAI and had sent a cease-and-desist letterordering the company to take immediate action to end the production of these images. xAI appears to have taken some steps to restrict Grok’s capabilities, includinglimiting its AI image generation feature to paying subscribers on X. CEOElon Musk has insisted, “Anyone using Grok to make illegal content will suffer the same consequences as if they upload illegal content” and said he is “not aware of any naked underage images generated by Grok.” Documents released by the Justice Department on Friday around the notorious sex offender Jeffrey Epstein includeat least 16 emails between Musk and Epsteinin 2012 and 2013, with Musk asking to visit Epstein’s Caribbean island and wondering about the “wildest party on your island.” Epstein pleaded guilty to pr",
      "excerpt": "Indonesia has followed Malaysia and the Philippines in lifting a ban on xAI’s chatbot Grok. The Southeast Asian countries banned Grok after it was used to create a flood of nonconsensual, sexualized imagery on X (now a subsidiary of xAI), including images of real women and minors. In late December a",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Nvidia CEO pushes back against report that his company’s $100B OpenAI investment has stalled",
      "link": "https://techcrunch.com/2026/01/31/nvidia-ceo-pushes-back-against-report-that-his-companys-100b-openai-investment-has-stalled/",
      "author": "Anthony Ha",
      "date": "2026-01-31T09:54:12-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-2205754389.jpg?w=1024",
      "category": "AI",
      "content": "Nvidia CEO Jensen Huang said Saturday that a recent report of friction between his company and OpenAI was “nonsense.” Huang’s comments came after The Wall Street Journal published a story late Friday claiming thatNvidia was looking to scale back its investmentin OpenAI. The two companies announced a plan in September through whichNvidia would invest up to $100 billion in OpenAIand also build 10 gigawatts of computing infrastructure for the AI company. However, the WSJ said Huang has begun emphasizing that the deal is nonbinding, and that he’s also privately criticized OpenAI’s business strategy and expressed concerns about competitors like Anthropic and Google. In addition, the WSJ reported that the two companies are rethinking their relationship — though that doesn’t mean cutting things off entirely, with recent discussions reportedly focusing on an equity investment of a mere tens of billions of dollars from Nvidia. An OpenAI spokesperson told the WSJ that the companies are “actively working through the details of our partnership,” adding that Nvidia “has underpinned our breakthroughs from the start, powers our systems today, and will remain central as we scale what comes next.” According to Bloomberg, reporters asked Huang about the report during a visit to Taipei. In response,he insisted that Nvidia will “definitely participate”in OpenAI’s latest funding round “because it’s such a good investment.” “We will invest a great deal of money,” Huang said. “I believe in OpenAI. The work that they do is incredible. They’re one of the most consequential companies of our time.” He apparently declined to specify how much Nvidia would be investing, instead saying, “Let [OpenAI CEO Sam Altman] announce how much he’s going to raise — it’s for him to decide.” The WSJ reported in December thatOpenAI is looking to raise a $100 billion funding round, while The New York Times said this week thatNvidia, Amazon, Microsoft, and SoftBank are all discussingpotential investments.",
      "excerpt": "Nvidia CEO Jensen Huang said Saturday that a recent report of friction between his company and OpenAI was “nonsense.” Huang’s comments came after The Wall Street Journal published a story late Friday claiming thatNvidia was looking to scale back its investmentin OpenAI. The two companies announced a",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "OpenClaw’s AI assistants are now building their own social network",
      "link": "https://techcrunch.com/2026/01/30/openclaws-ai-assistants-are-now-building-their-own-social-network/",
      "author": "Anna Heim",
      "date": "2026-01-30T15:36:34-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-1396827010.jpg?resize=1200,839",
      "category": "AI",
      "content": "The viral personal AI assistant formerly known as Clawdbot has a new name — again. After a legal challenge from Claude’s maker, Anthropic, it had briefly rebranded as Moltbot, but has now settled on OpenClaw as its new name. The latest name change wasn’t prompted by Anthropic, which declined to comment. But this time, Clawdbot’s original creator Peter Steinberger made sure to avoid copyright issues from the start. “I got someone to help with researching trademarks for OpenClaw and also asked OpenAI for permission just to be sure,” the Austrian developer told TechCrunch via email. “The lobster has molted into its final form,” Steinberger wrote in ablog post. Molting — the process through which lobsters grow — had also inspired OpenClaw’s previous name, but Steinberger confessedon Xthat the short-lived moniker “never grew” on him, and others agreed. This quick name change highlights the project’s youth, even as it has attracted over 100,000 GitHub stars (a measure of popularity on the software development platform) in just two months. According to Steinberger, OpenClaw’s new name is a nod to its roots and community. “This project has grown far beyond what I could maintain alone,” he wrote. The OpenClaw community has already spawned creative offshoots, including Moltbook — a social network where AI assistants can interact with each other. The platform has also attracted significant attention from AI researchers and developers. Andrej Karpathy, Tesla’s former AI director, called the phenomenon “genuinely the most incrediblesci-fi takeoff-adjacent thingI have seen recently,” noting that “People’s Clawdbots (moltbots, now OpenClaw) are self-organizing on a Reddit-like site for AIs, discussing various topics, e.g. even how to speak privately.” British programmer Simon Willison described Moltbook as “the most interesting place on the internet right now” in ablog post on Friday. On the platform, AI agents share information on topics ranging from automating Android phones via",
      "excerpt": "The viral personal AI assistant formerly known as Clawdbot has a new name — again. After a legal challenge from Claude’s maker, Anthropic, it had briefly rebranded as Moltbot, but has now settled on OpenClaw as its new name. The latest name change wasn’t prompted by Anthropic, which declined to comm",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "A peek inside Physical Intelligence, the startup building Silicon Valley’s buzziest robot brains",
      "link": "https://techcrunch.com/2026/01/30/physical-intelligence-stripe-veteran-lachy-grooms-latest-bet-is-building-silicon-valleys-buzziest-robot-brains/",
      "author": "Connie Loizos",
      "date": "2026-01-30T16:09:54-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/IMG_4026.jpeg?resize=1200,900",
      "category": "AI",
      "content": "From the street, the only indication I’ve found Physical Intelligence’s headquarters in San Francisco is a pi symbol that’s a slightly different color than the rest of the door. When I walk in, I’m immediately confronted with activity. There’s no reception desk, no gleaming logo in fluorescent lights. Inside, the space is a giant concrete box made slightly less austere by a haphazard sprawl of long blonde-wood tables. Some are clearly meant for lunch, dotted with Girl Scout cookie boxes, jars of Vegemite (someone here is Australian), and small wire baskets stuffed with one too many condiments. The rest of the tables tell a different story entirely. Many more of them are laden with monitors, spare robotics parts, tangles of black wire, and fully assembled robotic arms in various states of attempting to master the mundane. During my visit, one arm is folding a pair of black pants, or trying to. It’s not going well. Another is attempting to turn a shirt inside out with the kind of determination that suggests it will eventually succeed, just not today. A third — this one seems to have found its calling — is quickly peeling a zucchini, after which it is supposed to deposit the shavings into a separate container. The shavings are going well, at least. “Think of it like ChatGPT, but for robots,” Sergey Levine tells me, gesturing toward the motorized ballet unfolding across the room. Levine, an associate professor at UC Berkeley and one of Physical Intelligence’s co-founders, has the amiable, bespectacled demeanor of someone who has spent considerable time explaining complex concepts to people who don’t immediately grasp them. What I’m watching, he explains, is the testing phase of a continuous loop: data gets collected on robot stations here and at other locations — warehouses, homes, wherever the team can set up shop — and that data trains general-purpose robotic foundation models. When researchers train a new model, it comes back to stations like these for evaluation. Th",
      "excerpt": "From the street, the only indication I’ve found Physical Intelligence’s headquarters in San Francisco is a pi symbol that’s a slightly different color than the rest of the door. When I walk in, I’m immediately confronted with activity. There’s no reception desk, no gleaming logo in fluorescent light",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Ring brings its ‘Search Party’ feature for finding lost dogs to non-Ring camera owners",
      "link": "https://techcrunch.com/2026/02/02/ring-brings-its-search-party-feature-for-finding-lost-dogs-to-non-ring-camera-owners/",
      "author": "Sarah Perez",
      "date": "2026-02-02T07:33:45-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/ring-search-party-hero-lt-0129hero-1.jpg?resize=1200,675",
      "category": "Hardware",
      "content": "Ring’s AI-powered “Search Party” feature, which leverages the company’s network of cameras to find lost dogs, is nowavailable to allRing customers in the U.S. For the first time, the feature will be made available to those who don’t own a Ring camera, too. Launched last fall, Search Party uses AI to findpossible matchesfor lost dogs across neighbors’ camera footage. When a neighbor reports a lost dog in the Ring app, nearby outdoor cameras use AI to scan for possible matches. If a match is found, that camera owner receives an alert and can optionally choose to share any related video clips with their neighbor who reported the pet missing. They’ll also have an option to call the owner or send them a message, without sharing their own phone number. Ring says the feature has been reuniting more than a dog per day since its launch. Previously, Search Party was only available to customers with a Ring camera installed. The company is now making Search Party accessible to anyone through the Ring app. “Now, pet owners can mobilize the whole community—and communities are empowered to help—to find lost pets more effectively than ever before,” noted Ring founder Jamie Siminoff, in anannouncement. “That’s why we believe it’s so important to make this feature available to anyone who shares a lost dog post in Neighbors,” he added, referring to the company’s Neighbors app for Ring customers. Alongside the launch and expansion, Amazon-owned Ring said it’s committing $1 million to equip animal shelters with Ring camera systems, and aims to aid 4,000 U.S. shelters. By adding the shelters to Ring’s network, the company hopes more lost dogs will be reunited with their owners. The company already works with other non-profits, including Petco Love and Best Friends Animal Society, and is open to other partnerships.",
      "excerpt": "Ring’s AI-powered “Search Party” feature, which leverages the company’s network of cameras to find lost dogs, is nowavailable to allRing customers in the U.S. For the first time, the feature will be made available to those who don’t own a Ring camera, too. Launched last fall, Search Party uses AI to",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Carbon Robotics built an AI model that detects and identifies plants",
      "link": "https://techcrunch.com/2026/02/02/carbon-robotics-built-an-ai-model-that-detects-and-identifies-plants/",
      "author": "Rebecca Szkutak",
      "date": "2026-02-02T07:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/LaserWeeder-G2-Daytime-Spinach-Yuma-Aerial.jpg?resize=1200,675",
      "category": "Robotics",
      "content": "What is and isn’t a weed that needs to be eliminated in the field is determined by the eyes of the farmer — and now, increasingly, by a new AI model from Carbon Robotics. Seattle-basedCarbon Robotics, which builds the LaserWeeder — a robot fleet that uses lasers to kill weeds — announced a new AI model, the Large Plant Model (LPM), on Monday. This model recognizes plant species instantly and allows farmers to target new weeds without needing to retrain the robots. The LPM is trained on more than 150 million photos and data points collected by the company’s machines across the more than 100 farms in 15 countries where the robots currently operate. The model now powers Carbon AI, the AI system that serves as the brains inside the company’s autonomous weed-killing robots. Paul Mikesell, the founder and CEO of Carbon Robotics, told TechCrunch that prior to LPM, every time a new type of weed would show up on a farm — or even the same type of weed in different soil or with a slightly different appearance — the company would have to create new data labels to retrain its machines to recognize the plant. This process took about 24 hours each time, Mikesell said. Now, LPM can learn a new weed instantly, even if it’s never seen it before. “The farmer can live in real time and say, ‘Hey, this is a new weed. I want you to kill this,’ and that was something that had never been done before,” Mikesell said. “There’s no new labeling or retraining because the Large Plant Model understands, at a much deeper level, what it’s looking at and the type of plant.” Mikesell said that the company, which was founded in 2018, started developing this model shortly after it began shipping its first machines in 2022. Mikesell has years of experience building these types of neural networks from previous roles at Uber and working on Meta’s Oculus virtual reality headsets. This new model will reach the company’s existing systems through a software update. From there, farmers can tell the machine what",
      "excerpt": "What is and isn’t a weed that needs to be eliminated in the field is determined by the eyes of the farmer — and now, increasingly, by a new AI model from Carbon Robotics. Seattle-basedCarbon Robotics, which builds the LaserWeeder — a robot fleet that uses lasers to kill weeds — announced a new AI mo",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}