{
  "last_updated": "2026-02-19T17:54:00.804228+00:00",
  "articles": [
    {
      "title": "OpenAI deepens India push with Pine Labs fintech partnership",
      "link": "https://techcrunch.com/2026/02/18/openai-deepens-india-push-with-pine-labs-fintech-partnership/",
      "author": "Jagmeet Singh",
      "date": "2026-02-18T19:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-2170386424.jpg?w=1024",
      "category": "AI",
      "content": "As India pitches itself as a global hub for applied artificial intelligence, OpenAI has partnered with Pine Labs to integrate AI-driven reasoning into the fintech firm’s payments stack, automating settlement and invoicing workflows in a move the companies say could help accelerate AI-led commerce in India.\n\nThe partnership will see Pine Labs embed OpenAI’s application programming interfaces — software tools that let companies plug AI into their existing systems — within its payments and commerce infrastructure, the companies said on Thursday, all with the aim of enabling AI-assisted settlement, reconciliation, and invoicing workflows.\n\nThe deal underscores OpenAI’s broader push to expand its footprint in India,one of its fastest-growing markets, as it looks to move beyond being known primarily as the maker of ChatGPT and embed its technology into education, enterprise, and infrastructure. Earlier this week, OpenAI partnered with leading Indian engineering, medical, and design institutions tobring AI tools into higher education, betting that India’s large developer base and more than a billion internet users will play a central role in the next phase of AI adoption.\n\nPine Labs is already using AI internally to automate parts of its settlement and reconciliation process, cutting the time it takes to clear daily settlements from hours to minutes, according to Chief executive B Amrish Rau. The Noida-based company previously relied on manual checks by dozens of employees to process funds from multiple banks before markets opened each day, a workflow that is now largely handled by AI-driven systems, he said in an interview.\n\nFor Pine Labs, the partnership is intended to extend those AI-driven efficiencies beyond internal operations to merchants and corporate clients, starting with business-to-business use cases such as invoice processing, settlements and payments orchestration, Rau told TechCrunch. He noted the company sees faster adoption in B2B workflows, where AI agents can handle large volumes of repetitive financial tasks under predefined rules, before similar capabilities reach consumer-facing payments.\n\n“People talk about retail AI, but the bigger impact of all of this is really efficiency improvement, especially in B2B,” Rau said. “If you look at invoicing and settlement, those are workflows where agents can actually drive the process end to end, and that’s where adoption can happen faster.”\n\nThe rollout of more autonomous, agent-led payment workflows will move faster in overseas markets where regulations already allow such transactions, Rau said, while India is likely to see a more gradual adoption focused on AI-assisted commerce rather than fully agent-initiated payments. He said that Pine Labs is already prototyping agent-driven payments in parts of the Middle East and Southeast Asia, even as Indian regulations require tighter controls on how payments are authorized.\n\nFor OpenAI, the partnership offers a route deeper into India’s payments and enterprise ecosystem as it looks to move beyond consumer-facing tools and embed its models into high-volume, regulated workflows. Rau said the collaboration is aimed at increasing merchant stickiness and expanding Pine Labs’ role from a payments processor to a broader commerce platform, with higher transaction volumes over time translating into incremental revenue.\n\nPine Labs says itworks with more than 980,000 merchants, 716 consumer brands, and 177 financial institutions, and has processed over 6 billion cumulative transactions valued at over ₹11.4 trillion (about $126 billion), per its prospectus published last year. The fintech operates across 20 countries, including Malaysia, Singapore, Australia, parts of Africa, the UAE, and the U.S., giving the OpenAI partnership reach across both Indian and international markets.\n\nRau said the partnership does not involve revenue sharing between the two companies, with Pine Labs not taking a cut if its merchants choose to embed OpenAI’s tools. “We’ve kept it completely independent of each other — anything related to payment and payment services, we will get the benefit of it, and anything related to OpenAI revenues will go to them,” he said.\n\nThe arrangement, Rau added, is also non-exclusive. He compared it to OpenAI’s partnership with Stripe in the U.S. and said Pine Labs remains open to working with other AI providers.\n\nRau said Pine Labs is building additional security and compliance layers around AI-driven workflows to ensure that sensitive merchant and consumer transaction data remains protected, as the company integrates AI more deeply into its payments systems. He said the focus is on ensuring transactions remain secure and compliant even as more workflows are automated by AI.\n\nPine Labs’ interest in AI-driven commerce builds on earlier work through its Setu unit, which hasexperimented with agent-led bill payment experiencesusing chatbots including ChatGPT and Anthropic’s Claude. Separately, India also began pilotingconsumer payments directly through AI chatbotslast year.\n\nThe new announcement comes as India hosts itsAI Impact Summitin New Delhi, where global AI companies including OpenAI, Anthropic, and Google are showcasing their latest capabilities alongside Indian startups demonstrating AI applications aimed at large-scale deployment across sectors such as finance, healthcare, and education.",
      "excerpt": "As India pitches itself as a global hub for applied artificial intelligence, OpenAI has partnered with Pine Labs to integrate AI-driven reasoning into the fintech firm’s payments stack, automating settlement and invoicing workflows in a move the companies say could help accelerate AI-led commerce in",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Etsy sells secondhand clothing marketplace Depop to eBay for $1.2B",
      "link": "https://techcrunch.com/2026/02/18/etsy-sells-secondhand-clothing-marketplace-depop-to-ebay-for-1-2b/",
      "author": "Aisha Malik",
      "date": "2026-02-18T14:55:41-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2023/03/GettyImages-1240165689.jpg?resize=1200,800",
      "category": "Commerce",
      "content": "Etsy is selling Depop, a secondhand clothing app popular with Gen Z and millennials, to eBay for $1.2 billion in cash, the companyannouncedon Wednesday. Etsy says the deal will allow it to focus on its own marketplace.\n\nThe deal comes nearly five years afterEtsy acquired Depopfor $1.62 billion, at a time when secondhand clothing apps weregaining in popularity.\n\nFounded in 2011, Depop generated approximately $1 billion in gross merchandise sales — the total value of goods sold through its platform — in 2025. In the U.S., the company saw nearly 60% year-over-year growth. As of December 31, 2025, the marketplace had seven million active buyers, nearly 90% of whom were under 34, and more than three million active sellers.\n\n“Depop has built a trusted, social-forward marketplace with strong momentum in the pre-loved fashion category, and we are confident that as part of eBay, Depop will be even more well-positioned for long-term growth, benefiting from our scale, complementary offerings, and operational capabilities,” said eBay CEO Jamie Iannone in thepress release.\n\nThe move comes as Etsy has struggled to grow its business after the pandemic-era e-commerce boom, competing with marketplaces like Temu and Shein, as well as Amazon.\n\nThe company’s year-over-year revenue grew 2.2% in 2024, down from 7.1% growth reported in 2023. Etsy is scheduled to release its 2025 earnings on Thursday.\n\n“We are excited that this transaction allows us to focus exclusively on the compelling opportunity we see in front of us: to grow the Etsy marketplace in ways that matter most to our buyers and sellers,” said Etsy CEO Kruti Patel Goyal in the press release. “We are proud of what the Depop team has built – a truly differentiated brand and product, grounded in clear purpose and strong community – becoming one of the fastest-growing fashion resale marketplaces in the U.S. I am confident that Depop is well-positioned for its next phase of growth as part of eBay.”\n\nThe sale is the latest in a pattern of Etsy acquiring and then divesting niche online marketplaces. Etsy’s sale of Depop comes as the company has purchased and then sold other niche online marketplaces in recent years, including Brazilian e-commerce company Elo7 and musical instrument marketplace Reverb.\n\nThe deal is expected to close in the second quarter of this year.",
      "excerpt": "Etsy is selling Depop, a secondhand clothing app popular with Gen Z and millennials, to eBay for $1.2 billion in cash, the companyannouncedon Wednesday. Etsy says the deal will allow it to focus on its own marketplace.\n\nThe deal comes nearly five years afterEtsy acquired Depopfor $1.62 billion, at a",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "A startup called Germ becomes the first private messenger that launches directly from Bluesky’s app",
      "link": "https://techcrunch.com/2026/02/18/a-startup-called-germ-becomes-the-first-private-messenger-that-launches-directly-from-blueskys-app/",
      "author": "Sarah Perez",
      "date": "2026-02-18T12:57:48-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Drop-In_PR_Horizontal.png?w=1200",
      "category": "Startups",
      "content": "Here’s something that you’ve never seen on Big Tech social platforms: The decentralized open social network Bluesky has integrated new technology from a startup calledGerm Networkin order to bring end-to-end encrypted (E2E) messaging to the Bluesky app. The move makes Germ DM the first private messenger that can be launched natively within the Bluesky app.\n\nAlongside the launch, Germ is also releasingnew guidancethat would allow other apps built on the underlying AT Protocol that powers Bluesky to do the same thing.\n\nThe move is a notable example of how open social networking ecosystems work differently from the Big Tech platforms that dominate the space today, as new functionality and features can be developed by the community, not just by the company itself.\n\nBlueskyannouncedthe integration with Germ earlier this month, noting that the experimental integration will allow Germ users to add a button to their profile so others can message them on Bluesky in an E2E encrypted environment.\n\nMeanwhile, Germ’s standalone app is also available in a public beta on iOS in North America and Europe. That app had seen thousands of downloads so far, but after the official integration announcement, daily active users jumped by 5x, the team said.\n\nCalifornia-based Germ is a startup founded byTessa Brown, a communications scholar who previously taught at Stanford, andMark Xue, who worked as a privacy engineer at Apple on technologies like FaceTime and iMessage. The idea, the company previously explained to TechCrunch, was to offer an alternative to other E2E encrypted platforms like iMessage, Signal, and WhatsApp that’s built on newer technologies.\n\nToday, Germ takes advantage of Messaging Layer Security (MLS), a new standard approved by theInternet Engineering Task Force(IETF), and theAT Protocol(or ATProto), which powers Bluesky, Skylight, and a growing number of other social apps.\n\nInstead of requiring a user’s phone number, Germ integrates with ATProto to enable its encrypted chats. That means Germ’s messages cannot be decrypted by another service, including itself or Bluesky.\n\nTo use the new messenger, you’ll simply click on the badge on a friend’s profile on Bluesky, which opens an iOS App Clip — a lightweight, temporary app. You click “open” on this app experience and then authenticate by logging in with your ATProto handle. You can then send a message to a friend immediately. You’ll also be nudged to download the full Germ DM app, but this is optional.\n\nIf you want to add the badge to your own profile, you’ll download the Germ DM app on iOS and authenticate your Bluesky credentials there. (Note: We had to force-quit the Bluesky iOS app and restart it before the Germ badge appeared.)\n\nThe company has been building up to the official Bluesky integration for many months, starting with a private beta in August, which was launched using “magic links” shared in users’ bios. Now, users who set up Germ to work within Bluesky will receive a new badge that’s displayed on their profiles, allowing them to remove the link-in-bio option they were using before. (The links will still work, but the badge is easier and more noticeable, of course.)\n\nGerm told TechCrunch their startup has been in conversation with the ATProto developer community, including Bluesky’s app and protocol teams, since theATmosphere Conference in Seattlelast year.\n\n“We’ve been transparent about our planning and roadmap, and shipping our private beta in August generated valuable feedback from users and developers about the desire to replace our links in bios with native UI,” said Xue, who serves as CTO at Germ Network. “Both our team and Bluesky’s saw value in better AppView support for the Germ link.”\n\nThe changes to Bluesky’s app were led by head of product Alex Benzer, as the company waslooked to experimentwith implementing third-party services within Bluesky.\n\n“Working directly with the Bluesky team has been a treat,” Brown, Germ’s CEO, told TechCrunch. “They ship fast, prioritize the user experience, and care about their users’ access to end-to-end encrypted messaging. We’re thrilled to be the first secure messenger they’ve brought natively into their app.”\n\nWhile it’s true that the AT Protocol could eventually implement E2E encryption, that is not a focus today. As Bluesky protocol engineer Daniel Holms recently explained, the company has several reasons not to design a system itself.\n\n“The reality is that E2EE is hard,” hewrote in a blog post. “And this inherent complexity isn’t something that the protocol team at Bluesky can just handle – it gets pushed out to every dev trying to build a client that works with encrypted data,” Holms said.\n\nXue agreed, adding, “We align with the ATProto ethos that people should be able to communicate using the apps and tools they choose. We believe that by solving the hard problems for ATProto users in safe, transparent, and user-friendly ways, they’ll continue to choose us,” he said.\n\nShortly after Bluesky added support for the Germ badge, anotherAT Protocol-based client, Blacksky, did as well.\n\nBrown noted the team is currently focused on shipping more everyday messaging features, not on monetization. But further down the road, Germ may test paid features.\n\n“We expect that our first paid features will be centered on the needs of prosumer power users like creators, journalists, and politicians—for example, support for multiple handles and private AI-powered screening for first messages from new connections,” she said.",
      "excerpt": "Here’s something that you’ve never seen on Big Tech social platforms: The decentralized open social network Bluesky has integrated new technology from a startup calledGerm Networkin order to bring end-to-end encrypted (E2E) messaging to the Bluesky app. The move makes Germ DM the first private messe",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Hacking conference Def Con bans three people linked to Epstein",
      "link": "https://techcrunch.com/2026/02/18/hacking-conference-def-con-bans-three-people-linked-to-epstein/",
      "author": "Lorenzo Franceschi-Bicchierai",
      "date": "2026-02-18T14:04:13-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/def-con-conference-2025.jpg?w=999",
      "category": "Security",
      "content": "Def Con, one of the largest and longest-running hacking conferences in the world, announced on Wednesday that three people linked to Jeffrey Epstein are no longer allowed to attend.\n\nThe conference justified adding Pablos Holman, Vincenzo Iozzo, and Joichi Ito to its public list ofbanned individuals, citing the three as appearing in the Department of Justice’s latest release of files related to its investigation of the late investor and convicted sex offender. Def Con also citedan article in Politicobased on emails that the three exchanged with Epstein.\n\nJoan Vollero, a spokesperson for Iozzo, told TechCrunch in a statement that Def Con’s actions are “entirely performative, given that Mr. Iozzo has barely attended the conference in the past twenty years.”\n\n“It was a rush to judgment not based on any investigation or wrongdoing by Mr. Iozzo,” the spokesperson said.\n\nA Def Con spokesperson declined to comment.\n\nHolman and Ito did not immediately respond to TechCrunch’s request for comment.\n\nThe move to ban the three comes days after TechCrunch reported that cybersecurity conferences Black Hat and Code Blueremoved Iozzo from their official review board pages, amid new and emerging revelations linking the prominent hacker, among others, to Epstein.\n\nContact UsDo you have more information about Epstein’s connections in the cybersecurity world?? From a non-work device, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram, Keybase and Wire @lorenzofb, orby email.\n\nIozzo is a veteran of the cybersecurity industry who is currently the founder and chief executive of identity startup SlashID. He previously served as a director at CrowdStrike after the security giant acquired his cybersecurity startup IperLane in 2017. AsTechCrunch previously reported, Iozzo interacted with Epstein between 2014 and 2018, including after the Miami Heraldreportednew allegationsthat Epstein had abused dozens of women and children.\n\nEpsteinpleaded guiltyin 2008 to soliciting sex from girls and registered as a sex offender in New York and Florida. In 2019, the Department of JusticeaccusedEpstein of trafficking, exploiting, and abusing dozens of underage girls. Epsteindiedin jail.\n\nIozzo previously told TechCrunch that his interactions with Epstein were “limited to business opportunities that never materialized, as well as discussion of the markets and emerging technologies,” and that he “never observed nor participated in any illegal activity or behavior.”\n\nPrior to his startups, Iozzo was a research affiliate at MIT Media Lab, which was overseen by Ito at the time. The two appear in several Epstein emails together.\n\nJoichi Ito was the director of the MIT Media Lab until 2019, whenhe resignedafter it was reported that he was aware that Epstein was a convicted sex offender and that he and the university had extensive personal and financial relationships with Epstein.\n\nHolman, meanwhile, is the general partner at venture capital firm Deep Future and describes himself on his website as “a hacker, inventor & technology futurist.”\n\nHolman was in contact with Epstein since 2010,planned to stayat one of his apartments in New York City in 2013, andtried to helpEpstein hide negative online news stories about himself.\n\nAccording to an email, Epstein made plans to attend Def Con along with Holman in 2013, but it’s unclear if they attended. Def Con founder Jeff Mosssaidthat as far as he knows, “Epstein never attended.”\n\nThis story was updated to include Def Con’s no comment.",
      "excerpt": "Def Con, one of the largest and longest-running hacking conferences in the world, announced on Wednesday that three people linked to Jeffrey Epstein are no longer allowed to attend.\n\nThe conference justified adding Pablos Holman, Vincenzo Iozzo, and Joichi Ito to its public list ofbanned individuals",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "SeatGeek and Spotify team up to offer concert ticket sales inside the music platform",
      "link": "https://techcrunch.com/2026/02/18/seatgeek-and-spotify-team-up-to-offer-concert-ticket-sales-inside-the-music-platform/",
      "author": "Lauren Forristal",
      "date": "2026-02-18T11:07:40-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2016/07/smartphone_concert.jpg?resize=1200,900",
      "category": "Apps",
      "content": "SeatGeekannouncedon Wednesday a new integration with Spotify, bringing a seamless ticket-buying experience for Spotify users.\n\nNow when Spotify users browse an artist’s page or upcoming tour dates, they will see ticket links powered by SeatGeek for concerts at these participating venues, allowing for a streamlined purchase process.\n\nCurrently, the integration is available for a select group of venues where SeatGeek serves as the primary ticket seller. Specifically, it covers SeatGeek’s 15 major U.S. venue partners, including State Farm Stadium in Glendale, Nissan Stadium in Nashville, and AT&T Stadium in Arlington. (So, although SeatGeek is a major player in the secondary ticketing space, this integration is exclusive to venues where it operates as the primary ticketing platform.)\n\nThis is a strategic win for SeatGeek. With direct placement in the Spotify app, SeatGeek is positioned to reach millions of active music fans as they discover upcoming events, increasing the chances of converting listeners into ticket buyers.\n\nAlthough SeatGeek has made significant strides in the space, it continues to face competition from heavyweights Ticketmaster and AXS.\n\nThese rivals command a greater share of the ticketing market, bolstered by long-term contracts with many top venues and event organizers. It’sestimatedthat Ticketmaster alone services 53 of the top 68 U.S. arenas. Even Barclays Center, which switched from Ticketmaster to SeatGeek in 2021,quickly reversed courseless than a year into a seven-year agreement and ended the deal to return to Ticketmaster.\n\nNotably, the latest partnership follows Spotify’sannouncementthat it has helped artists generate over $1 billion in ticket sales by linking fans with live events through its ticketing partners. The company works with more than 45ticketing partners, including Ticketmaster, AXS, Eventbrite, DICE, and Bandsintown.\n\nSpotify previously experimented withdirect ticket salesin 2022.\n\nThis also isn’t SeatGeek’s first time teaming up with a popular app. The companypartnered with Snapchatin 2018, allowing users to buy tickets directly within the social app.\n\nSeparately, Spotify’s latest earnings call occurred last week, where the company reported having more than750 million monthly usersand 290 million paid subscribers. Spotify projects these numbers will rise to 759 million users and 293 million paid subscribers in the current quarter, highlighting its continued focus on profitability.",
      "excerpt": "SeatGeekannouncedon Wednesday a new integration with Spotify, bringing a seamless ticket-buying experience for Spotify users.\n\nNow when Spotify users browse an artist’s page or upcoming tour dates, they will see ticket links powered by SeatGeek for concerts at these participating venues, allowing fo",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Amazon halts Blue Jay robotics project after less than 6 months",
      "link": "https://techcrunch.com/2026/02/18/amazon-halts-blue-jay-robotics-project-after-less-than-six-months/",
      "author": "Rebecca Szkutak",
      "date": "2026-02-18T10:27:10-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/08/about-amazon-hero-20230227-amazon-288.jpg?resize=1200,675",
      "category": "Robotics",
      "content": "Amazon has hundreds of thousands of robots in its warehouses, but that doesn’t mean all of its robotic initiatives are a success story.\n\nThe e-commerce giant has halted its Blue Jay warehouse robotics project just months after unveiling the tech, as originallyreported by Business Insiderand confirmed by TechCrunch.\n\nBlue Jay, a multi-armed robot designed to sort and move packages, was unveiled in October for use in the company’s same-day delivery facilities. At the time, the company was testing the robots at a facility in South Carolina and said it took Amazonsignificantly less time to develop Blue Jay— only about a year— than it did to develop its other warehouse robots, a speed the company credited to advancements in AI.\n\nAmazon spokesperson Terrence Clark told TechCrunch that Blue Jay was launched as a prototype — although that was not made clear in the company’s original press release.\n\nThe company plans to use Blue Jay’s core technology for other robotics “manipulation programs” with employees who worked on Blue Jay being moved to other projects.\n\n“We’re always experimenting with new ways to improve the customer experience and make work safer, more efficient, and more engaging for our employees,” Clark told TechCrunch over email. “In this case, we’re actually accelerating the use of the underlying technology developed for Blue Jay, and nearly all of the technologies are being carried over and will continue to support employees across our network.”\n\nAmazon also unveiled the Vulcan robot last year, which is used in the storage compartments of the company’s warehouses.Vulcan is a two-armed robot, with one arm meant to rearrange and move items in a compartment while the other is equipped with a camera and suction cups to grab goods. The Vulcan can allegedly “feel” the objects that it touches and was trained on data gathered from real-world interactions.\n\nAmazon has been developing its internal robotics program since 2012 when it purchased Kiva Systems, a robotics company whose warehouse automation technology formed the foundation of Amazon’s fulfillment operations. It surpassed1 million robots in its warehouseslast July.",
      "excerpt": "Amazon has hundreds of thousands of robots in its warehouses, but that doesn’t mean all of its robotic initiatives are a success story.\n\nThe e-commerce giant has halted its Blue Jay warehouse robotics project just months after unveiling the tech, as originallyreported by Business Insiderand confirme",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "OpenAI pushes into higher education as India seeks to scale AI skills",
      "link": "https://techcrunch.com/2026/02/18/openai-pushes-into-higher-education-as-india-seeks-to-scale-ai-skills/",
      "author": "Jagmeet Singh",
      "date": "2026-02-18T06:32:42-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/08/openai-india.jpg?resize=1200,800",
      "category": "AI",
      "content": "OpenAI is expanding its footprint in India and moving into the country’s higher-education system through partnerships with leading academic institutions. The move comes as the South Asian nation seeks to scale AI skills and build domestic capacity in one of the world’s largest talent markets.\n\nOn Wednesday, OpenAI said it was partnering with six public and private higher-education institutions in India, including top engineering, management, medical, and design-focused institutes, with the aim of reaching more than 100,000 students, faculty, and staff over the next year.\n\nRather than focusing on consumer use, the initiative centers on integrating AI into core academic functions, signaling OpenAI’s interest in influencing how AI is taught, governed, and normalized within one of the world’s largest higher-education systems.\n\nOpenAI has already built a large consumer audience for its ChatGPT chatbot, which has over100 million monthly active usersin India, according to CEO Sam Altman, and India has emerged as the company’s second-largest user base after the U.S. The announcement also coincides with a broader push by leading AI firms to deepen their presence in India, which is hosting anAI Impact Summitin New Delhi this week.\n\nThe first cohort of partners includes some of India’s most influential academic institutions, such as the Indian Institute of Technology Delhi, the Indian Institute of Management Ahmedabad, and the All India Institute of Medical Sciences New Delhi, alongside private universities and specialized design schools. The ChatGPT maker said the partnerships would span disciplines ranging from engineering and management to healthcare and creative fields.\n\nIndia has already emerged as a key testing ground for AI use in education. Last month, Google said India accounts for thehighest global usage of its Gemini tools for learning. Microsoft, similarly, said this week it wouldexpand its Elevate skilling programin India to train teachers across schools, vocational institutes, and higher-education settings, working with government agencies as part of a broader push to build AI skills at scale.\n\nOpenAI said the partnerships would involve campus-wide access to its ChatGPT Edu tools, faculty training, and responsible-use frameworks. The focus, the company said, is on embedding AI into core academic workflows such as coding, research, analytics, and case analysis, rather than offering standalone access to tools.\n\nTwo of the partner institutions, the Indian Institute of Management Ahmedabad and Manipal Academy of Higher Education, will also introduce OpenAI-backed certifications. Additionally, OpenAI said it would work with Indian ed-tech platforms, including Physics Wallah, upGrad, and HCL GUVI, to extend AI training beyond campuses. These platforms will launch structured courses on AI fundamentals and ChatGPT use cases, aimed at students and early-career professionals.\n\nRaghav Gupta, head of education at OpenAI India, said educational institutions were a “critical route” to closing the gap between rapidly advancing AI tools and how people are actually using them, as skills demands shift across the economy.\n\nLast year, OpenAI hired Gupta, a former Coursera Asia-Pacific managing director, as its India and Asia-Pacific head of education, alongside the launch of a Learning Accelerator program focused on expanding AI skills.\n\nThe flurry of moves into education underscores how AI companies are increasingly looking beyond consumer tools and corporate clients toward institutions that shape skills, norms, and long-term adoption. For countries like India, the contest is not just around access to AI, but also about who helps define how it is taught, governed, and embedded at scale.",
      "excerpt": "OpenAI is expanding its footprint in India and moving into the country’s higher-education system through partnerships with leading academic institutions. The move comes as the South Asian nation seeks to scale AI skills and build domestic capacity in one of the world’s largest talent markets.\n\nOn We",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "World Labs lands $1B, with $200M from Autodesk, to bring world models into 3D workflows",
      "link": "https://techcrunch.com/2026/02/18/world-labs-lands-200m-from-autodesk-to-bring-world-models-into-3d-workflows/",
      "author": "Rebecca Bellan",
      "date": "2026-02-18T10:07:16-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/11/Untitled-design.png?resize=1200,764",
      "category": "AI",
      "content": "Fei-Fei Li’s World Labs has secured a $200 million investment from software design giant Autodesk as part of alarger $1 billion roundfrom backers, including AMD, Emerson Collective, Fidelity, Nvidia, and others.\n\nWorld Labs, which emerged fromstealth in 2024 with $230 millionat a $1 billion valuation, declined to say whether the latest round boosted its valuation. However,reportsa month ago suggested it was aiming to raise at a $5 billion valuation.\n\nThe partnership between World Labs and Autodesk will see the two companies collaborating to explore how World Labs’ models — AI systems that can generate and reason about immersive 3D environments — can work alongside Autodesk’s tools, and vice versa, starting with a focus on entertainment use cases.\n\nFor World Labs, Autodesk’s investment is a signal that its product has commercial appeal. The startup’s first world model product,Marble, released last November, lets users create editable, downloadable 3D environments.\n\nAutodesk is one of the biggest developers of 3D CAD (computer-aided design) software. Its platform underpins architectural, engineering, construction, manufacturing, and entertainment workflows. That focus on the built world makes investment in advanced spatial AI a natural extension of its core business.\n\nOr as Li put it in a statement: “Autodesk has long helped people think spatially and solve real-world problems and, together, we share a clear purpose: building physical AI that augments human creativity and puts more powerful tools in the hands of designers, builders, and creators.”\n\nAs part of the deal, Autodesk will serve as an adviser to World Labs, and the two will collaborate at the “research and model level.”\n\nDaron Green, Autodesk’s chief scientist, told TechCrunch the partnership is still in its early days, so the precise form it’s going to take hasn’t been determined yet.\n\n“You could anticipate us consuming their models or them consuming our models in different settings,” Green said.\n\nHe mused that customers might like to start with a world-model-based sketch in World Labs (say, of an office layout) and then drill down on certain design aspects (like the design of the desk), which is where Autodesk’s tech might come in.\n\n“Similarly, you might want to take an object that you’ve designed in our [platform], and put it in a context that you create through one of [World Labs’] prompts,” Green said.\n\nGreen added that data sharing is not part of the agreement.\n\nGreen said the two companies plan to start with media and entertainment use cases. Most companies building world models — includingGoogle DeepMindandRunway— see gaming and interactive entertainment as an initial go-to-market strategy.\n\nAutodesk already works with most major media production companies and has been training models for character animation.\n\n“These are close to world models,” Green said. “They’re a characterization of an animal in the world that’s responding to physical constraints like time, maybe a terrain it needs to traverse. So there’s a physical understanding in the model, and you can see how that might be combined [with World Labs’ tech]. You’re not just animating the dog, but you’re giving it a world within which it can now interact.”\n\nThe partnership with World Labs supports Autodesk’s broader push to integrate more AI features across its software portfolio. The company is developing“neural CAD,”a new kind of generative AI model trained on geometric data that can reason about components and entire systems. Put simply, it can generate working 3D models, not just images, with an understanding of how those designs would function in the real world.\n\nAutodesk’s neural CAD models are already being integrated into the firm’s product design and architecture products as a step toward more advanced spatial intelligence. But World Labs’ models could help extend that capability beyond individual design files toward more holistic digital representations of the physical world.\n\nGreen thinks different AI systems, including large language models, world models, and neural CAD will be combined in the future to improve designs for Autodesk’s customers.\n\n“If AI is to be truly useful, it must understand worlds, not just words,” Li said in the statement. “Worlds are governed by geometry, physics, and dynamics, and reconciling the semantic, spatial, and physical is the next great frontier of AI.”\n\nThis article has been updated to include more details on World Labs’ raise.",
      "excerpt": "Fei-Fei Li’s World Labs has secured a $200 million investment from software design giant Autodesk as part of alarger $1 billion roundfrom backers, including AMD, Emerson Collective, Fidelity, Nvidia, and others.\n\nWorld Labs, which emerged fromstealth in 2024 with $230 millionat a $1 billion valuatio",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Meta is shutting down Messenger’s standalone website",
      "link": "https://techcrunch.com/2026/02/19/meta-is-shutting-down-messengers-standalone-website/",
      "author": "Aisha Malik",
      "date": "2026-02-19T09:01:29-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2233007024.jpg?resize=1200,800",
      "category": "Social",
      "content": "Meta is shutting down its standalone Messenger website, the company shared in ahelp page. Starting April 2026, the website will no longer be available. If users still want to send and receive messages on the web, they can do so while logged into Facebook.\n\n“After messenger.com goes away, you will be automatically redirected to usefacebook.com/messagesfor messaging on a computer,” the help page reads. “You can continue your conversations there or on the Messenger mobile app.”\n\nIf you use Messenger without a Facebook account, then you’ll only be able to continue your conversations on the Messenger mobile app. Users can restore their chat history on any platform using the PIN they entered when they first created a backup on Messenger. If you can’t remember your PIN, you can reset it.\n\nThe move comes a few months afterMeta shut down Messenger’s stand-alone desktop appsfor Windows and Mac. The writing may have been on the wall at the time, as Meta had been redirecting existing desktop app users to the Facebook website to continue using the messaging service, rather than the Messenger website.\n\nThe change was first spotted by reverse engineerAlessandro Paluzzi. Meta is notifying users of the update via a pop-up message on the Messenger website and app.\n\nUsers have taken to social media toexpress their frustrationwith the update, withmany sayingthey don’t want to rely on the Facebook website to send and receive Messenger chats on the web, especially those who have deactivated their Facebook accounts.\n\nWhile Meta’s decision to shut down various Messenger platforms is frustrating for users, it allows the tech giant to reduce costs by leaving it with fewer platforms to maintain.\n\nMessenger first launched as “Facebook Chat” back in 2008, and Facebook (now Meta) launched Facebook Messenger as a standalone app in 2011. Over the years, the tech giant positioned Messenger as its own service outside of Facebook, and in 2014, the social network removed messaging capabilities from its main mobile app to push people to the Messenger app. However, the company reversed this in 2023 when it beganmerging Messengerback into the Facebook app.\n\nMeta did not immediately respond to a request for comment.",
      "excerpt": "Meta is shutting down its standalone Messenger website, the company shared in ahelp page. Starting April 2026, the website will no longer be available. If users still want to send and receive messages on the web, they can do so while logged into Facebook.\n\n“After messenger.com goes away, you will be",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "New York hits the brakes on robotaxi expansion plan",
      "link": "https://techcrunch.com/2026/02/19/new-york-hits-the-brakes-on-robotaxi-expansion-plan/",
      "author": "Kirsten Korosec",
      "date": "2026-02-19T08:53:05-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/09/waymo-robotaxi-fifth-gen.jpg?resize=1200,800",
      "category": "Transportation",
      "content": "Waymo’s big chance to bring its robotaxis to the state of New York has been thwarted — for now.\n\nNew York Governor Kathy Hochul withdrew a proposal that would have amended vehicle and traffic laws to effectively legalize robotaxis in the state outside of New York City. Hochul spokesperson Sean Butler confirmed to TechCrunch that the proposal has been pulled.\n\n“Based on conversations with stakeholders, including in the legislature, it was clear that the support was not there to advance this proposal,” Butler said in an emailed statement. Bloomberg was thefirst to reportthe proposal had been removed.\n\nThe withdrawal is a setback for Waymo which has tried for years — along with other autonomous vehicle (AV) companies — to test and eventually deploy robotaxis in New York.\n\n“We hear from thousands of New Yorkers who have experienced Waymo in other cities and want access to it at home,” Waymo said in a statement emailed to TechCrunch.\n\n“They want the safety, privacy, and comfort that riders in other major cities already enjoy. While we are disappointed by the Governor’s decision, we’re committed to bringing our service to New York and will work with the State Legislature to advance this issue.”\n\n“The path forward requires a collaborative approach that prioritizes transparency and public safety. We will continue to engage constructively with the Governor, the Legislature, and officials around the state to deliver this proven mobility option that New Yorkers are waiting for,” added Waymo’s statement.\n\nHochul had introduced, as part of herbroader budget proposal, a plan to change a state law that mandates drivers keep one hand on the wheel at all times. That law essentially prevents robotaxi companies like Waymo from operating in the state since no human is behind the wheel — if there is a steering wheel at all.\n\nEven if Hochul’s proposal had survived, it would not have opened the floodgates to AV companies. The proposal contained a number of limitations, including that AV companies could not deploy for-hire robotaxi services in any city with more than a million people. AV companies would also need approval from the state’s transportation commissioner, pay a $1 million fee, and show proof of financial security of at least $5 million. The state would have only backed robotaxi pilots in cities or townships where there was a clear demonstration of local support, Butler said.\n\nWith that proposal dead, the state’s existing AV pilot program, which is far more restrictive, is expected to remain. Under the pilot program, companies can seek an exemption to the one-hand on the wheel rule, allowing them to develop and test autonomous vehicles in the state, but not launch commercial robotaxi services.\n\nWaymo is currently testing in New York City, and is allowed to do so through March 31.\n\nNew York City regulators granted a permit last August to Waymo to test its robotaxis in the city. Under that permit, Waymo is allowed to test up to eight of its Jaguar I-Pace vehicles in Manhattan and downtown Brooklyn, as long as there is a human safety operator behind the wheel.\n\nWaymo is active in numerous other states and operates commercial robotaxi services in Atlanta, Austin, Miami, Phoenix, Los Angeles and the San Francisco Bay Area. The company says it provides more than 400,000 paid rides every week and is targeting one million weekly rides by the end of the year.",
      "excerpt": "Waymo’s big chance to bring its robotaxis to the state of New York has been thwarted — for now.\n\nNew York Governor Kathy Hochul withdrew a proposal that would have amended vehicle and traffic laws to effectively legalize robotaxis in the state outside of New York City. Hochul spokesperson Sean Butle",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}