{
  "last_updated": "2026-02-14T16:34:26.231690+00:00",
  "articles": [
    {
      "title": "Airbnb says a third of its customer support is now handled by AI in the US and Canada",
      "link": "https://techcrunch.com/2026/02/13/airbnb-says-a-third-of-its-customer-support-is-now-handled-by-ai-in-the-u-s-and-canada/",
      "author": "Sarah Perez",
      "date": "2026-02-13T14:12:26-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/05/Airbnb-Summer-feat.jpg?resize=1200,675",
      "category": "AI",
      "content": "Airbnb says itscustom-built AI agentis now handling roughly a third of its customer support issues in North America, and it’s preparing to roll out the feature globally. If successful, the company believes that in a year’s time, more than 30% of its total customer support tickets will be handled by AI voice and chat in all the languages where it also employs a human customer service agent.\n\n“We think this is going to be massive because not only does this reduce the cost base of Airbnb customer service, but the quality of service is going to be a huge step change,” CEO Brian Chesky said during the company’sfourth-quarter earningscall this week. This seems to suggest he believes the AI would do a better job than its human counterparts in resolving some issues.\n\nThe company also touted its recent hire of CTO Ahmad Al-Dahle,poached from Metafor his AI expertise, and its plans to create an AI-native experience.\n\nWith his guidance, Chesky said that Airbnb was poised to introduce an app that doesn’t just search for you, but one that “knows you.”\n\n“It will help guests plan their entire trip, help hosts better run their businesses, and help the company operate more efficiently at scale,” Chesky explained, adding that’s why Airbnb brought Al-Dahle on board.\n\n“Ahmad is one of the world’s leading AI experts. He spent 16 years at Apple, and most recently led the generative AI team at Meta that built the Llama models. He’s an expert at pairing massive technical scale with world-class design, which is exactly how we’re going to transform the Airbnb experience,” Chesky noted.\n\nLike other businesses poised for disruption by AI, Airbnb’s leadership is pushing the idea that it has a unique database and product that other AI chatbots can’t replicate.\n\n“A chatbot doesn’t have our 200 million verified identities or our 500 million proprietary reviews, and it can’t message the hosts, which 90% of our guests do,” Chesky told analysts during the earnings call. Instead, he pitched the idea o",
      "excerpt": "Airbnb says itscustom-built AI agentis now handling roughly a third of its customer support issues in North America, and it’s preparing to roll out the feature globally. If successful, the company believes that in a year’s time, more than 30% of its total customer support tickets will be handled by ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Indian pharmacy chain giant exposed customer data and internal systems",
      "link": "https://techcrunch.com/2026/02/13/indias-major-pharmacy-chain-exposed-customer-data-and-internal-systems/",
      "author": "Jagmeet Singh",
      "date": "2026-02-13T19:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/medications-drugs-2237708773.jpg?resize=1200,795",
      "category": "Security",
      "content": "A security lapse by one of India’s largest pharmacy chains allowed outsiders to gain full administrative control of its platform, exposing customer order data and sensitive drug-control functions, TechCrunch has exclusively learned.\n\nThe issue affected DavaIndia Pharmacy, the pharmacy arm of Zota Healthcare, which operates a large network of retail outlets across India. Security researcher Eaton Zveare told TechCrunch that he discovered the flaw after identifying insecure “super admin” application programming interfaces on DavaIndia’s website and privately shared details with Indian cybersecurity authorities.\n\nThe bug is now fixed, and Zvearedisclosed his findings.\n\nThe exposure comes as Zota Healthcare rapidly scales DavaIndia Pharmacy’s retail business. The Gujarat-headquartered company operates more than 2,300 DavaIndia stores across India, including276 new outletsannounced in January, and plans toadd another 1,200 to 1,500over the next two years.\n\nZveare told TechCrunch that the flaw stemmed from insecure admin interfaces, which allowed unauthenticated users to create “super admin” accounts with high privileges.\n\nWith that level of access, an attacker could view thousands of online orders containing customer information, modify product listings and prices, create discount coupons, and change settings governing whether certain medicines required a prescription, the researcher said.\n\nBased on system timestamps, Zveare said the vulnerable administrative interfaces appeared to have been live since late 2024. The access exposed nearly 17,000 online orders and administrative controls spanning 883 stores, he said, allowing changes to product pricing, prescription requirements, and promotional discounts. Zveare said the access allowed edits to website content that could have been used for defacement or disruption.\n\nPharmacy order data can be particularly sensitive, as it may reveal information about a person’s health conditions, medications or other private purchases. E",
      "excerpt": "A security lapse by one of India’s largest pharmacy chains allowed outsiders to gain full administrative control of its platform, exposing customer order data and sensitive drug-control functions, TechCrunch has exclusively learned.\n\nThe issue affected DavaIndia Pharmacy, the pharmacy arm of Zota He",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "A Stanford grad student created an algorithm to help his classmates find love; now, Date Drop is the basis of his new startup",
      "link": "https://techcrunch.com/2026/02/13/a-stanford-grad-student-created-an-algorithm-to-help-his-classmates-find-love-now-date-drop-is-the-basis-of-his-new-startup/",
      "author": "Amanda Silberling",
      "date": "2026-02-13T08:24:53-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/headshot.jpg?resize=898,1200",
      "category": "Apps",
      "content": "As Valentine’s Day approaches at Stanford, some students may be gearing up for first dates — not with people they met on Tinder or Hinge, but with matches from a service calledDate Drop, designed by Stanford graduate student Henry Weng. Date Drop pairs students with potential dates once per week based on their responses to a questionnaire.\n\nA Stanford whiz kid is trying to disrupt an established industry from his Palo Alto dorm?Stop meifyou’ve heard thisonebefore! But young adults are deeplydisillusionedwith the frustrating, demoralizingstate of online dating. Why not try something different?\n\nOver 5,000 students at Stanford have given Date Drop a try since its launch in the fall. It has also rolled out at 10 more schools, including MIT, Princeton, and the University of Pennsylvania, and Weng says he wants to roll out Date Drop more broadly in some cities this summer.\n\n“Our matches convert to actual dates at about 10x the rate of Tinder,” Weng told TechCrunch. “Instead of swiping, we get to know each person deeply and send them one compatible match per week.”\n\nAt first, Weng didn’t intend to turn Date Drop into the foundation of a startup. Then, a close friend of his met their partner via Date Drop. “That was when I got the sense that this was less of a project,” he said.\n\nNow, Weng thinks of Date Drop as just the first service from his startup, TheRelationship Company, which is a public benefit corporation — a type of company legally required to consider social impact alongside profits.\n\n“This started as something I just wanted to exist on campus, and it became a company because people kept on asking for it in their schools and I needed resources to do that,” he said.\n\nAlready, Weng has raised “a few million” from some angel investors, including Zynga founder and early Facebook backer Mark Pincus, who has taught business courses at Stanford (including to Weng). Andy Chen, a former partner at Coatue, and Elad Gil, an early backer of Airbnb, Stripe, and Pinterest, al",
      "excerpt": "As Valentine’s Day approaches at Stanford, some students may be gearing up for first dates — not with people they met on Tinder or Hinge, but with matches from a service calledDate Drop, designed by Stanford graduate student Henry Weng. Date Drop pairs students with potential dates once per week bas",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "The SEC closed its investigation into Fisker",
      "link": "https://techcrunch.com/2026/02/13/the-sec-closed-its-investigation-into-fisker/",
      "author": "Sean O'Kane",
      "date": "2026-02-13T09:48:43-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/07/fisker-ocean-black.jpg?resize=1200,763",
      "category": "Transportation",
      "content": "The Securities and Exchange Commission closed its investigation into bankrupt electric vehicle startup Fisker  last September, roughlyone year after the probe was opened.\n\nTechCrunch learned the investigation was closed when the financial regulator responded to a Freedom of Information Act (FOIA) request in January. The SEC’s FOIA department said it had identified “approximately 21.7 gigabytes of electronically maintained records” related to the investigation. The agency doesn’t typically make records available if investigations are still open, and it explained in a follow-up email that it “was closed in September 2025.”\n\nIt’s not clear how far the investigation progressed. The SECrevealed the existence of the probein an October 2024 filing in Fisker’s bankruptcy case. The agency wrote at the time that it had sent subpoenas to the company and that it may need to “request or subpoena additional documents in the future relating to its ongoing investigation.”\n\nA spokesperson for the agency declined to comment. Founder and former CEO Henrik Fisker did not respond to a message seeking comment.\n\nThe closure of the Fisker investigation comes amid a significant drop in enforcement actions and settlements during President Trump’s second term. The SEC initiated 313 enforcement actions in 2025 — the lowest in a decade and down 27% from the the final year of President Biden’s term, according toan analysis by law firm Paul, Weiss. Only four of those enforcement actions were against public companies. Total monetary settlements fell 45% from 2024.\n\nFisker was one of the last remaining electric vehicle startups under investigation by the SEC. Over the last few years, the agency settled fraud or other charges brought againstNikola,Lordstown Motors,Canoo,Hyzon Motors, and others. In 2023, itclosed an investigationinto Lucid Motors without a lawsuit.\n\nThe only known active investigation remaining into an electric vehicle startup is the one related to Faraday Future, which is now nearl",
      "excerpt": "The Securities and Exchange Commission closed its investigation into bankrupt electric vehicle startup Fisker  last September, roughlyone year after the probe was opened.\n\nTechCrunch learned the investigation was closed when the financial regulator responded to a Freedom of Information Act (FOIA) re",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "India partners with Alibaba.com for export push despite past China tech bans",
      "link": "https://techcrunch.com/2026/02/13/india-partners-with-alibaba-com-for-export-push-despite-past-china-tech-bans/",
      "author": "Jagmeet Singh",
      "date": "2026-02-13T09:32:59-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/alibaba-com-jagmeet-singh-techcrunch.jpg?resize=1200,800",
      "category": "Government & Policy",
      "content": "India’s government has partnered with China’s Alibaba.com on an export-focused program aimed at helping startups and small businesses reach overseas buyers. The move highlights New Delhi’s selective engagement with Chinese-linked tech platforms years after itimposed sweeping banson consumer apps and games.\n\nThis week, the Indian government’s Startup India initiativeannouncedthe collaboration with Alibaba.com to identify and support Indian startups that can help onboard and scale Indian exporters on the group’s global B2B platform. The program offers commissions and technical support to those startups to assist small manufacturers and traders in reaching overseas markets.\n\nThe new partnership arrives after years of strained India–China relations. New Delhibanned dozens of Chinese-linked appsin 2020 following a deadly border clash, including major platforms such as TikTok, PUBG Mobile, and AliExpress, an e-commerce app operated by Alibaba Group. Those restrictions remain in place, making the Indian government’s public collaboration with Alibaba’s export-focused platform a carefully circumscribed form of engagement rather than a broader policy reset.\n\nIndia’s export ambitions are closely tied to its small businesses and the platforms they use to reach overseas markets. Micro, small, and medium enterprises account fornearly half of the country’s exportsand about 31% of GDP, according to the Indian government’s latest Economic Survey, underlining why New Delhi has focused on expanding digital market access for smaller firms through global B2B channels, including Alibaba.com.\n\nAlibaba.com’s B2B platform connects more than 50 million active buyers across over 200 countries and regions, said Rocky Lu, head of India business at the company.\n\n“Alibaba.com has been active in India for over two decades, and we remain dedicated to our core mission of empowering MSMEs to scale their businesses globally,” Lu told TechCrunch. “Our focus continues to be on leveraging our digital inf",
      "excerpt": "India’s government has partnered with China’s Alibaba.com on an export-focused program aimed at helping startups and small businesses reach overseas buyers. The move highlights New Delhi’s selective engagement with Chinese-linked tech platforms years after itimposed sweeping banson consumer apps and",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Anthropic’s Super Bowl ads mocking AI with ads helped push Claude’s app into the top 10",
      "link": "https://techcrunch.com/2026/02/13/anthropics-super-bowl-ads-mocking-ai-with-ads-helped-push-claudes-app-into-the-top-10/",
      "author": "Sarah Perez",
      "date": "2026-02-13T09:16:27-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Claude-app-gettyImages-2216579136.jpg?w=1024",
      "category": "Apps",
      "content": "Anthropic’sSuper Bowl ads— which feature darkly comedic scenarios of people seeking advice from chatbots, only to be steered to “cougar” dating sites and height-boosting insoles — have been paying off. In the days since, Anthropic’s AI chatbot Claude has climbed from No. 41 on the U.S. App Store to become a top 10 app. As of Friday, Claude sits at No. 7 — its highest rank to date — suggesting its “no ads” pitch resonates strongly with users.\n\nAccording to new data from market intelligence providerAppfigures, Claude’s U.S. downloads across both iOS and Android totaled an estimated 148,000 from Sunday through Tuesday — the most recent data available. That’s a 32% increase from the preceding three days, Thursday through Saturday, where downloads totaled approximately 112,000.\n\nClaude’s daily average number of downloads from Sunday through Tuesday was 49,200, up 32% from the usual Sunday through Tuesday average of 37,400 per day.\n\nThe numbers suggest that Anthropic’s Super Bowl commercials, combined with Anthropic’s recentrelease of its new Opus 4.6 model, worked to drive attention to Claude’s app and its key differentiator from ChatGPT. The latterrolled out ads to free usersthis week, just as Anthropic’s ads had warned.\n\nAs a result, Claude’s app is gaining more attention than it did when it first debuted on mobile.\n\nThe consumer-focused AI apparrived on iOS in May 2024to a fairly tepid reception. ChatGPT had beaten it to market on mobile devices and had grown tonearly half a million installsin its first five days. By comparison, Claude had only pulled in 157,000 total global downloads within its first week and didn’t reach a rank higher than No. 55 on the U.S. App Store.\n\nGlobally, Claude saw some gains this past week, too. Overall worldwide downloads of Claude across both the App Store and Google Play grew 15% from Sunday to Tuesday versus last Thursday to Saturday. However, this was less than half the gains seen in the U.S., Appfigures noted.",
      "excerpt": "Anthropic’sSuper Bowl ads— which feature darkly comedic scenarios of people seeking advice from chatbots, only to be steered to “cougar” dating sites and height-boosting insoles — have been paying off. In the days since, Anthropic’s AI chatbot Claude has climbed from No. 41 on the U.S. App Store to ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Fusion startup Helion hits blistering temps as it races toward 2028 deadline",
      "link": "https://techcrunch.com/2026/02/13/fusion-startup-helion-hits-blistering-temps-as-it-races-toward-2028-deadline/",
      "author": "Tim De Chant",
      "date": "2026-02-13T02:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Helion-Polaris-D-T.jpeg?resize=1200,800",
      "category": "Climate",
      "content": "Fusion energy startupHelionannounced Friday that it has hit a key milestone in its quest for fusion power. Plasmas inside the company’s Polaris prototype reactor have reached 150 million degrees Celsius, three-quarters of the way toward what the company thinks it will need to operate a commercial fusion power plant.\n\n“We’re obviously really excited to be able to get to this place,” David Kirtley, Helion’s co-founder and CEO, told TechCrunch.\n\nPolaris is also operating using deuterium-tritium fuel — a mixture of two hydrogen isotopes — which Kirtley said makes Helion the first fusion company to do so. “We were able to see the fusion power output increase dramatically as expected in the form of heat,” he said.\n\nThe Everett, Washington-based startup is locked in a race with several other companies that are seeking to commercialize fusion power, a potentially unlimited source of clean energy.\n\nThat potential has investors rushing to bet on the technology. This week, Inertia Enterprises announced a$450 million Series Around that included Bessemer and GV. In January, Type One Energy told TechCrunch it was in themidst of raising $250 million, while last summer Commonwealth Fusion Systems raised$863 millionfrom investors including Google and Nvidia. Helion itself raised$425 millionlast year from a group that included Sam Altman, Mithril, Lightspeed, and SoftBank.\n\nWhile most other fusion startups are targeting the early 2030s to put electricity on the grid, Helion has a contract with Microsoft to sell it electricity starting in 2028, though that power would come from a larger commercial reactor called Orion that the company is currently building, not Polaris.\n\nEvery fusion startup has its own milestones based on the design of its reactor. Commonwealth Fusion Systems, for example, needs to heat its plasmas to more than 100 million degrees C inside of its tokamak, a doughnut-shaped device that uses powerful magnets to contain the plasma.\n\nHelion’s reactor is different, needin",
      "excerpt": "Fusion energy startupHelionannounced Friday that it has hit a key milestone in its quest for fusion power. Plasmas inside the company’s Polaris prototype reactor have reached 150 million degrees Celsius, three-quarters of the way toward what the company thinks it will need to operate a commercial fu",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Dutch phone giant Odido says millions of customers affected by data breach",
      "link": "https://techcrunch.com/2026/02/13/dutch-phone-giant-odido-says-millions-of-customers-affected-by-data-breach/",
      "author": "Zack Whittaker",
      "date": "2026-02-13T07:54:13-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/odido.jpg?resize=1200,810",
      "category": "Security",
      "content": "Dutch phone company Odido has confirmed a data breach affected millions of its customers.\n\nThe company said in astatementThursday that unidentified hackers gained access to its customer contact system and covertly downloaded reams of customer information. A spokesperson for Odido toldlocal Dutch mediathat the breach affects more than 6.2 million customers, or about a third of the country’s population.\n\nThe stolen data includes customer names, phone numbers, postal and email addresses, dates of birth, bank account numbers (IBAN), and details of customers’ government-issued IDs, such as passport or driver’s license numbers and dates of validity.\n\nThe company said former customers who had service within the past two years may also be affected.\n\nOdido said the data did not include customer call records, location data, billing information, or image scans of government IDs. The data does not affect business customers, the company said.\n\nThe breach affects customers of both Odido and itssubsidiary Ben NL. Both companies said that their phone, internet, and television operations were unaffected by the breach.\n\nThis is the latest in a series of data thefts targeting phone and telecommunication giants in recent years, as governments and financially motivated hackers continue to seek highly confidential information that telcos have on their customers.\n\nEarlier this week, the Singaporean governmentconfirmedthat a China-related hacking group had previously broken into four of the country’s top phone giants as part of a surveillance operation, but did not access customers’ personal information.\n\nAll the while, hackers associated with the China-backed threat group known as Salt Typhoon have hacked hundreds of phone companies around the world, including inCanada,Norway, theUnited Kingdom, and theUnited States, as part of an ongoing espionage campaign aimed at spying on senior government officials and diplomats.",
      "excerpt": "Dutch phone company Odido has confirmed a data breach affected millions of its customers.\n\nThe company said in astatementThursday that unidentified hackers gained access to its customer contact system and covertly downloaded reams of customer information. A spokesperson for Odido toldlocal Dutch med",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "India doubles down on state-backed venture capital, approving $1.1B fund",
      "link": "https://techcrunch.com/2026/02/14/india-doubles-down-on-state-backed-venture-capital-approving-1-1b-fund/",
      "author": "Jagmeet Singh",
      "date": "2026-02-14T08:23:22-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/09/india-flag.jpg?resize=1200,800",
      "category": "Startups",
      "content": "India has cleared a $1.1 billion state-backed venture capital program that will channel government money into startups through private investors, doubling down on its effort to finance high-risk areas such as artificial intelligence, advanced manufacturing and other sectors broadly referred to by the industry as deep tech.\n\nFirst outlinedin the January 2025 budget speech by India’s finance minister, the ₹100 billion fund won cabinet approval this week (more than a year after the speech), allowing the government to move ahead with deployment. A previous iteration of the program, launched in 2016, committed ₹100 billion to 145 private funds that have invested more than ₹255 billion (about $2.8 billion) in over 1,370 startups, according to official datareleasedon Saturday.\n\nThe program is structured as a fund of funds, a common venture capital model in which governments back startups indirectly by committing capital to private investment firms. It is designed to take a more targeted approach than its 2016 counterpart, focusing on deep-tech and manufacturing startups that typically require longer time horizons and larger amounts of capital, while also backing early-stage founders, expanding investment beyond major cities and strengthening India’s domestic venture capital industry, particularly smaller funds, per the Indian government.\n\nAt the announcement on Saturday, IT minister Ashwini Vaishnaw highlighted the scale of India’s startup expansion, pointing to figures shown on a presentation slide indicating the number of startups has grown from fewer than 500 in 2016 to more than 200,000 today. The slide said more than 49,000 startups were registered in 2025 alone, the highest annual total on record.\n\nThe cabinet approval follows recent changes to India’s startup rules aimed ateasing pressure on deep-tech companies. New Delhi doubled the period for which such firms are classified as startups to 20 years and raised the revenue threshold for startup-specific tax, grant an",
      "excerpt": "India has cleared a $1.1 billion state-backed venture capital program that will channel government money into startups through private investors, doubling down on its effort to finance high-risk areas such as artificial intelligence, advanced manufacturing and other sectors broadly referred to by th",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Nothing opens its first retail store in India",
      "link": "https://techcrunch.com/2026/02/13/nothing-opens-its-first-retail-store-in-india/",
      "author": "Ivan Mehta",
      "date": "2026-02-13T22:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Nothing-India-store.jpg?resize=1200,675",
      "category": "Gadgets",
      "content": "Nothing, the hardware company backed by Tiger Global, is opening its first retail store in India, its biggest market. The store is located in Bengaluru, where a large chunk of Nothing’s userbase in India is concentrated, the company said.\n\nThe new, two-storied location will show off Nothing’s products and other projects. Customers will also be able to buy hardware products and other merchandise from the store and have select items customized.\n\n“We wanted to create a fun space. It is kind of inspired by all the parts that are related to the brand. For instance, the factory: if you buy a product, there’s like a production line where the product comes out. We also show machines where phones go through testing, like USB port testing or water resistance testing. So we just wanted to bring that world together,” the company’s co-founder and CEO Carl Pei said.\n\nThe store will feature products from both Nothing and CMF, its budget brand,which it spun off last year. Notably, CMF is headquartered in India and has a joint venture with local Indian ODM (original design manufacturer), Optiemus.\n\nPei mentioned that both brands are differentiated in terms of the products they offer, which fall in different price ranges, as well as the audience they target.\n\n“Nothing is more niche with a higher price. CMF is more [targeted towards] mass. You know it’s mass, but it’s not like just off-the-shelf rebrand products that usually what occurs in this price point. They are also products that we put a lot of care into,” he said.\n\nIndia has been Nothing’s strongest market, with over 2% market share in smartphones, analyst firm IDC told TechCrunch last year. It also noted that Nothing was the fastest-growing brand in the country in Q2 2025, with 85% growth in shipments year-over-year.\n\nOther hardware makers are building aspirational retail stores in India, too. Apple is set toopen its sixth store in the country this month, situated in Borivali, Mumbai, for instance.\n\nThis is the first Nothing s",
      "excerpt": "Nothing, the hardware company backed by Tiger Global, is opening its first retail store in India, its biggest market. The store is located in Bengaluru, where a large chunk of Nothing’s userbase in India is concentrated, the company said.\n\nThe new, two-storied location will show off Nothing’s produc",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}