{
  "last_updated": "2026-02-16T02:30:46.954459+00:00",
  "articles": [
    {
      "title": "The enterprise AI land grab is on. Glean is building the layer beneath the interface.",
      "link": "https://techcrunch.com/2026/02/15/the-enterprise-ai-land-grab-is-on-glean-is-building-the-layer-beneath-the-interface/",
      "author": "Rebecca Bellan",
      "date": "2026-02-15T09:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2259183688.jpg?w=1024",
      "category": "AI",
      "content": "The battle for enterprise AI is heating up. Microsoft is bundling Copilot into Office. Google is pushing Gemini into Workspace. OpenAI and Anthropic are selling directly to enterprises. Every SaaS vendor now ships an AI assistant.\n\nIn the scramble for the interface, Glean is betting on something less visible: becoming the intelligence layer beneath it.\n\nSeven years ago, Glean set out to be the Google for enterprise — an AI-powered search tool designed to index and search across a company’s SaaS tool library, from Slack to Jira, Google Drive to Salesforce. Today, the company’s strategy has shifted from building a better enterprise chatbot to becoming the connective tissue between models and enterprise systems.\n\n“The layer we built initially – a good search product – required us to deeply understand people and how they work and what their preferences are,” Jain told TechCrunch on last week’sepisode of Equity, which we recorded at Web Summit Qatar. “All of that is now becoming foundational in terms of building high quality agents.”\n\nHe says that while large language models are powerful, they’re also generic.\n\n“The AI models themselves don’t really understand anything about your business,” Jain said. “They don’t know who the different people are, they don’t know what kind of work you do, what kind of products you build. So you have to connect the reasoning and generative power of the models with the context inside your company.”\n\nGlean’s pitch is that it already maps that context and can sit between the model and the enterprise data.\n\nThe Glean Assistant is often the entry point for customers — a familiar chat interface powered by a mix of leading proprietary (ie, ChatGPT, Gemini, Claude) and open-source models, grounded in the company’s internal data. But what keeps customers, Jain argues, is everything underneath it.\n\nFirst is model access. Rather than forcing companies to commit to a single LLM provider, Glean acts as the abstraction layer, allowing enterprises to sw",
      "excerpt": "The battle for enterprise AI is heating up. Microsoft is bundling Copilot into Office. Google is pushing Gemini into Workspace. OpenAI and Anthropic are selling directly to enterprises. Every SaaS vendor now ships an AI assistant.\n\nIn the scramble for the interface, Glean is betting on something les",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "India has 100M weekly active ChatGPT users, Sam Altman says",
      "link": "https://techcrunch.com/2026/02/15/india-has-100m-weekly-active-chatgpt-users-sam-altman-says/",
      "author": "Jagmeet Singh",
      "date": "2026-02-15T10:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/04/chatgpt-india.jpg?resize=1200,800",
      "category": "AI",
      "content": "India has 100 million weekly active ChatGPT users, making the country one of OpenAI’s largest markets globally, CEO Sam Altman said ahead of a government-hosted AI summit.\n\nOn Sunday, Altman outlined ChatGPT’s growing adoption in India in an articlepublishedin the Indian English daily Times of India, as OpenAI prepares to formally participate in the five-day India AI Impact Summit in New Delhi, beginning Monday. Altman isattending the eventalongside senior executives from several of the world’s leading AI companies.\n\nThe growth comes as OpenAI,like other leading AI firms, looks to India’s young population and its more than a billion internet users to fuel global expansion. The ChatGPT makeropened a New Delhi officein August 2025 after months of groundwork in the country, and has adjusted its approach for India’s price-sensitive market, including rolling out asub-$5 ChatGPT Go tierthat waslater made free for a yearfor Indian users.\n\nIn the article, Altman said India is ChatGPT’s second-largest user base after the United States, highlighting the South Asian nation’s growing weight in OpenAI’s global strategy. The disclosure comes as ChatGPT’s overall usage has surged worldwide, with the platformreaching 800 million weekly active usersas of October 2025 and reported to beapproaching 900 million.\n\nAltman also highlighted the role of students in driving adoption, saying India has the largest number of student users of ChatGPT globally.\n\nIndian students have become a key growth segment for leading AI companies more broadly, as rivals race to embed their tools in classrooms and learning workflows. Google has similarly targeted the market, offering Indian students afree one-year subscription to its AI Pro planin September 2025. Separately, India accounts for thehighest global usage of Gemini for learning, Chris Phillips, Google’s vice president and general manager for education, said last month.\n\n“With its focus on access, practical Al literacy, and the infrastructure that ",
      "excerpt": "India has 100 million weekly active ChatGPT users, making the country one of OpenAI’s largest markets globally, CEO Sam Altman said ahead of a government-hosted AI summit.\n\nOn Sunday, Altman outlined ChatGPT’s growing adoption in India in an articlepublishedin the Indian English daily Times of India",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "The great computer science exodus (and where students are going instead)",
      "link": "https://techcrunch.com/2026/02/15/the-great-computer-science-exodus-and-where-students-are-going-instead/",
      "author": "Connie Loizos",
      "date": "2026-02-15T00:40:27-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2019/10/GettyImages-827810708.jpg?resize=1200,801",
      "category": "AI",
      "content": "Something strange happened at University of California campuses this fall. For the first time since the dot-com crash, computer science enrollment dropped. System-wide, it fell6% last yearafter declining 3% in 2024, according to reporting this past week by the San Francisco Chronicle. Even as overall college enrollmentclimbed 2% nationally— according to January data from the National Student Clearinghouse Research Center — students are bailing on traditional CS degrees.\n\nThe one exception is UC San Diego  — the only UC campus that added adedicated AI major this fall.\n\nThis all might look like a temporary blip tied to news about fewer CS gradsfinding work out of college. But it’s more likely an indicator of the future, one that China is much more enthusiastically embracing. As MIT Technology Reviewreported last July, Chinese universities have leaned hard into AI literacy, treating AI not as a threat but instead as essential infrastructure. Nearly 60% of Chinese students and faculty now use AI tools multiple times daily, and schools like Zhejiang University have made AI coursework mandatory, while top institutions like Tsinghua have created entirely new interdisciplinary AI colleges. In China, fluency with AI isn’t optional anymore; it’s table stakes.\n\nU.S. universities are scrambling to catch up. Over the last two years, dozens have launched AI-specific programs. MIT’s “AI and decision-making” major is now thesecond-largest majoron campus, says the school. Asreportedby the New York Times in December, the University of South Florida enrolled more than3,000 studentsin anew AI and cybersecurity collegeduring its fall semester. The University at Buffalolast summerlaunched a new “AI and Society” department that offers seven new, specialized undergraduate degree programs, and it receivedmore than 200 applicantsbefore it swung open its doors.\n\nThe transition hasn’t been smooth everywhere. When I spoke withUNC Chapel Hill Chancellor Lee Robertsin October, he described a spec",
      "excerpt": "Something strange happened at University of California campuses this fall. For the first time since the dot-com crash, computer science enrollment dropped. System-wide, it fell6% last yearafter declining 3% in 2024, according to reporting this past week by the San Francisco Chronicle. Even as overal",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "OpenClaw creator Peter Steinberger joins OpenAI",
      "link": "https://techcrunch.com/2026/02/15/openclaw-creator-peter-steinberger-joins-openai/",
      "author": "Anthony Ha",
      "date": "2026-02-15T14:28:02-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-1396827010.jpg?resize=1200,839",
      "category": "",
      "content": "Peter Steinberger, who created the AI personal assistant now known asOpenClaw, has joined OpenAI.\n\nPreviously known as Clawdbot, then Moltbot,OpenClaw achieved viral popularityover the past few weeks with its promise to be the “AI that actually does things,” whether that’s managing your calendar, booking flights, or evenjoining a social network full of other AI assistants. (The name changed the first time after Anthropic threatened legal action over its similarity to Claude, then changed again because Steinberger liked the new name better.)\n\nIna blog post announcing his decisionto join OpenAI, the Austrian developer said that while he might have been able to turn OpenClaw into a huge company, “It’s not really exciting for me.”\n\n“What I want is to change the world, not build a large company[,] and teaming up with OpenAI is the fastest way to bring this to everyone,” Steinberger said.\n\nOpenAI CEOSam Altman posted on Xthat in his new role, Steinberger will “drive the next generation of personal agents.” As for OpenClaw, Altman said it will “live in a foundation as an open source project that OpenAI will continue to support”",
      "excerpt": "Peter Steinberger, who created the AI personal assistant now known asOpenClaw, has joined OpenAI.\n\nPreviously known as Clawdbot, then Moltbot,OpenClaw achieved viral popularityover the past few weeks with its promise to be the “AI that actually does things,” whether that’s managing your calendar, bo",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "What the Epstein files reveal about EV startups and Silicon Valley",
      "link": "https://techcrunch.com/2026/02/15/what-the-epstein-files-reveal-about-ev-startups-and-silicon-valley/",
      "author": "Anthony Ha",
      "date": "2026-02-15T08:54:12-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/jeffrey-epstein_8ef3e8.jpg?resize=1200,800",
      "category": "Startups",
      "content": "After the Justice Department released a trove of new documents tied to infamous sex offender Jeffrey Epstein, journalists digging through them havefound extensive connections to Silicon Valley.\n\nTechCrunch’s Sean O’Kane examined howa mysterious businessman named David Stern built a relationship with Epsteinand pitched him investments in multiple electric vehicle startups, including Faraday Future, Lucid Motors, and Canoo.\n\nOn the latest episode ofthe Equity podcast, Kirsten Korosec and I talk to Sean about what he learned, and we discuss whether the Epstein revelations will lead to broader fallout in Silicon Valley.\n\nYou can read a preview of our conversation, edited for length and clarity, in the transcript below.\n\nSean:There are always people at the edges who don’t necessarily want to be front and center in the investment scene. And that was why I started looking through these files, in part because a long time ago, flashback 10 years ago on my beat especially, there was just a ton of Chinese investment in the space.\n\nThis was before even the rush of EV startups in China that we see today […] In autonomous vehicles, but electric vehicles especially, there was this moment where Chinese investors and Chinese companies, state-owned automakers, all they wanted to do was to be looked at like Silicon Valley startups. So they came here and they invested in companies and helped get them off the ground, or in some cases even set up offices in Silicon Valley.\n\nAnd it was in that environment that a lot of the companies that I’ve covered for a long time popped up. There was just never a full picture of how a lot of them were funded.\n\nOne in particular, this company called Canoo, which is now bankrupt and out of business, had maybe the most mysterious set of investors of all of them. They really were not upfront about it when they first sort of came out of stealth in early 2018. And it frankly took until there was a lawsuit between some people who ran the company near the top ",
      "excerpt": "After the Justice Department released a trove of new documents tied to infamous sex offender Jeffrey Epstein, journalists digging through them havefound extensive connections to Silicon Valley.\n\nTechCrunch’s Sean O’Kane examined howa mysterious businessman named David Stern built a relationship with",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "How to get into a16z’s super-competitive Speedrun startup accelerator program",
      "link": "https://techcrunch.com/2026/02/15/how-to-get-into-a16zs-super-competitive-speedrun-startup-accelerator-program/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-15T07:53:53-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/speedrun.webp?resize=1200,800",
      "category": "Venture",
      "content": "Without a doubt, one of the hottest new startup accelerators in tech right now is Andreessen Horowitz’s Speedrun program. Launched in 2023, the accelerator has an acceptance rate of less than 1%. In aJanuary blog post,the program said that over 19,000 startups pitched and fewer than 0.4% were accepted into the latest cohort.\n\nThe program used to focus on gaming startups, then expanded into entertainment and media, and is now a “horizontal program,” Joshua Lu, the program’s general manager and a partner at a16z, told TechCrunch. Today, founders of any type of startup can apply, and the program runs for about 12 weeks in San Francisco. It once had a program in Los Angeles, but Lu said the focus will be on SF from now on.\n\nThere are two cohorts a year, and around 50 to 70 startups are accepted into each. The programinvests up to $1 millioninto each company, though the downside is that it’s a bit pricey. It typically invests $500,000 up front in exchange for 10% of the startup’s company via a SAFE note, and another $500,000 if the next round is raised within 18 months, at whatever terms agreed to by the other investors.\n\nIn comparison, Y Combinatortypically takes a fixed 7%of the company for $125,000, with another $375,000 “invested on an uncapped MFN safe.”\n\nSpeedrun said its program is more “equity expensive” because of what it offers founders. It provides them with access to a16z’s advisory and business networks that assist with tasks like go-to-market, brand development, media strategy, and talent sourcing. Plus it offers the startups perks like $5 million in credits to vendors such as AWS, OpenAI, Nvidia, and Deel.\n\nGiven the high interest, and low acceptance rate, TechCrunch spoke to Lu for some tips on how startups can best stand out. The latest cohort began in January and will end in April with a Demo Day. Applications forthe next cohort open in April,though it looks at off-season applications year-round, Lu said.\n\nSpeedrun focuses on early-stage startups. Becau",
      "excerpt": "Without a doubt, one of the hottest new startup accelerators in tech right now is Andreessen Horowitz’s Speedrun program. Launched in 2023, the accelerator has an acceptance rate of less than 1%. In aJanuary blog post,the program said that over 19,000 startups pitched and fewer than 0.4% were accept",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Hollywood isn’t happy about the new Seedance 2.0 video generator",
      "link": "https://techcrunch.com/2026/02/15/hollywood-isnt-happy-about-the-new-seedance-2-0-video-generator/",
      "author": "Anthony Ha",
      "date": "2026-02-15T07:41:16-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2020/08/GettyImages-1263876301.jpeg?w=1024",
      "category": "Media & Entertainment",
      "content": "Hollywood organizations are pushing back against a new AI video model calledSeedance 2.0, which they say has quickly become a tool for “blatant” copyright infringement.\n\nByteDance, the Chinese company that recently finalized a deal to sell TikTok’s U.S. operations (itretains a stake in the new joint venture), launched Seedance 2.0 earlier this week.According to the Wall Street Journal, the updated model is currently available to Chinese users of ByteDance’s Jianying app, and the company says it will soon be available to global users of its CapCut app.\n\nSimilar to tools such asOpenAI’s Sora, Seedance allows users to create videos (currently limited to 15 seconds in length) by just entering a text prompt. And like Sora, Seedance quickly drew criticism for an apparent lack of guardrails around the ability to create videos using the likeness of real people, as well as studios’ intellectual property.\n\nAfter one X userposted a brief videoshowing Tom Cruise fighting Brad Pitt, which they said was created by “a 2 line prompt in seedance 2,” “Deadpool” screenwriterRhett Reese responded, “I hate to say it. It’s likely over for us.”\n\nThe Motion Picture Association soon issueda statementfrom CEO Charles Rivkin demanding that ByteDance “immediately cease its infringing activity.”\n\n“In a single day, the Chinese AI service Seedance 2.0 has engaged in unauthorized use of U.S. copyrighted works on a massive scale,” Rivkin said. “By launching a service that operates without meaningful safeguards against infringement, ByteDance is disregarding well-established copyright law that protects the rights of creators and underpins millions of American jobs.”\n\nThe Human Artistry Campaign — an initiative backed by Hollywood unions and trade groups —condemned Seedance 2.0as “an attack on every creator around the world,” whilethe actors’ union SAG-AFTRA saidit “stands with the studios in condemning the blatant infringement enabled by Bytedance’s new AI video model Seedance 2.0.”\n\nSeedance videos",
      "excerpt": "Hollywood organizations are pushing back against a new AI video model calledSeedance 2.0, which they say has quickly become a tool for “blatant” copyright infringement.\n\nByteDance, the Chinese company that recently finalized a deal to sell TikTok’s U.S. operations (itretains a stake in the new joint",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "A Stanford grad student created an algorithm to help his classmates find love; now, Date Drop is the basis of his new startup",
      "link": "https://techcrunch.com/2026/02/13/a-stanford-grad-student-created-an-algorithm-to-help-his-classmates-find-love-now-date-drop-is-the-basis-of-his-new-startup/",
      "author": "Amanda Silberling",
      "date": "2026-02-13T08:24:53-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/headshot.jpg?resize=898,1200",
      "category": "Apps",
      "content": "As Valentine’s Day approaches at Stanford, some students may be gearing up for first dates — not with people they met on Tinder or Hinge, but with matches from a service calledDate Drop, designed by Stanford graduate student Henry Weng. Date Drop pairs students with potential dates once per week based on their responses to a questionnaire.\n\nA Stanford whiz kid is trying to disrupt an established industry from his Palo Alto dorm?Stop meifyou’ve heard thisonebefore! But young adults are deeplydisillusionedwith the frustrating, demoralizingstate of online dating. Why not try something different?\n\nOver 5,000 students at Stanford have given Date Drop a try since its launch in the fall. It has also rolled out at 10 more schools, including MIT, Princeton, and the University of Pennsylvania, and Weng says he wants to roll out Date Drop more broadly in some cities this summer.\n\n“Our matches convert to actual dates at about 10x the rate of Tinder,” Weng told TechCrunch. “Instead of swiping, we get to know each person deeply and send them one compatible match per week.”\n\nAt first, Weng didn’t intend to turn Date Drop into the foundation of a startup. Then, a close friend of his met their partner via Date Drop. “That was when I got the sense that this was less of a project,” he said.\n\nNow, Weng thinks of Date Drop as just the first service from his startup, TheRelationship Company, which is a public benefit corporation — a type of company legally required to consider social impact alongside profits.\n\n“This started as something I just wanted to exist on campus, and it became a company because people kept on asking for it in their schools and I needed resources to do that,” he said.\n\nAlready, Weng has raised “a few million” from some angel investors, including Zynga founder and early Facebook backer Mark Pincus, who has taught business courses at Stanford (including to Weng). Andy Chen, a former partner at Coatue, and Elad Gil, an early backer of Airbnb, Stripe, and Pinterest, al",
      "excerpt": "As Valentine’s Day approaches at Stanford, some students may be gearing up for first dates — not with people they met on Tinder or Hinge, but with matches from a service calledDate Drop, designed by Stanford graduate student Henry Weng. Date Drop pairs students with potential dates once per week bas",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "As AI data centers hit power limits, Peak XV backs Indian startup C2i to fix the bottleneck",
      "link": "https://techcrunch.com/2026/02/15/as-ai-data-centers-hit-power-limits-peak-xv-backs-indian-startup-c2i-to-fix-the-bottleneck/",
      "author": "Jagmeet Singh",
      "date": "2026-02-15T17:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/02/GettyImages-1195233690.jpg?resize=1200,775",
      "category": "AI",
      "content": "Power, rather than compute, is fast becoming the limiting factor in scaling AI data centers. That shift has prompted Peak XV Partners to backC2i Semiconductors, an Indian startup building plug-and-play, system-level power solutions designed to cut energy losses and improve the economics of large-scale AI infrastructure.\n\nC2i (which stands for control conversion and intelligence) has raised $15 million in a Series A round led by Peak XV Partners, with participation from Yali Deeptech and TDK Ventures, bringing the two-year-old startup’s total funding to $19 million.\n\nThe investment comes as data-center energy demand accelerates worldwide. Electricity consumption from data centers isprojected to nearly triple by 2035, per a December 2025 report from BloombergNEF, while Goldman Sachs Research estimates data-center power demandcould surge 175% by 2030from 2023 levels — the equivalent of adding another top-10 power-consuming country.\n\nMuch of that strain comes not from generating electricity but from converting it efficiently inside data centers, where high-voltage power must be stepped down thousands of times before it reaches GPUs. This process currently wastes about 15% to 20% of energy, C2i’s co-founder and CTO Preetam Tadeparthy said in an interview.\n\n“What used to be 400 volts has already moved to 800 volts, and will likely go higher,” Tadeparthy told TechCrunch.\n\nFounded in 2024 by former Texas Instruments power executives Ram Anant, Vikram Gakhar, Preetam Tadeparthy, and Dattatreya Suryanarayana, along with Harsha S. B and Muthusubramanian N. V, C2i is redesigning power delivery as a single, plug-and-play “grid-to-GPU” system spanning the data-center bus to the processor itself.\n\nBy treating power conversion, control and packaging as an integrated platform, C2i estimates it can cut end-to-end losses by around 10% — roughly 100 kilowatts saved for every megawatt consumed — with knock-on effects for cooling costs, GPU utilisation and overall data-center economics.\n",
      "excerpt": "Power, rather than compute, is fast becoming the limiting factor in scaling AI data centers. That shift has prompted Peak XV Partners to backC2i Semiconductors, an Indian startup building plug-and-play, system-level power solutions designed to cut energy losses and improve the economics of large-sca",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Blackstone backs Neysa in up to $1.2B financing as India pushes to build domestic AI infrastructure",
      "link": "https://techcrunch.com/2026/02/15/blackstone-backs-neysa-in-up-to-1-2b-financing-as-india-pushes-to-build-domestic-ai-compute/",
      "author": "Jagmeet Singh",
      "date": "2026-02-15T16:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2021/07/GettyImages-1156074432.jpg?resize=1200,800",
      "category": "AI",
      "content": "Neysa, an Indian AI infrastructure startup, has secured backing from U.S. private equity firm Blackstone as it scales domestic compute capacity amid India’spush to build homegrown AI capabilities.\n\nBlackstone and co-investors, including Teachers’ Venture Growth, TVS Capital, 360 ONE Assets, and Nexus Venture Partners, have agreed to invest up to $600 million of primary equity in Neysa, giving Blackstone a majority stake, Blackstone and Neysa told TechCrunch. The Mumbai-headquartered startup also plans to raise an additional $600 million in debt financing as it expands GPU capacity, a sharp increase from the $50 million it had raised previously.\n\nThe deal comes asdemand for AI computing surges globally, creatingsupply constraints for specialized chipsanddata center capacity neededto train and run large models. Newer AI-focused infrastructure providers — oftenreferred to as “neo-clouds”— have emerged to bridge that gap by offering dedicated GPU capacity and faster deployment than traditional hyperscalers, particularly for enterprises and AI labs with specific regulatory, latency, or customisation requirements.\n\nNeysaoperates in this emerging segment, positioning itself as a provider of customized, GPU-first infrastructure for enterprises, government agencies, and AI developers in India, where demand for local compute is still at an early but rapidly expanding stage.\n\n“A lot of customers want hand-holding, and a lot of them want round-the-clock support with a 15-minute response and a couple of our resolutions. And so those are the kinds of things that we provide that some of the hyperscalers don’t,” said Neysa co-founder and CEO Sharad Sanghi.\n\nGanesh Mani, a senior managing director at Blackstone Private Equity, said his firm estimates that India currently has fewer than 60,000 GPUs deployed — and it expects the figure to scale up nearly 30 times to more than two million in the coming years.\n\nThat expansion is being driven by a combination of government demand, enterp",
      "excerpt": "Neysa, an Indian AI infrastructure startup, has secured backing from U.S. private equity firm Blackstone as it scales domestic compute capacity amid India’spush to build homegrown AI capabilities.\n\nBlackstone and co-investors, including Teachers’ Venture Growth, TVS Capital, 360 ONE Assets, and Nexu",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}