{
  "last_updated": "2026-02-05T21:33:15.437772+00:00",
  "articles": [
    {
      "title": "OpenAI launches a way for enterprises to build and manage AI agents",
      "link": "https://techcrunch.com/2026/02/05/openai-launches-a-way-for-enterprises-to-build-and-manage-ai-agents/",
      "author": "Rebecca Szkutak",
      "date": "2026-02-05T10:09:50-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-2213399157.jpg?resize=1200,800",
      "category": "AI",
      "content": "OpenAI has launched a new product to help enterprises navigate the world of AI agents, focusing on agent management as critical infrastructure for enterprise AI adoption.\n\nOn Thursday, AI giant OpenAI announced thelaunch of OpenAI Frontier, an end-to-end platform designed for enterprises to build and manage AI agents. It’s an open platform, which means users can manage agents built outside of OpenAI too.\n\nFrontier users can program AI agents to connect to external data and applications, which allows them to execute tasks far outside of the OpenAI platform. Users can also limit and manage what these agents have access to, and what they can do, of course.\n\nOpenAI said Frontier was designed to work the same way companies manage human employees. Frontier offers an onboarding process for agents and a feedback loop that is meant to help them improve over time the same way a review might help an employee.\n\nOpenAI touted enterprises, including HP, Oracle, State Farm, and Uber as customers, but Frontier is currently only available to a limited number of users with plans to roll out more generally in the coming months.\n\nThe company would not disclose pricing details in a press briefing earlier this week, according toreporting from The Verge. OpenAI declined to comment on pricing.\n\nAgent-management products become table stakes since AI agents rose to prominence in 2024. Salesforce has arguably the best-known such product,Agentforce, which the company launched in the fall of 2024. Others have quickly followed.LangChainis a notable player in the space that was founded in 2022 and has raised more than $150 million in venture capital.CrewAIis a smaller upstart that has raised more than $20 million in venture capital.\n\nIn December, global research and advisory firm Gartnerreleased a reportabout this type of software and called agent management platforms both the “most valuable real estate in AI” and a necessary piece of infrastructure for enterprises to adopt AI.\n\nIt’s not surprisi",
      "excerpt": "OpenAI has launched a new product to help enterprises navigate the world of AI agents, focusing on agent management as critical infrastructure for enterprise AI adoption.\n\nOn Thursday, AI giant OpenAI announced thelaunch of OpenAI Frontier, an end-to-end platform designed for enterprises to build an",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Anthropic releases Opus 4.6 with new ‘agent teams’",
      "link": "https://techcrunch.com/2026/02/05/anthropic-releases-opus-4-6-with-new-agent-teams/",
      "author": "Lucas Ropek",
      "date": "2026-02-05T09:51:13-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2023/11/Claude2_Blog_V1-1.webp?resize=1200,675",
      "category": "AI",
      "content": "On Thursday, Anthropic released the latest version of Opus — its most advanced model and a particularly important model for Claude Code. Opus 4.5 was only releasedlast November, and with 4.6, the company has sought to broaden its model’s capabilities and appeal, allowing for a greater variety of uses and customers.\n\nPerhaps the most notable addition to the newest version of Opus is the inclusion of what the company calls “agent teams” — teams of agents that can split larger tasks into segmented jobs.\n\n“Instead of one agent working through tasks sequentially, you can split the work across multiple agents — each owning its piece and coordinating directly with the others,” the company says. Scott White, Head of Product at Anthropic, compared the new feature to having a talented team of humans working for you, noting that the segmenting of agent responsibilities allows them “to coordinate in parallel [and work] faster.” The agent teams are currently available in a research preview for API users and subscribers.\n\nOpus 4.6 also comes with a longer context window — meaning that the program has a capacity to recall a greater amount of information per user session. The new model offers 1 million tokens of context, which is comparable to what the company’s Sonnet (versions 4 and 4.5)currently offers. Those context windows allow for work involving larger code bases and can also allow for the processing of larger documents, the company says.\n\nThe new version of Opus also integrates Claude directly into PowerPoint as an accessible side panel. This is a step up from PowerPoint’s previous integration with the chatbot. Previously, a user could tell Claude to create a PowerPoint deck, but the file would then have to be transferred to PowerPoint to edit the presentation, White said. Now the presentation can be crafted within PowerPoint, with direct help from Claude.\n\nWhite told TechCrunch that Opus has evolved from a model that was highly capable in one particular domain — software d",
      "excerpt": "On Thursday, Anthropic released the latest version of Opus — its most advanced model and a particularly important model for Claude Code. Opus 4.5 was only releasedlast November, and with 4.6, the company has sought to broaden its model’s capabilities and appeal, allowing for a greater variety of use",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Pacific Fusion finds a cheaper way to make its fusion reactor work",
      "link": "https://techcrunch.com/2026/02/05/pacific-fusion-finds-a-cheaper-way-to-make-its-fusion-reactor-work/",
      "author": "Tim De Chant",
      "date": "2026-02-05T09:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/04/pacific-fusion-reactor-illustration.jpeg?resize=1200,652",
      "category": "Climate",
      "content": "Fusion power’s biggest question remains unanswered: How do you ensure the cost to start the fusion reaction isn’t higher than the price at which you can sell the power?\n\nPlenty of people have ideas, but no one has cracked it yet. Commonwealth Fusion Systems, for example, is confident enough that it’s building a massive reactor that costs several hundred million dollars. But the device won’t be turned onuntil next year, leaving the question unanswered for now.\n\nOther companies that were founded more recently think they have a shot at building a fusion power plant for less, includingPacific Fusion. Today the company announced the results of a series of experiments it performed at Sandia National Laboratories that it says will eliminate some costly parts of its approach. The company exclusively shared the results with TechCrunch.\n\nFusion power promises to generate large amounts of electricity 24/7 and deliver it in a way that’s familiar to today’s grid operators. Most fusion startups are targeting the early to mid-2030s to switch on their first commercial fusion power plant.\n\nPacific Fusion ischasing an approachknown as pulser-driven inertial confinement fusion (ICF). At its core, it’s similar to theexperimentscarried out at the National Ignition Facility (NIF). The company compresses small fuel pellets in rapid succession, and that compression causes atoms inside the fuel to fuse and release energy.\n\nBut where NIF uses lasers to kick off the compression, Pacific Fusion wants to use massive pulses of electricity. Those pulses will create a magnetic field that encircles the fuel pellet — about the size of a pencil eraser — causing it to compress in less than 100 billionths of a second.\n\n“The faster you can implode it, the hotter it’ll get,” Keith LeChien, co-founder and CTO of Pacific Fusion, told TechCrunch.\n\nOne of the challenges with pulser-driven ICF is that the process has typically needed a bit of a kick-start to work properly. To create conditions in the fuel pel",
      "excerpt": "Fusion power’s biggest question remains unanswered: How do you ensure the cost to start the fusion reaction isn’t higher than the price at which you can sell the power?\n\nPlenty of people have ideas, but no one has cracked it yet. Commonwealth Fusion Systems, for example, is confident enough that it’",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Elon Musk is getting serious about orbital data centers",
      "link": "https://techcrunch.com/2026/02/05/elon-musk-is-getting-serious-about-orbital-data-centers/",
      "author": "Russell Brandom",
      "date": "2026-02-05T10:50:49-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Screen-Shot-2026-02-05-at-10.07.05-AM.jpg?resize=1200,924",
      "category": "AI",
      "content": "On Friday, when SpaceX filed plans with the FCCfor a million-satellite data center network, you might have thought Elon Musk was having a bit of fun with us. But a week later, it is clear that he is dead serious.\n\nThe most obvious step, of course, is the formal merger between SpaceX and xAI thatwent forward on Monday, officially drawing together Musk’s space and AI ventures in a way that makes a lot more sense if there’s some kind of joint infrastructure project planned.\n\nBut even beyond the merger, we’re starting to see the idea of orbital AI data clusters — essentially, networks of computers operating in space — cohere into an actual plan. On Wednesday, the FCC accepted the filing and set a schedule seeking public comment. It’s a pro forma step normally, but FCC chairman Brendan Carr took the unusual step ofsharing the filing on X. Throughout his tenure as chairman, Carr has shown himselfeager to help Trump’s friends and punish his enemies— so as long as Musk stays on Trump’s good side, the proposal is likely to sail through without issue.\n\nAt the same time, Elon Musk has started to flesh out the argument for orbital data centers in public. On anew episodeof Stripe co-founder Patrick Collison’s podcast “Cheeky Pint,” which also featured guest Dwarkesh Patel, Musk laid out the basic case for moving most of our AI computing power into space. Essentially, solar panels produce more power in space, so you can cut down on one of the main operating expenses for data centers.\n\n“It’s harder to scale on the ground than it is to scale in space,” Musk said in the podcast. “Any given solar panel is going to give you about five times more power in space than on the ground, so it’s actually much cheaper to do in space.”\n\nClose listeners will note that there is a bit of a gap in the logic here! It’s true that solar panels produce more power in space, but since power isn’t the only cost in operating a data center and solar panels aren’t the only way to power a data center, it does",
      "excerpt": "On Friday, when SpaceX filed plans with the FCCfor a million-satellite data center network, you might have thought Elon Musk was having a bit of fun with us. But a week later, it is clear that he is dead serious.\n\nThe most obvious step, of course, is the formal merger between SpaceX and xAI thatwent",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Meta tests a stand-alone app for its AI-generated ‘Vibes’ videos",
      "link": "https://techcrunch.com/2026/02/05/meta-tests-a-standalone-app-for-its-ai-generated-vibes-videos/",
      "author": "Aisha Malik",
      "date": "2026-02-05T09:19:01-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2194278734.jpg?w=1024",
      "category": "Apps",
      "content": "Meta is testing a stand-alone Vibes app, the company confirmed to TechCrunch on Thursday. Launched last September,Vibeslets you create and share short-form AI-generated videos and access a dedicated feed that displays AI videos from others.\n\nThink TikTok or Instagram Reels, but every video you come across is AI generated. Until now, the feed has lived in the Meta AI app. By making Vibes available outside of the Meta AI app, the company is positioning it as a more direct competitor toSora, OpenAI’s AI-generated video and social appthat launched shortly after Vibes.\n\n“Following the strong early traction of Vibes within Meta AI, we are testing a standalone app to build on that momentum,” Meta said in an emailed statement. “We’ve seen that users are increasingly leaning into the format to create, discover, and share AI-generated video with friends. This standalone app provides a dedicated home for that experience, offering people a more focused and immersive environment. We will look to expand the app further based on what we learn from the community.”\n\nThe news was first reported byPlatformer.\n\nMeta says it doesn’t share specific numbers but claims Vibes has performed well, with Meta AI usage continuing to grow steadily since its launch, which it believes signals demand for a stand-alone app.\n\nThe tech giant also notes that while users engage with content in Meta AI, a stand-alone app allows for a more focused experience for creation and engagement.\n\nVibes lets users generate a video from scratch or remix a video that they see on their feed. Before publishing, you can add new visuals, layer in music, and adjust styles. You can then post the video directly to the Vibes feed, DM it to others, or cross-post to Instagram and Facebook Stories and Reels.\n\nMeta says collaboration and sharing are on the rise, with many Vibes videos being messaged to friends, which the company says mirrors how people use Reels.\n\nIt’s worth noting thatMeta told TechCrunchlast week that, in addit",
      "excerpt": "Meta is testing a stand-alone Vibes app, the company confirmed to TechCrunch on Thursday. Launched last September,Vibeslets you create and share short-form AI-generated videos and access a dedicated feed that displays AI videos from others.\n\nThink TikTok or Instagram Reels, but every video you come ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "NASA astronauts can now bring their phones with them on their mission to the moon",
      "link": "https://techcrunch.com/2026/02/05/nasa-astronauts-can-now-bring-their-phones-with-them-on-their-mission-to-the-moon/",
      "author": "Amanda Silberling",
      "date": "2026-02-05T10:29:48-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/07/nasa-spacex-crew-2-return.jpg?resize=1200,674",
      "category": "Space",
      "content": "Get ready for some selfies that are out of this world. NASA astronauts will be allowed to bring their smartphones to space for the first time, starting with the Crew-12 and Artemis II missions.\n\nCrew-12 is expected to head to the International Space Stationnext week, while the highly anticipated Artemis II mission — which willbring humans around the moonfor the first time since the 1960s — was delayed until March.\n\n“We are giving our crews the tools to capture special moments for their families and share inspiring images and video with the world,” NASA administrator Jared Isaacmanwroteon X.\n\nWith the newest iPhones and Android devices at hand, the crew will be able to be a bit more spontaneous with image and video gathering, meaning that for those of us back home, these upcoming trips to space could end up being some of NASA’s most well-documented journeys yet.\n\nImagine how cool (or cringe-worthy) it will be if astronauts turn themselves into TikTok stars in zero gravity, or if they take ultra-wide-angle selfies in the spacecraft. For those working in government bureaucracy, it’s equally exciting, apparently, that NASA approved this rule change pretty quickly.\n\n“Just as important, we challenged long-standing processes and qualified modern hardware for spaceflight on an expedited timeline,” Isaacman wrote. “That operational urgency will serve NASA well as we pursue the highest-value science and research in orbit and on the lunar surface.”\n\nIt makes sense that it would be hard to approve new technology to go into space — if one small thing goes astray, a spaceflight can go terribly wrong. Until now, the newest cameras that were supposed to go on these missions were decade-old Nikon DSLRs and GoPros, according toArs Technica. That’s by no means arcane, but there’s something more spontaneous and whimsical about using a smartphone.\n\nThis is not, however, the first time that smartphones havegone to space. SpaceX allowed smartphones for itsprivate astronaut missions.",
      "excerpt": "Get ready for some selfies that are out of this world. NASA astronauts will be allowed to bring their smartphones to space for the first time, starting with the Crew-12 and Artemis II missions.\n\nCrew-12 is expected to head to the International Space Stationnext week, while the highly anticipated Art",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "ElevenLabs CEO: Voice is the next interface for AI",
      "link": "https://techcrunch.com/2026/02/05/elevenlabs-ceo-voice-is-the-next-interface-for-ai/",
      "author": "Rebecca Bellan",
      "date": "2026-02-05T06:41:12-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Web-Summit-Doha-Staniszewski-Seth-Pierrepont.png?resize=1200,657",
      "category": "AI",
      "content": "ElevenLabs co-founder and CEO Mati Staniszewski says voice is becoming the next major interface for AI – the way people will increasingly interact with machines as models move beyond text and screens.\n\nSpeaking atWeb Summit in Doha, Staniszewski told TechCrunch voice models like those developed by ElevenLabs have recently moved beyond simply mimicking human speech — including emotion and intonation – to working in tandem with the reasoning capabilities of large language models. The result, he argued, is a shift in how people interact with technology.\n\nIn the years ahead, he said, “hopefully all our phones will go back in our pockets, and we can immerse ourselves in the real world around us, with voice as the mechanism that controls technology.”\n\nThat vision fueled ElevenLabs’s$500 million raisethis week at an $11 billion valuation, and it is increasingly shared across the AI industry.OpenAIandGooglehave both made voice a central focus of their next-generation models, while Apple appears to be quietly building voice-adjacent, always-on technologies throughacquisitions like Q.ai.As AI spreads into wearables, cars, and other new hardware, control is becoming less about tapping screens and more about speaking, making voice a key battleground for the next phase of AI development.\n\nIconiq Capital general partner Seth Pierrepont echoed that view onstage at Web Summit, arguing that while screens will continue to matter for gaming and entertainment, traditional input methods like keyboards are starting to feel “outdated.”\n\nAnd as AI systems become more agentic, Pierrepont said, the interaction itself will also change, with models gaining guardrails, integrations, and context needed to respond with less explicit prompting from users.\n\nStaniszewski pointed to that agentic shift as one of the biggest changes underway. Rather than spelling out every instruction, he said future voice systems will increasingly rely on persistent memory and context built up over time, making intera",
      "excerpt": "ElevenLabs co-founder and CEO Mati Staniszewski says voice is becoming the next major interface for AI – the way people will increasingly interact with machines as models move beyond text and screens.\n\nSpeaking atWeb Summit in Doha, Staniszewski told TechCrunch voice models like those developed by E",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Data breach at govtech giant Conduent balloons, affecting millions more Americans",
      "link": "https://techcrunch.com/2026/02/05/data-breach-at-govtech-giant-conduent-balloons-affecting-millions-more-americans/",
      "author": "Zack Whittaker",
      "date": "2026-02-05T07:25:38-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/12/data-breach-2024-roundup.jpg?resize=1200,675",
      "category": "Security",
      "content": "A data breach at government technology giant Conduent appears to affect far more people than first disclosed, with the number of victims potentially stretching to dozens of millions of people across the United States.\n\nThe January 2025 ransomware attack, whichknocked out Conduent’s operations for several days, is now known to affect at least 15.4 million people in Texas alone, accounting for about half of the state’s population. Conduent said in October that 4 million people across the state were affected.\n\nAnother 10.5 million people are affected across Oregon, per the state’s attorney general.\n\nConduent has also notified hundreds of thousands of people across Delaware, Massachusetts, New Hampshire, and other states, according to data breach notifications seen by TechCrunch.\n\nThe stolen data includes individuals’ names, Social Security numbers, medical data, and health insurance information.\n\nOne of the largest government contractors today, Conduent handles and processes large amounts of personal and sensitive information on behalf of large corporations, government departments, andseveral U.S. states. The companysaysits technology and operational support services reach more than 100 million people in the United States across various government healthcare programs.\n\nWhen contacted with several questions about the data breach, Conduent spokesperson Sean Collins provided a boilerplate statement that did not address the questions, nor did they answer if Conduent knows how many individuals are affected by the cyberattack. The spokesperson would not say if the breach affects more than 100 million people.\n\nCollins said that the company has been working to “conduct a detailed analysis of the affected files to identify the personal information” taken in the breach but would not say how many data breach notifications the company has sent out to date.\n\nLittle else is known about the breach, and the company has disclosed few details. Conduentdisclosed the cyberattack in April,",
      "excerpt": "A data breach at government technology giant Conduent appears to affect far more people than first disclosed, with the number of victims potentially stretching to dozens of millions of people across the United States.\n\nThe January 2025 ransomware attack, whichknocked out Conduent’s operations for se",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "A16z VC wants founders to stop stressing over insane ARR numbers",
      "link": "https://techcrunch.com/2026/02/05/a16z-vc-wants-founders-to-stop-stressing-over-insane-arr-numbers/",
      "author": "Julie Bort",
      "date": "2026-02-05T13:28:46-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2023/04/GettyImages-1270910681.jpg?resize=1200,772",
      "category": "Venture",
      "content": "The AI investing boom (or perhaps bubble) is something Silicon Valley has seen many times before: a gold rush of VC money thrown at the Big New Thing. But one aspect of it iscompletely unique to these times: startups rocketing from $0 to as much as $100 million in annual recurring revenue,sometimes in a matter of months.\n\nWord on the street is that many a VC won’t even look at a startup that’s not on the ARR superhighway,aiming for $100 million in ARR before their Series Afunding round.\n\nBut Andreessen Horowitz general partner Jennifer Li⁠, who helps oversee many of the firm’s most important AI companies, warns that some of the ARR mania is based on myths.\n\n“Not all ARR is created equal, and not all growth is equal either,”Li said on an episode of TechCrunch’s Equity podcast. She said to be especially skeptical of a founder announcing spectacular ARR numbers or growth in a tweet.\n\nNow, there is a legit, well-recognized term in accounting called annual recurring revenue, which refers to the annualized value of contracted, recurring subscription revenue. Essentially, that’s a guaranteed level of revenue because it comes from customers on a contract.\n\nBut what many of these founders are tweeting about is really “revenue run rate” —  taking whatever money was paid in a period of time and annualizing it. That’s not the same.\n\n“There’s a lot of missing nuances of the business quality, retention, and durability that’s missing in that conversation,” Li warned.\n\nA founder may have just had a killer month of sales, but not every month will necessarily repeat it. Or a startup may have a lot of short-term customers doing pilot programs, so revenue isn’t guaranteed to stick around after the pilot period.\n\nNormally, such boasts about growth via tweets should be treated for what they are: don’t believe everything you read on the internet at face value.\n\nBut because fast-growth is a hallmark of AI startups, such claims are “introducing a lot of anxiety” to inexperienced founders wh",
      "excerpt": "The AI investing boom (or perhaps bubble) is something Silicon Valley has seen many times before: a gold rush of VC money thrown at the Big New Thing. But one aspect of it iscompletely unique to these times: startups rocketing from $0 to as much as $100 million in annual recurring revenue,sometimes ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "OpenAI launches new agentic coding model only minutes after Anthropic drops its own",
      "link": "https://techcrunch.com/2026/02/05/openai-launches-new-agentic-coding-model-only-minutes-after-anthropic-drops-its-own/",
      "author": "Lucas Ropek",
      "date": "2026-02-05T12:01:39-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/09/GettyImages-2224158119.jpg?resize=1200,837",
      "category": "",
      "content": "On Monday,OpenAI launched Codex, an agentic coding tool marketed to software developers. Today, OpenAI also launched a new model designed to turbo-charge Codex:GPT-5.3 Codex.\n\nThe company says that the model transforms Codex from an agent that can merely “write and review code” to one that can do “nearly anything developers and professionals do on a computer, expanding who can build software and how work gets done.” Having tested its new model against a number of performance benchmarks, OpenAI claims that it can create “highly functional complex games and apps from scratch over the course of days.”\n\nOpenAI says that GPT-5.3 Codex is also 25 percent faster than its previous model (GPT-5.2) and that it was the company’s first model that “was instrumental in creating itself,” meaning that the company’s staff used early versions of the program to debug itself and evaluate how it was performing.\n\nThe new model release notably follows hot on the heels of anew agentic coding modelreleased by its competitor, Anthropic. Indeed, OpenAI and Anthropic had originally planned to release their two agentic coding tools at the exact same time: 10 a.m. PST. However, not long before the original release time, Anthropic moved its release date up by 15 minutes, slightly besting OpenAI in the race to publicize the models.",
      "excerpt": "On Monday,OpenAI launched Codex, an agentic coding tool marketed to software developers. Today, OpenAI also launched a new model designed to turbo-charge Codex:GPT-5.3 Codex.\n\nThe company says that the model transforms Codex from an agent that can merely “write and review code” to one that can do “n",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}