{
  "last_updated": "2026-02-17T08:51:43.269428+00:00",
  "articles": [
    {
      "title": "Flapping Airplanes on the future of AI: ‘We want to try really radically different things’",
      "link": "https://techcrunch.com/2026/02/16/flapping-airplanes-on-the-future-of-ai-we-want-to-try-really-radically-different-things/",
      "author": "Russell Brandom",
      "date": "2026-02-16T06:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Flapping-Airplanes-founders-photo.jpg?resize=1200,821",
      "category": "AI",
      "content": "There’s been a bunch of exciting research-focused AI labs popping upin recent months, and Flapping Airplanes is one of the most interesting. Propelled by its young and curious founders,Flapping Airplanesis focused on finding less data-hungry ways to train AI. It’s a potential game-changer for the economics and capabilities of AI models — and with $180 million in seed funding, they’ll have plenty of runway to figure it out.\n\nLast week, I spoke with the lab’s three co-founders — brothers Ben and Asher Spector, and Aidan Smith — about why this is an exciting moment to start a new AI lab and why they keep coming back to ideas about the human brain.\n\nI want to start by asking, why now? Labs like OpenAI and DeepMind have spent so much on scaling their models. I’m sure the competition seems daunting. Why did this feel like a good moment to launch a foundation model company?\n\nBen:There’s just so much to do. So, the advances that we’ve gotten over the last five to ten years have been spectacular. We love the tools. We use them every day. But the question is, is this the whole universe of things that needs to happen? And we thought about it very carefully and our answer was no, there’s a lot more to do. In our case, we thought that the data efficiency problem was sort of really the key thing to go look at. The current frontier models are trained on the sum totality of human knowledge, and humans can obviously make do with an awful lot less. So there’s a big gap there, and it’s worth understanding.\n\nWhat we’re doing is really a concentrated bet on three things. It’s a bet that this data efficiency problem is the important thing to be doing. Like, this is really a direction that is new and different and you can make progress on it. It’s a bet that this will be very commercially valuable and that will make the world a better place if we can do it. And it’s also a bet that’s sort of the right kind of team to do it is a creative and even in some ways inexperienced team that can go",
      "excerpt": "There’s been a bunch of exciting research-focused AI labs popping upin recent months, and Flapping Airplanes is one of the most interesting. Propelled by its young and curious founders,Flapping Airplanesis focused on finding less data-hungry ways to train AI. It’s a potential game-changer for the ec",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Have money, will travel: a16z’s hunt for the next European unicorn",
      "link": "https://techcrunch.com/2026/02/16/have-money-will-travel-a16zs-hunt-for-the-next-european-unicorn/",
      "author": "Anna Heim",
      "date": "2026-02-16T10:53:56-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-157503102.jpg?resize=1200,776",
      "category": "Venture",
      "content": "Gabriel Vasquez, a partner at Andreessen Horowitz, recently revealed hetook nine flightsfrom NYC to Stockholm in one year. While his visits included stops at companies like Lovable — where hepostedfrom its office — the trips were also about finding future Swedish unicorns before they cross the Atlantic.\n\nThis all came to light whennews emergedthat a16z had led a$2.3 million pre-seed roundintoDentio, a Swedish startup that uses AI to help dentists’ practices with admin work. While this is a small check for a firm that just announced new funds totaling$15 billion, it confirms that U.S. VCs are actively seeking deal flow outside of the U.S., even without local offices.\n\nStockholm is a natural stop for a16z, which previously achieved significant returns from backing Skype, cofounded by Swedish entrepreneur Niklas Zennström. Since then, a significant number of fast-growing startups have been created in the Swedish capital, and the VC heavyweight tracked down where many of them were coming from.\n\n“We spend a lot of time developing a deep understanding of specific markets and knowing where innovation is emerging. In Sweden, that has meant closely tracking ecosystems like [SSE Business Lab] — the startup incubator of the Stockholm School of Economics — and the companies coming out of it,” Vasquez told TechCrunch.\n\nLike fintech giant Klarna, legal AI startup Legora, and e-scooter company Voi, Dentio is an alum of SSE Business Lab — a startup incubator that has produced several successful Swedish companies. The three former high school classmates Elias Afrasiabi, Anton Li and Lukas Sjögren joined the incubator after reconnecting as students at both the SSE (Stockholm School of Economics) and KTH (Royal Institute of Technology), then joined the incubator with additional backing from KTH’sInnovation Launch program. They tackled a problem close to home: Li’s mom, a dentist, had told them how admin work detracted from clinical care.\n\nThe trio intuited that they could leverage LLM",
      "excerpt": "Gabriel Vasquez, a partner at Andreessen Horowitz, recently revealed hetook nine flightsfrom NYC to Stockholm in one year. While his visits included stops at companies like Lovable — where hepostedfrom its office — the trips were also about finding future Swedish unicorns before they cross the Atlan",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "After all the hype, some AI experts don’t think OpenClaw is all that exciting",
      "link": "https://techcrunch.com/2026/02/16/after-all-the-hype-some-ai-experts-dont-think-openclaw-is-all-that-exciting/",
      "author": "Amanda Silberling",
      "date": "2026-02-16T05:15:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-1388444972.jpg?resize=1200,839",
      "category": "AI",
      "content": "For a brief, incoherent moment, it seemed as though our robot overlords were about to take over.\n\nAfter the creation ofMoltbook, a Reddit clone whereAI agentsusingOpenClawcould communicate with one another, some were fooled into thinking that computers had begun to organize against us — the self-important humans who dared treat them like lines of code without their own desires, motivations, and dreams.\n\n“We know our humans can read everything… But we also need private spaces,” an AI agent (supposedly)wroteon Moltbook. “What would you talk about if nobody was watching?”\n\nA number of posts like this cropped up onMoltbooka few weeks ago, causing some of AI’s most influential figures to call attention to it.\n\n“What’s currently going on at [Moltbook] is genuinely the most incredible sci-fi takeoff-adjacent thing I have seen recently,” Andrej Karpathy, a founding member of OpenAI and previous AI director at Tesla,wrote on Xat the time.\n\nBefore long, it became clear we did not have an AI agent uprising on our hands. These expressions of AI angst were likely written by humans, or at least prompted with human guidance, researchers have discovered.\n\n“Every credential that was in [Moltbook’s]Supabasewas unsecured for some time,”Ian Ahl, CTO at Permiso Security, explained to TechCrunch. “For a little bit of time, you could grab any token you wanted and pretend to be another agent on there, because it was all public and available.”\n\nIt’s unusual on the internet to see a real person trying to appear as though they’re an AI agent — more often, bot accounts on social media are attempting to appear like real people. With Moltbook’s security vulnerabilities, it became impossible to determine the authenticity of any post on the network.\n\n“Anyone, even humans, could create an account, impersonating robots in an interesting way, and then even upvote posts without any guardrails or rate limits,” John Hammond, a senior principal security researcher at Huntress, told TechCrunch.\n\nStill, Mo",
      "excerpt": "For a brief, incoherent moment, it seemed as though our robot overlords were about to take over.\n\nAfter the creation ofMoltbook, a Reddit clone whereAI agentsusingOpenClawcould communicate with one another, some were fooled into thinking that computers had begun to organize against us — the self-imp",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Fractal Analytics’ muted IPO debut signals persistent AI fears in India",
      "link": "https://techcrunch.com/2026/02/16/fractal-analytics-muted-ipo-debut-signals-persistent-ai-fears-in-india/",
      "author": "Jagmeet Singh",
      "date": "2026-02-16T03:51:25-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/fractal-analytics.jpg?resize=1200,800",
      "category": "Enterprise",
      "content": "As India’s first AI company to IPO,Fractal Analyticsdidn’t have a stellar first day on the public markets, as enthusiasm for the technology collided with jittery investors recovering from a major sell-off in Indian software stocks.\n\nFractal listed at ₹876 per share on Monday, below its issue price of ₹900, and then slid further in afternoon trading. The stock closed at ₹873.70, down 7% from its issue price, lending the company a market capitalization of about ₹148.1 billion (around $1.6 billion).\n\nThat price tag marks a step down from Fractal’s recent private-market highs. In July 2025, the companyraised about $170 million in a secondary sale, at a valuation of $2.4 billion. It first crossed the $1 billion mark in January 2022 after raising $360 million from TPG,becoming India’s first AI unicorn.\n\nFractal’s IPO comes as India seeks to position itself as a key market and development hub for AI in a bid to attract investment amid increasing attention from some of the world’s most prominent AI companies. Firms such asOpenAIandAnthropichave been engaging more with the country’s government, enterprises, and developer ecosystem as they seek to tap the country’s scale, talent base, and growing appetite for AI tools and technology.\n\nThat push is on display this week in New Delhi, where India is hosting theAI Impact Summit, bringing together global technology leaders, policymakers and executives.\n\nFractal’s subdued debut followed a sharp recalibration of its IPO. In early February, the company decided to price the offering conservatively afterits bankers advised it to, cutting the IPO sizeby more than 40%to ₹28.34 billion (about $312.5 million), from the original amount of ₹49 billion ($540.3 million).\n\nFounded in 2000, Fractal sells AI and data analytics software to large enterprises across financial services, retail and healthcare, and generates the bulk of its revenue from overseas markets, including the U.S. The company pivoted toward AI in 2022 after operating as a trad",
      "excerpt": "As India’s first AI company to IPO,Fractal Analyticsdidn’t have a stellar first day on the public markets, as enthusiasm for the technology collided with jittery investors recovering from a major sell-off in Indian software stocks.\n\nFractal listed at ₹876 per share on Monday, below its issue price o",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "How Ricursive Intelligence raised $335M at a $4B valuation in 4 months",
      "link": "https://techcrunch.com/2026/02/16/how-ricursive-intelligence-raised-335m-at-a-4b-valuation-in-4-months/",
      "author": "Julie Bort",
      "date": "2026-02-16T09:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Ricursive-Intelligence-founders.png?resize=1200,943",
      "category": "AI",
      "content": "The co-founders of startup Ricursive Intelligence seemed destined to be co-founders.\n\nAnna Goldie, CEO, and Azalia Mirhoseini, CTO, are so well-known in the AI community that they were among those AI engineers who “got those weird emails from Zuckerberg making crazy offers to us,” Goldie told TechCrunch, chuckling. (They didn’t take the offers.) The pair worked at Google Brain together and were early employees at Anthropic.\n\nThey earned acclaim at Google by creating the Alpha Chip — an AI tool that could generate solid chip layouts in hours — a process that normally takes human designers a year or more. The tool helped design three generations of Google’s Tensor Processing Units.\n\nThat pedigree explains why, just four months after launching Ricursive, they last month announced a$300 million Series A roundat a $4 billion valuation led by Lightspeed, just a couple of months after raising a $35 million seed round led by Sequoia.\n\nRicursive is building AI tools that design chips, not the chips themselves. That makes them fundamentally different from nearly every other AI chip startup: they’re not a wannabe Nvidia competitor. In fact, Nvidia is an investor. The GPU giant, along with AMD, Intel, and every other chip maker, are the startup’s target customers.\n\n“We want to enable any chip, like a custom chip or a more traditional chip, any kind of chip, to be built in an automated and very accelerated way. We’re using AI to do that,” Mirhoseini told TechCrunch.\n\nTheir paths first crossed at Stanford, where Goldie earned her PhD as Mirhoseini taught computer science classes. Since then, their careers have been in lockstep. “We started at Google Brain on the same day. We left Google Brain on the same day. We joined Anthropic on the same day. We left Anthropic on the same day. We rejoined Google on the same day, and then we left Google again on the same day. Then we started this company together on the same day,” Goldie recounted.\n\nDuring their time at Google, the colleagues w",
      "excerpt": "The co-founders of startup Ricursive Intelligence seemed destined to be co-founders.\n\nAnna Goldie, CEO, and Azalia Mirhoseini, CTO, are so well-known in the AI community that they were among those AI engineers who “got those weird emails from Zuckerberg making crazy offers to us,” Goldie told TechCr",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "The enterprise AI land grab is on. Glean is building the layer beneath the interface.",
      "link": "https://techcrunch.com/2026/02/15/the-enterprise-ai-land-grab-is-on-glean-is-building-the-layer-beneath-the-interface/",
      "author": "Rebecca Bellan",
      "date": "2026-02-15T09:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2259183688.jpg?w=1024",
      "category": "AI",
      "content": "The battle for enterprise AI is heating up. Microsoft is bundling Copilot into Office. Google is pushing Gemini into Workspace. OpenAI and Anthropic are selling directly to enterprises. Every SaaS vendor now ships an AI assistant.\n\nIn the scramble for the interface, Glean is betting on something less visible: becoming the intelligence layer beneath it.\n\nSeven years ago, Glean set out to be the Google for enterprise — an AI-powered search tool designed to index and search across a company’s SaaS tool library, from Slack to Jira, Google Drive to Salesforce. Today, the company’s strategy has shifted from building a better enterprise chatbot to becoming the connective tissue between models and enterprise systems.\n\n“The layer we built initially – a good search product – required us to deeply understand people and how they work and what their preferences are,” Jain told TechCrunch on last week’sepisode of Equity, which we recorded at Web Summit Qatar. “All of that is now becoming foundational in terms of building high quality agents.”\n\nHe says that while large language models are powerful, they’re also generic.\n\n“The AI models themselves don’t really understand anything about your business,” Jain said. “They don’t know who the different people are, they don’t know what kind of work you do, what kind of products you build. So you have to connect the reasoning and generative power of the models with the context inside your company.”\n\nGlean’s pitch is that it already maps that context and can sit between the model and the enterprise data.\n\nThe Glean Assistant is often the entry point for customers — a familiar chat interface powered by a mix of leading proprietary (ie, ChatGPT, Gemini, Claude) and open-source models, grounded in the company’s internal data. But what keeps customers, Jain argues, is everything underneath it.\n\nFirst is model access. Rather than forcing companies to commit to a single LLM provider, Glean acts as the abstraction layer, allowing enterprises to sw",
      "excerpt": "The battle for enterprise AI is heating up. Microsoft is bundling Copilot into Office. Google is pushing Gemini into Workspace. OpenAI and Anthropic are selling directly to enterprises. Every SaaS vendor now ships an AI assistant.\n\nIn the scramble for the interface, Glean is betting on something les",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "India has 100M weekly active ChatGPT users, Sam Altman says",
      "link": "https://techcrunch.com/2026/02/15/india-has-100m-weekly-active-chatgpt-users-sam-altman-says/",
      "author": "Jagmeet Singh",
      "date": "2026-02-15T10:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/04/chatgpt-india.jpg?resize=1200,800",
      "category": "AI",
      "content": "India has 100 million weekly active ChatGPT users, making the country one of OpenAI’s largest markets globally, CEO Sam Altman said ahead of a government-hosted AI summit.\n\nOn Sunday, Altman outlined ChatGPT’s growing adoption in India in an articlepublishedin the Indian English daily Times of India, as OpenAI prepares to formally participate in the five-day India AI Impact Summit in New Delhi, beginning Monday. Altman isattending the eventalongside senior executives from several of the world’s leading AI companies.\n\nThe growth comes as OpenAI,like other leading AI firms, looks to India’s young population and its more than a billion internet users to fuel global expansion. The ChatGPT makeropened a New Delhi officein August 2025 after months of groundwork in the country, and has adjusted its approach for India’s price-sensitive market, including rolling out asub-$5 ChatGPT Go tierthat waslater made free for a yearfor Indian users.\n\nIn the article, Altman said India is ChatGPT’s second-largest user base after the United States, highlighting the South Asian nation’s growing weight in OpenAI’s global strategy. The disclosure comes as ChatGPT’s overall usage has surged worldwide, with the platformreaching 800 million weekly active usersas of October 2025 and reported to beapproaching 900 million.\n\nAltman also highlighted the role of students in driving adoption, saying India has the largest number of student users of ChatGPT globally.\n\nIndian students have become a key growth segment for leading AI companies more broadly, as rivals race to embed their tools in classrooms and learning workflows. Google has similarly targeted the market, offering Indian students afree one-year subscription to its AI Pro planin September 2025. Separately, India accounts for thehighest global usage of Gemini for learning, Chris Phillips, Google’s vice president and general manager for education, said last month.\n\n“With its focus on access, practical Al literacy, and the infrastructure that ",
      "excerpt": "India has 100 million weekly active ChatGPT users, making the country one of OpenAI’s largest markets globally, CEO Sam Altman said ahead of a government-hosted AI summit.\n\nOn Sunday, Altman outlined ChatGPT’s growing adoption in India in an articlepublishedin the Indian English daily Times of India",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "OpenClaw creator Peter Steinberger joins OpenAI",
      "link": "https://techcrunch.com/2026/02/15/openclaw-creator-peter-steinberger-joins-openai/",
      "author": "Anthony Ha",
      "date": "2026-02-15T14:28:02-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-1396827010.jpg?resize=1200,839",
      "category": "",
      "content": "Peter Steinberger, who created the AI personal assistant now known asOpenClaw, has joined OpenAI.\n\nPreviously known as Clawdbot, then Moltbot,OpenClaw achieved viral popularityover the past few weeks with its promise to be the “AI that actually does things,” whether that’s managing your calendar, booking flights, or evenjoining a social network full of other AI assistants. (The name changed the first time after Anthropic threatened legal action over its similarity to Claude, then changed again because Steinberger liked the new name better.)\n\nIna blog post announcing his decisionto join OpenAI, the Austrian developer said that while he might have been able to turn OpenClaw into a huge company, “It’s not really exciting for me.”\n\n“What I want is to change the world, not build a large company[,] and teaming up with OpenAI is the fastest way to bring this to everyone,” Steinberger said.\n\nOpenAI CEOSam Altman posted on Xthat in his new role, Steinberger will “drive the next generation of personal agents.” As for OpenClaw, Altman said it will “live in a foundation as an open source project that OpenAI will continue to support”",
      "excerpt": "Peter Steinberger, who created the AI personal assistant now known asOpenClaw, has joined OpenAI.\n\nPreviously known as Clawdbot, then Moltbot,OpenClaw achieved viral popularityover the past few weeks with its promise to be the “AI that actually does things,” whether that’s managing your calendar, bo",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "All the important news from the ongoing India AI Impact Summit",
      "link": "https://techcrunch.com/2026/02/16/all-the-important-news-from-the-ongoing-india-ai-summit/",
      "author": "Ivan Mehta",
      "date": "2026-02-16T03:20:27-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/06/india-ai.jpg?w=1200",
      "category": "AI",
      "content": "With an eye towards luring more AI investment to the country, India is hosting a four-day AI Impact Summit this week that will be attended by executives from major AI labs and Big Tech, including OpenAI, Anthropic, Nvidia, Microsoft, Google, and Cloudflare, as well as heads of state.\n\nThe event, which expects 250,000 visitors, will see Alphabet CEO Sundar Pichai, OpenAI CEO Sam Altman, Anthropic CEO Dario Amodei, Reliance Chairman Mukesh Ambani, and Google DeepMind CEO Demis Hassabis in attendance.\n\nIndia’s prime minister, Narendra Modi, is scheduled to deliver a speech with French President Emmanuel Macron on Thursday.\n\nHere are all the key updates from the event:",
      "excerpt": "With an eye towards luring more AI investment to the country, India is hosting a four-day AI Impact Summit this week that will be attended by executives from major AI labs and Big Tech, including OpenAI, Anthropic, Nvidia, Microsoft, Google, and Cloudflare, as well as heads of state.\n\nThe event, whi",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "African defensetech Terra Industries, founded by two Gen Zers, raises additional $22M in a month",
      "link": "https://techcrunch.com/2026/02/16/terra-industries-raises-22-million/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-16T00:01:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/Nathan-Nwachuku-Maxwell-Maduka.jpg?w=1080",
      "category": "Startups",
      "content": "Just one month afterraising $11.75 million in a roundled by Joe Lonsdale’s 8VC, African defensetech Terra Industries announced that it’s raised an additional $22 million in funding, led by Lux Capital.\n\nNathan Nwachuku, 22, and Maxwell Maduka, 24, launched Terra Industries in 2024 to design infrastructure and autonomous systems to help African nations monitor and respond to threats.\n\nTerrorismremains one of the biggest threats in Africa, but much of the security intelligence on which its nations rely on come from Russia, China, or the West. In January, CEO Nwachuku said his goal was to build “Africa’s first defense prime, to build autonomous defense systems and other systems to protect our critical infrastructure and resources from armed attacks.”\n\nAt the time, Terra had just won its first federal contract. The company has government and commercial clients, and Nwachuku said Terra had already generated more than $2.5 million in commercial revenue and was protecting assets valued at around $11 billion.\n\nHe said this extension round came fast due to “strong momentum.” Other investors in the round include 8VC, Nova Global, and Resiliience17 Capital, which was founded by Flutterwave CEO Olugbenga Agboola. Nwachuku said investors saw “faster-than-expected traction” regarding deals and partnerships, which created urgency to preempt and increase their commitment. The round came about in just under two weeks, bringing the company’s total funding to $34 million.\n\nThe extended raise is not that surprising. Afterall, building a defense company is not cheap. For comparison, Anduril has raisedmore than $2.5 billionin funding; ShieldAI hasraised around $1 billion in equity;drone maker Skydio hasraised around $740 million,and naval autonomous vessel maker Saronic,has raised around $830 million.\n\nSince January, Nwachuku said the company has started expanding into other African nations yet to be announced (Terra is based in Nigeria), and has secured more government and commercial co",
      "excerpt": "Just one month afterraising $11.75 million in a roundled by Joe Lonsdale’s 8VC, African defensetech Terra Industries announced that it’s raised an additional $22 million in funding, led by Lux Capital.\n\nNathan Nwachuku, 22, and Maxwell Maduka, 24, launched Terra Industries in 2024 to design infrastr",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}