{
  "last_updated": "2026-02-13T17:41:06.211504+00:00",
  "articles": [
    {
      "title": "A Stanford grad student created an algorithm to help his classmates find love; now, Date Drop is the basis of his new startup",
      "link": "https://techcrunch.com/2026/02/13/a-stanford-grad-student-created-an-algorithm-to-help-his-classmates-find-love-now-date-drop-is-the-basis-of-his-new-startup/",
      "author": "Amanda Silberling",
      "date": "2026-02-13T08:24:53-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/headshot.jpg?resize=898,1200",
      "category": "Apps",
      "content": "As Valentine’s Day approaches at Stanford, some students may be gearing up for first dates — not with people they met on Tinder or Hinge, but with matches from a service calledDate Drop, designed by Stanford graduate student Henry Weng. Date Drop pairs students with potential dates once per week based on their responses to a questionnaire.\n\nA Stanford whiz kid is trying to disrupt an established industry from his Palo Alto dorm?Stop meifyou’ve heard thisonebefore! But young adults are deeplydisillusionedwith the frustrating, demoralizingstate of online dating. Why not try something different?\n\nOver 5,000 students at Stanford have given Date Drop a try since its launch in the fall. It has also rolled out at 10 more schools, including MIT, Princeton, and the University of Pennsylvania, and Weng says he wants to roll out Date Drop more broadly in some cities this summer.\n\n“Our matches convert to actual dates at about 10x the rate of Tinder,” Weng told TechCrunch. “Instead of swiping, we get to know each person deeply and send them one compatible match per week.”\n\nAt first, Weng didn’t intend to turn Date Drop into the foundation of a startup. Then, a close friend of his met their partner via Date Drop. “That was when I got the sense that this was less of a project,” he said.\n\nNow, Weng thinks of Date Drop as just the first service from his startup, TheRelationship Company, which is a public benefit corporation — a type of company legally required to consider social impact alongside profits.\n\n“This started as something I just wanted to exist on campus, and it became a company because people kept on asking for it in their schools and I needed resources to do that,” he said.\n\nAlready, Weng has raised “a few million” from some angel investors, including Zynga founder and early Facebook backer Mark Pincus, who has taught business courses at Stanford (including to Weng). Andy Chen, a former partner at Coatue, and Elad Gil, an early backer of Airbnb, Stripe, and Pinterest, al",
      "excerpt": "As Valentine’s Day approaches at Stanford, some students may be gearing up for first dates — not with people they met on Tinder or Hinge, but with matches from a service calledDate Drop, designed by Stanford graduate student Henry Weng. Date Drop pairs students with potential dates once per week bas",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Fusion startup Helion hits blistering temps as it races toward 2028 deadline",
      "link": "https://techcrunch.com/2026/02/13/fusion-startup-helion-hits-blistering-temps-as-it-races-toward-2028-deadline/",
      "author": "Tim De Chant",
      "date": "2026-02-13T02:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Helion-Polaris-D-T.jpeg?resize=1200,800",
      "category": "Climate",
      "content": "Fusion energy startupHelionannounced Friday that it has hit a key milestone in its quest for fusion power. Plasmas inside the company’s Polaris prototype reactor have reached 150 million degrees Celsius, three-quarters of the way toward what the company thinks it will need to operate a commercial fusion power plant.\n\n“We’re obviously really excited to be able to get to this place,” David Kirtley, Helion’s co-founder and CEO, told TechCrunch.\n\nPolaris is also operating using deuterium-tritium fuel — a mixture of two hydrogen isotopes — which Kirtley said makes Helion the first fusion company to do so. “We were able to see the fusion power output increase dramatically as expected in the form of heat,” he said.\n\nThe Everett, Washington-based startup is locked in a race with several other companies that are seeking to commercialize fusion power, a potentially unlimited source of clean energy.\n\nThat potential has investors rushing to bet on the technology. This week, Inertia Enterprises announced a$450 million Series Around that included Bessemer and GV. In January, Type One Energy told TechCrunch it was in themidst of raising $250 million, while last summer Commonwealth Fusion Systems raised$863 millionfrom investors including Google and Nvidia. Helion itself raised$425 millionlast year from a group that included Sam Altman, Mithril, Lightspeed, and SoftBank.\n\nWhile most other fusion startups are targeting the early 2030s to put electricity on the grid, Helion has a contract with Microsoft to sell it electricity starting in 2028, though that power would come from a larger commercial reactor called Orion that the company is currently building, not Polaris.\n\nEvery fusion startup has its own milestones based on the design of its reactor. Commonwealth Fusion Systems, for example, needs to heat its plasmas to more than 100 million degrees C inside of its tokamak, a doughnut-shaped device that uses powerful magnets to contain the plasma.\n\nHelion’s reactor is different, needin",
      "excerpt": "Fusion energy startupHelionannounced Friday that it has hit a key milestone in its quest for fusion power. Plasmas inside the company’s Polaris prototype reactor have reached 150 million degrees Celsius, three-quarters of the way toward what the company thinks it will need to operate a commercial fu",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Dutch phone giant Odido says millions of customers affected by data breach",
      "link": "https://techcrunch.com/2026/02/13/dutch-phone-giant-odido-says-millions-of-customers-affected-by-data-breach/",
      "author": "Zack Whittaker",
      "date": "2026-02-13T07:54:13-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/odido.jpg?resize=1200,810",
      "category": "Security",
      "content": "Dutch phone company Odido has confirmed a data breach affected millions of its customers.\n\nThe company said in astatementThursday that unidentified hackers gained access to its customer contact system and covertly downloaded reams of customer information. A spokesperson for Odido toldlocal Dutch mediathat the breach affects more than 6.2 million customers, or about a third of the country’s population.\n\nThe stolen data includes customer names, phone numbers, postal and email addresses, dates of birth, bank account numbers (IBAN), and details of customers’ government-issued IDs, such as passport or driver’s license numbers and dates of validity.\n\nThe company said former customers who had service within the past two years may also be affected.\n\nOdido said the data did not include customer call records, location data, billing information, or image scans of government IDs. The data does not affect business customers, the company said.\n\nThe breach affects customers of both Odido and itssubsidiary Ben NL. Both companies said that their phone, internet, and television operations were unaffected by the breach.\n\nThis is the latest in a series of data thefts targeting phone and telecommunication giants in recent years, as governments and financially motivated hackers continue to seek highly confidential information that telcos have on their customers.\n\nEarlier this week, the Singaporean governmentconfirmedthat a China-related hacking group had previously broken into four of the country’s top phone giants as part of a surveillance operation, but did not access customers’ personal information.\n\nAll the while, hackers associated with the China-backed threat group known as Salt Typhoon have hacked hundreds of phone companies around the world, including inCanada,Norway, theUnited Kingdom, and theUnited States, as part of an ongoing espionage campaign aimed at spying on senior government officials and diplomats.",
      "excerpt": "Dutch phone company Odido has confirmed a data breach affected millions of its customers.\n\nThe company said in astatementThursday that unidentified hackers gained access to its customer contact system and covertly downloaded reams of customer information. A spokesperson for Odido toldlocal Dutch med",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Waymo is asking DoorDash drivers to shut the doors of its self-driving cars",
      "link": "https://techcrunch.com/2026/02/12/waymo-is-asking-doordash-drivers-to-shut-the-doors-of-its-self-driving-cars/",
      "author": "Amanda Silberling",
      "date": "2026-02-12T20:41:41-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/waymo-getty-streets.jpg?resize=1200,800",
      "category": "Transportation",
      "content": "It still feels like a technological marvel: Waymo’s autonomous cars are now transporting passengers across six cities. Alas, this driverless future comes with its own set of problems. These vehicles can be rendered inert if a passenger accidentally leaves the door open.\n\nAccording toa Reddit post, one DoorDash driver discovered this issue when an odd request appeared in their queue. Instead of making a delivery, the driver was offered $6.25 to drive less than one mile to a Waymo vehicle and close its door. After “verified completion,” they would get an extra $5.\n\n“You actually ‘door’ dashed,” one commenter noted.\n\nIt seems too ironic to be real. Waymo vehicles represent technological breakthroughs that once seemed unfathomable. The Alphabet-owned company just raised$16 billionto take its driverless cars international!\n\nBut Waymo and DoorDash confirmed to TechCrunch that this Reddit post is legitimate. This is, in fact, a real problem.\n\n“Waymo is currently running a pilot program in Atlanta to enhance its AV fleet efficiency. In the rare event a vehicle door is left ajar, preventing the car from departing, nearby Dashers are notified, allowing Waymo to get its vehicles back on the road quickly,” Waymo and DoorDash said in a joint response. (The door-closing partnership, which beganearlier this year, is just one facet of Waymo and DoorDash’s broader relationship. In October, the companies launched an autonomous delivery service in Phoenix, where Waymo vehicles deliver food and groceries to DoorDash customers.)\n\nIf a Waymo door is left open, it’s worth it to the company to pay someone to close it — the car cannot complete any more rides if it’s left immobile. Not to mention, an unmoving car could block the flow of traffic.\n\nThis isn’t the first time Waymo has enlisted help with its door troubles. In Los Angeles, Waymo works withHonk, an app that’s like Uber for towing services. According to reports, Honk users in L.A. have been offeredup to $24to close a Waymo door — m",
      "excerpt": "It still feels like a technological marvel: Waymo’s autonomous cars are now transporting passengers across six cities. Alas, this driverless future comes with its own set of problems. These vehicles can be rendered inert if a passenger accidentally leaves the door open.\n\nAccording toa Reddit post, o",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Musk needed a new vision for SpaceX and xAI. He landed on Moonbase Alpha.",
      "link": "https://techcrunch.com/2026/02/12/musk-needed-a-new-vision-for-spacex-and-xai-he-landed-on-moonbase-alpha/",
      "author": "Tim Fernholz",
      "date": "2026-02-12T14:10:55-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Screenshot-2026-02-12-at-10.37.51-AM.png?resize=1200,666",
      "category": "AI",
      "content": "“Join xAI if the idea of mass drivers on the Moon appeals to you,” CEO Elon Muskproclaimedyesterday following a restructuring that saw a stream of former executivesexit the AI lab.\n\nThis is an interesting recruitment strategy after the company’s merger with Musk’s rocket maker, SpaceX, and the combined company’s anticipated IPO. You might think that xAI employees ought to be fascinated with achieving AGI, using deep learning models to disrupt traditional software companies, or simply bad wordplay like “Macrohard.” But instead, Elon is going to the moon.\n\nAfter outlining plans tobuild AI data centers in orbit, the primary synergy between the two companies, Musk took the idea further. “What if you want to go beyond a mere terawatt per year?” Musk asked. “To do that, you have to go to the moon…I really want to see a mass driver on the moon that is shooting AI satellites into deep space.”\n\nIn Musk’s telling, the step beyond data centers orbiting Earth is even larger computers in deep space. And furthermore, Musk says the best way to achieve that is to build a city on the moon to manufacture space computers and hurl them into the solar system using a big maglev train.\n\nIf that all feels a bit much, veteran Musk watchers know there’s a clue about where the discussion appears in a video of anall-hands meetingxAI shared with the public. The slide describing the moon base comes at the end of the presentation deck, where, during SpaceX pep talks, Musk typically shares renderings of SpaceX rockets landing on Mars and waxes rhapsodic about the future of multi-planetary humanity.\n\nNotably, the moon base comes just after SpaceX has publicly backed away from its long-held goal of colonizing Mars. Now, with xAI in the corporate fold, Musk needs a new science fiction metaphor for the future: In this case, theKardashev Scale, a theoretical measure of galactic civilizations coined by the eponymous Soviet astronomer in the 1960s. The idea is climbing the scale of energy usage — early c",
      "excerpt": "“Join xAI if the idea of mass drivers on the Moon appeals to you,” CEO Elon Muskproclaimedyesterday following a restructuring that saw a stream of former executivesexit the AI lab.\n\nThis is an interesting recruitment strategy after the company’s merger with Musk’s rocket maker, SpaceX, and the combi",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Amid disappointing earnings, Pinterest claims it sees more searches than ChatGPT",
      "link": "https://techcrunch.com/2026/02/12/amid-disappointing-earnings-pinterest-claims-it-sees-more-searches-than-chatgpt/",
      "author": "Sarah Perez",
      "date": "2026-02-12T15:26:56-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/pinterest-header.jpg?resize=1200,800",
      "category": "Social",
      "content": "After a particularlypoor performanceon its fourth-quarter earnings, Pinterest CEO Bill Ready attempted to favorably compare the digital pinboarding site to the popular AI chatbot ChatGPT.\n\nTrying to highlight its potential as a unique search destination, Ready asserted that the site sees larger search volume than ChatGPT. According to third-party data, ChatGPT sees 75 billion searches per month, while Pinterest sees 80 billion searches and generates 1.7 billion monthly clicks, he said.\n\n“That makes us one of the largest search destinations in the world. And importantly, more than half of those searches are commercial in nature, compared to, I think . . . approximately 2% [of ChatGPT searches],” Ready added.\n\nPinterest in the fourth quarter missed expectations on both revenue and earnings per share, reporting $1.32 billion in revenue versus $1.33 billion expected, and earnings per share of 67 cents, compared to the 69 cents projected. It also forecast that first-quarter 2026 sales will come in between $951 million to $971 million, below the $980 million expected.\n\nThe company blamed its shortfall on larger advertisers pulling back on spend, particularly in Europe, and a new furniture tariff implemented in October that caused issues within the home category. It said those trends could worsen in the first quarter.\n\nSurprisingly, Pinterest missed on earnings despite a user base that’s growing faster than expected. The company reported monthly active users were up 12% year-over-year to 619 million, when Wall Street had forecast 613 million users.\n\nSharesdropped20% in after-hours trading.\n\nPinterest has long struggled to translate the high usage of its platform into ad dollars, as its users often go to Pinterest to plan and dream, not shop and buy. That challenge could become even more acute in the AI era, especially if advertisers shift their dollars to platforms where intent to buy is clearer — such as chatbot requests that ask for product recommendations.\n\nWhen asked a",
      "excerpt": "After a particularlypoor performanceon its fourth-quarter earnings, Pinterest CEO Bill Ready attempted to favorably compare the digital pinboarding site to the popular AI chatbot ChatGPT.\n\nTrying to highlight its potential as a unique search destination, Ready asserted that the site sees larger sear",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Rivian was saved by software in 2025",
      "link": "https://techcrunch.com/2026/02/12/rivian-was-saved-by-software-in-2025/",
      "author": "Kirsten Korosec",
      "date": "2026-02-12T15:17:32-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/07/250522-ANASTASIA-BENSON-GOOGLE-MAPS-AEB08056-FINAL.jpg?resize=1200,790",
      "category": "Transportation",
      "content": "Rivian is, by every measure, a maker and seller of EVs. But in 2025, it was the company’s software and services that helped its annual revenue grow by 8%.\n\nRivian reported Thursday $5.38 billion in total revenue in 2025, up from $4.97 billion from the prior year. That rosy picture dulls a bit when looking just at its automotive revenue, which fell 15% to $3.8 billion in 2025. The fall was fueled by a $134 million drop in regulatory credit sales and lower vehicle deliveries, which were partially offset by higher average selling prices, according to Rivian.\n\nMeanwhile, software and services revenue grew more than threefold to $1.55 billion for the year. And the joint venture with Volkswagen Group was behind most of that growth, according to Rivian. The “services” component of this line item, which Rivian doesn’t break out, includes a variety of items, including vehicle repair, vehicle trade-ins, and maintenance services. The remainder, and the bulk of the revenue, is from software, and specifically due to the joint venture with VW Group.\n\nVW and Rivian formed atechnology joint venturein 2024 that is worth up to $5.8 billion. The joint venture is milestone-based and in 2025 Rivian hit the mark, which meant a $1 billion payout in the form of a share sale. Under the terms of the JV, Rivian will supply VW Group with its existing electrical architecture and software technology stack.\n\nRivian received an initial $1 billion convertible note in 2024 and another$1 billion paymentin July 2025.\n\nRivian is expected to continue to receive payments from VW Group through 2027. Rivian is expected to receive an additional $2 billion of capital as part of the joint venture in 2026, CFO Claire McDonough said Thursday on the company earnings call. About $1 billion of that is subject to the successful completion of winter testing, which is underway. The remaining $1 billion is nonrecourse debt, which is expected to be received in October.\n\nAnd while the funds provide a hefty stopgap, Rivi",
      "excerpt": "Rivian is, by every measure, a maker and seller of EVs. But in 2025, it was the company’s software and services that helped its annual revenue grow by 8%.\n\nRivian reported Thursday $5.38 billion in total revenue in 2025, up from $4.97 billion from the prior year. That rosy picture dulls a bit when l",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Didero lands $30M to put manufacturing procurement on ‘agentic’ autopilot",
      "link": "https://techcrunch.com/2026/02/12/didero-lands-30m-to-put-manufacturing-procurement-on-agentic-autopilot/",
      "author": "Marina Temkin",
      "date": "2026-02-12T12:31:47-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Founders_Exterior_Mid-3.jpg?resize=1200,800",
      "category": "Startups",
      "content": "Tim Spencer realized just how complicated manufacturing procurement can be while runningMarkai, an e-commerce startupin Asia, during the pandemic.\n\n“We had thousands of suppliers, and we were distributing products into dozens of countries around the world,” Spencer (pictured left) told TechCrunch. His staff was overwhelmed by the manual complexity of sourcing suppliers, negotiating pricing, tracking orders, and managing payments.\n\n“I found myself running this big team that was not really set up for success,” he said. He sold Markai in 2023, just as it was becoming clear that generative AI could streamline the most time-consuming procurement hurdles for manufacturers and distributors.\n\nLater that year, Spencer launchedDiderowith Lorenz Pallhuber (pictured center), a veteran of McKinsey’s procurement practice, and Tom Petit, the former technical co-founder ofLandis.\n\nDidero, whose mission is to automate many of the complexities of global procurement, just raised a $30 million Series A co-led by Chemistry and Headline, with participation from Microsoft’s venture fund M12.\n\n“Global trade runs on natural language communication,” Spencer said. “It’s emails, WeChat, phone calls, purchase orders, and packing lists.”\n\nUntil the advent of generative AI, these fragmented pieces had to be tracked by humans who spent their days chasing suppliers and manually updating systems of record. Didero claims its platform can ingest that communication, putting a significant portion of the procurement workflow on autopilot.\n\nDidero functions as an agentic AI layer that sits on top of a company’s existing ERP, acting as a coordinator that reads incoming communications and automatically executes the necessary updates and tasks.\n\n“The goal is to go from ‘I need a good’ to payment without having to lift a finger,” Spencer said.\n\nUnlike Levelpath, Zip, or Oro Labs, which use AI to streamline corporate purchasing, Didero focuses on the supply chain. Its platform is designed for manufacturers and",
      "excerpt": "Tim Spencer realized just how complicated manufacturing procurement can be while runningMarkai, an e-commerce startupin Asia, during the pandemic.\n\n“We had thousands of suppliers, and we were distributing products into dozens of countries around the world,” Spencer (pictured left) told TechCrunch. H",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "India partners with Alibaba.com for export push despite past China tech bans",
      "link": "https://techcrunch.com/2026/02/13/india-partners-with-alibaba-com-for-export-push-despite-past-china-tech-bans/",
      "author": "Jagmeet Singh",
      "date": "2026-02-13T09:32:59-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/alibaba-com-jagmeet-singh-techcrunch.jpg?resize=1200,800",
      "category": "Government & Policy",
      "content": "India’s government has partnered with China’s Alibaba.com on an export-focused program aimed at helping startups and small businesses reach overseas buyers. The move highlights New Delhi’s selective engagement with Chinese-linked tech platforms years after itimposed sweeping banson consumer apps and games.\n\nThis week, the Indian government’s Startup India initiativeannouncedthe collaboration with Alibaba.com to identify and support Indian startups that can help onboard and scale Indian exporters on the group’s global B2B platform. The program offers commissions and technical support to those startups to assist small manufacturers and traders in reaching overseas markets.\n\nThe new partnership arrives after years of strained India–China relations. New Delhibanned dozens of Chinese-linked appsin 2020 following a deadly border clash, including major platforms such as TikTok, PUBG Mobile, and AliExpress, an e-commerce app operated by Alibaba Group. Those restrictions remain in place, making the Indian government’s public collaboration with Alibaba’s export-focused platform a carefully circumscribed form of engagement rather than a broader policy reset.\n\nIndia’s export ambitions are closely tied to its small businesses and the platforms they use to reach overseas markets. Micro, small, and medium enterprises account fornearly half of the country’s exportsand about 31% of GDP, according to the Indian government’s latest Economic Survey, underlining why New Delhi has focused on expanding digital market access for smaller firms through global B2B channels, including Alibaba.com.\n\nAlibaba.com’s B2B platform connects more than 50 million active buyers across over 200 countries and regions, said Rocky Lu, head of India business at the company.\n\n“Alibaba.com has been active in India for over two decades, and we remain dedicated to our core mission of empowering MSMEs to scale their businesses globally,” Lu told TechCrunch. “Our focus continues to be on leveraging our digital inf",
      "excerpt": "India’s government has partnered with China’s Alibaba.com on an export-focused program aimed at helping startups and small businesses reach overseas buyers. The move highlights New Delhi’s selective engagement with Chinese-linked tech platforms years after itimposed sweeping banson consumer apps and",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Anthropic’s Super Bowl ads mocking AI with ads helped push Claude’s app into the top 10",
      "link": "https://techcrunch.com/2026/02/13/anthropics-super-bowl-ads-mocking-ai-with-ads-helped-push-claudes-app-into-the-top-10/",
      "author": "Sarah Perez",
      "date": "2026-02-13T09:16:27-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Claude-app-gettyImages-2216579136.jpg?w=1024",
      "category": "Apps",
      "content": "Anthropic’sSuper Bowl ads— which feature darkly comedic scenarios of people seeking advice from chatbots, only to be steered to “cougar” dating sites and height-boosting insoles — have been paying off. In the days since, Anthropic’s AI chatbot Claude has climbed from No. 41 on the U.S. App Store to become a top 10 app. As of Friday, Claude sits at No. 7 — its highest rank to date — suggesting its “no ads” pitch resonates strongly with users.\n\nAccording to new data from market intelligence providerAppfigures, Claude’s U.S. downloads across both iOS and Android totaled an estimated 148,000 from Sunday through Tuesday — the most recent data available. That’s a 32% increase from the preceding three days, Thursday through Saturday, where downloads totaled approximately 112,000.\n\nClaude’s daily average number of downloads from Sunday through Tuesday was 49,200, up 32% from the usual Sunday through Tuesday average of 37,400 per day.\n\nThe numbers suggest that Anthropic’s Super Bowl commercials, combined with Anthropic’s recentrelease of its new Opus 4.6 model, worked to drive attention to Claude’s app and its key differentiator from ChatGPT. The latterrolled out ads to free usersthis week, just as Anthropic’s ads had warned.\n\nAs a result, Claude’s app is gaining more attention than it did when it first debuted on mobile.\n\nThe consumer-focused AI apparrived on iOS in May 2024to a fairly tepid reception. ChatGPT had beaten it to market on mobile devices and had grown tonearly half a million installsin its first five days. By comparison, Claude had only pulled in 157,000 total global downloads within its first week and didn’t reach a rank higher than No. 55 on the U.S. App Store.\n\nGlobally, Claude saw some gains this past week, too. Overall worldwide downloads of Claude across both the App Store and Google Play grew 15% from Sunday to Tuesday versus last Thursday to Saturday. However, this was less than half the gains seen in the U.S., Appfigures noted.",
      "excerpt": "Anthropic’sSuper Bowl ads— which feature darkly comedic scenarios of people seeking advice from chatbots, only to be steered to “cougar” dating sites and height-boosting insoles — have been paying off. In the days since, Anthropic’s AI chatbot Claude has climbed from No. 41 on the U.S. App Store to ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}