{
  "last_updated": "2026-02-12T06:11:28.448934+00:00",
  "articles": [
    {
      "title": "AI inference startup Modal Labs in talks to raise at $2.5B valuation, sources say",
      "link": "https://techcrunch.com/2026/02/11/ai-inference-startup-modal-labs-in-talks-to-raise-at-2-5b-valuation-sources-say/",
      "author": "Marina Temkin",
      "date": "2026-02-11T14:48:35-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2024-02-14-at-9.26.16AM.png?resize=1200,607",
      "category": "Startups",
      "content": "Modal Labs, a startup specializing in AI inference infrastructure, is talking to VCs about a new round at a valuation of about $2.5 billion, according to four people with knowledge of the deal. Should the deal close at these terms, the funding round would more than double the company’s valuation of$1.1 billionannounced less than five months ago, when it announced an$87 millionSeries B round.\n\nGeneral Catalyst is in talks to lead the round, the people told TechCrunch. Modal’s annualized revenue run rate (ARR) is approximately $50 million, our sources said. The discussions are early, and terms could still change.\n\nModal Labs co-founder and CEO Erik Bernhardsson denied that his company was actively fundraising and characterized his recent interactions with VCs as general conversations. General Catalyst did not respond to our requests for comment.\n\nModal is focused on optimizing inference, the process of running trained AI models to generate answers from user requests. Improving inference efficiency reduces compute costs and cuts down the lag time between a user’s prompt and the AI’s response.\n\nModal is one of the handful of inference-focused companies attracting intense investor attention now. Last week, its competitor Baseten announced a$300 million raiseat a $5 billion valuation, more than doubling the $2.1 billion valuation it reached just months prior in September. Similarly, Fireworks AI, an inference cloud provider, secured $250 million at a $4 billion valuation in October.\n\nIn January, the creators of the open source inference project vLLM announced they had transitioned the tool into a VC-backed startup, Inferact, raising $150 million in seed funding led by Andreessen Horowitz at an$800 million valuation. Meanwhile, TechCrunch reported that the team behind SGLang has commercialized as RadixArk, which sources told us secured seed funding at a$400 millionvaluation led by Accel.\n\nModal was co-founded by CEO Erik Bernhardsson in 2021 after he spent more than 15 yea",
      "excerpt": "Modal Labs, a startup specializing in AI inference infrastructure, is talking to VCs about a new round at a valuation of about $2.5 billion, according to four people with knowledge of the deal. Should the deal close at these terms, the funding round would more than double the company’s valuation of$",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Microsoft says hackers are exploiting critical zero-day bugs to target Windows and Office users",
      "link": "https://techcrunch.com/2026/02/11/microsoft-says-hackers-are-exploiting-critical-zero-day-bugs-to-target-windows-and-office-users/",
      "author": "Zack Whittaker",
      "date": "2026-02-11T12:46:40-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/07/microsoft-logo-1865237814.jpg?resize=1200,863",
      "category": "Security",
      "content": "Microsoft has rolled out fixes for security vulnerabilities in Windows and Office, which the company says are being actively abused by hackers to break into people’s computers.\n\nThe exploits areone-click attacks, meaning that a hacker can plant malware or gain access to a victim’s computer with minimal user interaction. At least two flaws can be exploited by tricking someone into clicking a malicious link on their Windows computer. Another can result in a compromise on opening a malicious Office file.\n\nThe vulnerabilities are known aszero-days, because the hackers were exploiting the bugs before Microsoft had time to fix them.\n\nDetails of how to exploit the bugs have been published, Microsoft said, potentially increasing the chance of hacks. Microsoft did not say where they had been published, and a Microsoft spokesperson did not immediately comment when reached by TechCrunch. In its bug reports, Microsoft acknowledged the input of security researchers in Google’s Threat Intelligence Group in their discovery of the vulnerabilities.\n\nMicrosoft said one of the bugs, officially tracked asCVE-2026-21510, was found in the Windows shell, which powers the operating system’s user interface. The bug affects all supported versions of Windows, the company said. When a victim clicks on a malicious link from their computer, the bug allows hackers to bypass Microsoft’s SmartScreen feature that would typically screen malicious links and files for malware.\n\nAccording tosecurity expert Dustin Childs, this bug can be abused toremotely plant malwareon the victim’s computer.\n\n“There is user interaction here, as the client needs to click a link or a shortcut file,” Childs wrote in his blog post. “Still, a one-click bug to gain code execution is a rarity.”\n\nA Google spokesperson confirmed that the Windows shell bug was under “widespread, active exploitation,” and said successful hacks allowed the silent execution of malware with high privileges, “posing a high risk of subsequent system c",
      "excerpt": "Microsoft has rolled out fixes for security vulnerabilities in Windows and Office, which the company says are being actively abused by hackers to break into people’s computers.\n\nThe exploits areone-click attacks, meaning that a hacker can plant malware or gain access to a victim’s computer with mini",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Elon Musk suggests spate of xAI exits have been push, not pull",
      "link": "https://techcrunch.com/2026/02/11/senior-engineers-including-co-founders-exit-xai-amid-controversy/",
      "author": "Rebecca Bellan",
      "date": "2026-02-11T12:47:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2199701496.jpg?resize=1200,800",
      "category": "AI",
      "content": "Elon Musk is addressing a wave of departures from xAI, including two more co-founders who left this week, bringing the total to six out of the original 12.\n\nAt an all-hands meeting Tuesday night, Musk suggested the exits were about fit, not performance. “Because we’ve reached a certain scale, we’re organizing the company to be more effective at this scale,” he said,according to The New York Times. “And actually, when this happens, there’s some people who are better suited for the early stages of a company and less suited for the later stages.”\n\nWednesday afternoon on X, he went further, making clear these departuresweren’t voluntary. “xAI was reorganized a few days ago to improve speed of execution,” Musk wrote. “As a company grows, especially as quickly as xAI, the structure must evolve just like any living organism. This unfortunately required parting ways with some people.”\n\nHe added that the company is “hiring aggressively” and closed with a quintessentially Musk pitch: “Join xAI if the idea of mass drivers on the Moon appeals to you.”\n\nLosing half your co-founders in a relatively short period raises questions, and Musk’s comments seem designed to control the narrative, reframing the exits as necessary rather than a problem for the outfit.\n\nIn total, at least nine engineers, including thetwo co-founders, have publicly announced their departure from xAI in the past week — though two of those exits appear to have occurred a few weeks ago.\n\nThree of the departing staff members have said they will be starting something new alongside other former xAI engineers, although no details are available about the new venture. Others have hinted at a desire for more autonomy and smaller teams to build frontier tech more rapidly, pointing to the anticipated surge in AI productivity.\n\nYuhuai (Tony) Wu, an xAI co-founder and reasoning lead,said in a postannouncing his resignation: “It’s time for my next chapter. It is an era with full possibilities: a small team armed with AIs ca",
      "excerpt": "Elon Musk is addressing a wave of departures from xAI, including two more co-founders who left this week, bringing the total to six out of the original 12.\n\nAt an all-hands meeting Tuesday night, Musk suggested the exits were about fit, not performance. “Because we’ve reached a certain scale, we’re ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Why the economics of orbital AI are so brutal",
      "link": "https://techcrunch.com/2026/02/11/why-the-economics-of-orbital-ai-are-so-brutal/",
      "author": "Tim Fernholz",
      "date": "2026-02-11T10:15:21-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2021/03/starlink-satellites-on-orbit.jpg?resize=1200,675",
      "category": "AI",
      "content": "In a sense, this whole thing was inevitable. Elon Musk and his coterie have been talking about AI in space for years — mainly in the context of Iain Banks’ science-fiction series about a far-future universe where sentient spaceships roam and control the galaxy.\n\nNow Musk sees an opportunity to realize a version of this vision. His company SpaceX has requested regulatory permission to build solar-powered orbital data centers, distributed across as many as a million satellites, that could shift as much as 100 GW of compute power off the planet. He hasreportedlysuggested some of his AI satellites will be built on the moon.\n\n“By far the cheapest place to put AI will be space in 36 months or less,” Musk said last week on a podcast hosted by Stripe co-founder John Collison.\n\nHe’s not alone. xAI’s head of compute has reportedly bet his counterpart at Anthropic that 1% of global compute will be in orbit by 2028. Google (which has a significant ownership stake in SpaceX) has announced a space AI effort called Project Suncatcher, which will launch prototype vehicles in 2027. Starcloud, a startup that has raised $34 million backed by Google and Andreessen Horowitz, filed its own plans for an 80,000 satellite constellation last week. Even Jeff Bezos has said this is the future.\n\nBut behind the hype, what will it actually take to get data centers into space?\n\nIn a first analysis, today’s terrestrial data centers remain cheaper than those in orbit. Andrew McCalip, a space engineer, has built ahelpful calculatorcomparing the two models. His baseline results show that a 1 GW orbital data center might cost $42.4 billion — almost 3x its ground-bound equivalent, thanks to the up-front costs of building the satellites and launching them to orbit.\n\nChanging that equation, experts say, will require technology development across several fields, massive capital expenditure, and a lot of work on the supply chain for space-grade components. It also depends on costs on the ground rising as re",
      "excerpt": "In a sense, this whole thing was inevitable. Elon Musk and his coterie have been talking about AI in space for years — mainly in the context of Iain Banks’ science-fiction series about a far-future universe where sentient spaceships roam and control the galaxy.\n\nNow Musk sees an opportunity to reali",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "How to get into a16z’s super-competitive Speedrun startup accelerator program",
      "link": "https://techcrunch.com/2026/02/11/how-to-get-into-a16zs-super-competitive-speedrun-startup-accelerator-program/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-11T11:58:01-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/speedrun.webp?resize=1200,800",
      "category": "Venture",
      "content": "Without a doubt, one of the hottest new startup accelerators in tech right now is Andreessen Horowitz’s Speedrun program. Launched in 2023, the accelerator has an acceptance rate of less than 1%. In aJanuary blog post,the program said that over 19,000 startups pitched and fewer than 0.4% were accepted into the latest cohort.\n\nThe program used to focus on gaming startups, then expanded into entertainment and media, and is now a “horizontal program,” Joshua Lu, the program’s general manager and a partner at a16z, told TechCrunch. Today, founders of any type of startup can apply, and the program runs for about 12 weeks in San Francisco. It once had a program in Los Angeles, but Lu said the focus will be on SF from now on.\n\nThere are two cohorts a year, and around 50 to 70 startups are accepted into each. The programinvests up to $1 millioninto each company, though the downside is that it’s a bit pricey. It typically invests $500,000 up front in exchange for 10% of the startup’s company via a SAFE note, and another $500,000 if the next round is raised within 18 months, at whatever terms agreed to by the other investors.\n\nIn comparison, Y Combinatortypically takes a fixed 7%of the company for $125,000, with another $375,000 “invested on an uncapped MFN safe.”\n\nSpeedrun said its program is more “equity expensive” because of what it offers founders. It provides them with access to a16z’s advisory and business networks that assist with tasks like go-to-market, brand development, media strategy, and talent sourcing. Plus it offers the startups perks like $5 million in credits to vendors such as AWS, OpenAI, Nvidia, and Deel.\n\nGiven the high interest, and low acceptance rate, TechCrunch spoke to Lu for some tips on how startups can best stand out. The latest cohort began in January and will end in April with a Demo Day. Applications forthe next cohort open in April,though it looks at off-season applications year-round, Lu said.\n\nSpeedrun focuses on early-stage startups. Becau",
      "excerpt": "Without a doubt, one of the hottest new startup accelerators in tech right now is Andreessen Horowitz’s Speedrun program. Launched in 2023, the accelerator has an acceptance rate of less than 1%. In aJanuary blog post,the program said that over 19,000 startups pitched and fewer than 0.4% were accept",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "How AI changes the math for startups, according to a Microsoft VP",
      "link": "https://techcrunch.com/2026/02/11/how-ai-changes-the-math-for-startups-according-to-a-microsoft-vp/",
      "author": "Russell Brandom",
      "date": "2026-02-11T09:51:37-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Amanda.jpg?resize=1200,800",
      "category": "AI",
      "content": "For 24 years, Microsoft’s Amanda Silver has been working to help developers — and in the last few years, that’s meant building tools for AI. After a long stretch on GitHub Copilot, Silver is now a corporate vice president at Microsoft’s CoreAI division, where she works on tools for deploying apps and agentic systems within enterprises.\n\nHer work is focused onthe Foundry systeminside Azure, which is designed as a unified AI portal for enterprises, giving her a close view of how companies are actually using these systems and where deployments end up falling short.\n\nI spoke with Silver about the current capabilities of enterprise agents, and why she believes this is the biggest opportunity for startups since the public cloud.\n\nThis interview was edited for length and clarity.\n\nSo, your work focuses on Microsoft products for outside developers — often startups that aren’t otherwise focused on AI. How do you see AI impacting those companies?\n\nI see this as being a watershed moment for startups as profound as the move to the public cloud. If you think about it, the cloud had a huge impact for startups because it meant that they no longer needed to have the real estate space to host their racks, and they didn’t need to spend as much money on the capital infusion of getting the hardware to be hosted in their labs and things like that. Everything became cheaper. Now agentic AI is going to kind of continue to reduce the overall cost of software operations again, because many of the jobs involved in standing up a new venture — whether it’s support people, legal investigations — a lot of it can be done faster and cheaper with AI agents. I think that’s going to lead to more ventures and more startups launching. And then we’re going to see higher-valuation startups with fewer people at the helm. And I think that that’s an exciting world.\n\nWhat does that look like in practice?\n\nWe are certainly seeing multistep agents becoming very broadly used across all different kinds of coding",
      "excerpt": "For 24 years, Microsoft’s Amanda Silver has been working to help developers — and in the last few years, that’s meant building tools for AI. After a long stretch on GitHub Copilot, Silver is now a corporate vice president at Microsoft’s CoreAI division, where she works on tools for deploying apps an",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "UpScrolled’s social network is struggling to moderate hate speech after fast growth",
      "link": "https://techcrunch.com/2026/02/11/upscrolleds-social-network-is-struggling-to-moderate-hate-speech-after-fast-growth/",
      "author": "Sarah Perez",
      "date": "2026-02-11T09:47:15-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/upscrolled.png?resize=1200,942",
      "category": "Social",
      "content": "UpScrolled, a social network thatcaught fireafter TikTok’s ownership change in the U.S., is facing a serious moderation problem. Aftergrowing to more than 2.5 million usersin January, users have reported the app is not taking action on the creation of usernames and hashtags that contain racial slurs, and hasn’t been able to properly moderate harmful content.\n\nAfter receiving tips from UpScrolled users, TechCrunch confirmed the existence of a wide range of racial slurs and hate speech being used in people’s usernames on the app. For instance, some usernames would feature the name of the slur itself, the slur combined with other words, or multiple slurs in a single username; other usernames contain hate speech, like “Glory to Hitler.”\n\nAfter reporting these slurs to UpScrolled’s public email address, we received a response from that email that the company is “actively reviewing and removing inappropriate content,” and is working to expand its moderation capacity. The email advised us not to engage with bad-faith actors while the situation is resolved.\n\nDays after reporting this activity on the app, the accounts with slurs in the usernames that were provided to UpScrolled via screenshots remained online.\n\nIn addition, slurs and hate speech can be found elsewhere in the app, including hashtags and text used alongside its photo or video content, TechCrunch found. Other harmful content was available, including text posts with racial slurs and hate speech, and photo and video content glorifying Hitler, based on TechCrunch’s review of the app.\n\nTechCrunch wasn’t alone in identifying this problem; the ADL alsopublished a blog post this month, noting that UpScrolled was becoming home to antisemitic and extremist content anddesignatedforeign terrorist organizations, like Hamas and others.\n\nUpScrolled, which was founded in 2025, claims on its website claims that the platform offers every voice “equal power.” The app has seen more than 4 million downloads on iOS and Android sinc",
      "excerpt": "UpScrolled, a social network thatcaught fireafter TikTok’s ownership change in the U.S., is facing a serious moderation problem. Aftergrowing to more than 2.5 million usersin January, users have reported the app is not taking action on the creation of usernames and hashtags that contain racial slurs",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Former Founders Fund VC Sam Blond launches AI sales startup to upend Salesforce",
      "link": "https://techcrunch.com/2026/02/11/former-founders-fund-vc-sam-blond-launches-ai-sales-startup-to-upend-salesforce/",
      "author": "Julie Bort",
      "date": "2026-02-11T08:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Monaco-Founder-Photo.jpg?resize=1200,800",
      "category": "Startups",
      "content": "When Sam Blond left his job as a VC for Founders Fund a year ago — just 18 months after he started — hetold the worldthat being a VC wasn’t for him and he was “going back to operating.”\n\nOn Wednesday, he officially brought his new startup,Monaco, out of stealth. It was co-founded with his brother Brian Blond, who is also an ex-sales professional turned VC. (Brian is a partner at Human Capital and was formerly at Sutter Hill.) The brothers are joined by two other co-founders, Abishek Viswanathan (previously CPO at Apollo and Qualtrics), and Malay Desai (formerly SVP of engineering at Clari).\n\nMonaco has raised a total of $35 million, between a $10 million seed and $25 million Series A round, Sam Blond tells TechCrunch. Both rounds were led by Founders Fund, with participation from Human Capital. The startup has been quietly testing its AI sales platform through a private beta for a while, but on Wednesday opened it up to a public beta.\n\nThe well-connected Blond brothers (Sam was previously head of sales at Brex), also attracted a bunch of big-name angels as backers: Stripe founders Patrick and John Collison, Y Combinator chief Garry Tan, and Greenoaks Capital founder Neil Mehta.\n\nSo what attracted such a venerable list of investors? Monaco is entering the crowded field of AI sales tech with a twist. It isn’t just competing with SaaS-era tech via its AI-native alternative; it’s also supplying experienced human salespeople to be experts in the AI loop, monitoring and guiding the AI’s work.\n\nThe startup is targeting young seed and Series A-level startups with a product suite that includes an AI-native customer relationship management (CRM) system and a built-from-scratch ZoomInfo-like database for finding prospects. Its AI agents can create and execute email outreach campaigns and draft follow-up emails all monitored by the human experts. It includes other features, too, like a meeting notetaker.\n\nThe product is intended to automate much of the sales grunt work. “We can",
      "excerpt": "When Sam Blond left his job as a VC for Founders Fund a year ago — just 18 months after he started — hetold the worldthat being a VC wasn’t for him and he was “going back to operating.”\n\nOn Wednesday, he officially brought his new startup,Monaco, out of stealth. It was co-founded with his brother Br",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "xAI lays out interplanetary ambitions in public all-hands",
      "link": "https://techcrunch.com/2026/02/11/xai-lays-out-interplanetary-ambitions-in-public-all-hands/",
      "author": "Russell Brandom",
      "date": "2026-02-11T15:29:08-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Screen-Shot-2026-02-11-at-3.22.39-PM.jpg?resize=1200,679",
      "category": "AI",
      "content": "On Wednesday, xAI took the rare step of publishing a full 45-minute all-hands meeting video on X, making it publicly accessible. Details of the Tuesday night meeting werepreviously reported by The New York Times, which may have influenced xAI’s decision to post the video online.\n\nThe full video reveals significant new details about Musk’s plans for the AI lab, including its product roadmap and its ongoing ties to the X platform.\n\nSince xAI was formed just 30 months ago, the small and talented team has made remarkable progress.The future has never looked more exciting!pic.twitter.com/QZ73H2mpBj\n\nThe most immediate revelation concerned a string of departing employees, which Musk described as layoffs resulting from a changing organizational structure at the company. While reorganizations are common, the breadth of the departures has caused significant confusion, particularly as it has meant the loss of a significant portion of the founding team.\n\n“As a company grows, especially as quickly as xAI, the structure must evolve,” Musksaid on X. “This unfortunately required parting ways with some people. We wish them well in future endeavors.”\n\nThe new organizational system splits xAI into four primary teams: one focused on the Grok chatbot (including voice), another for the app’s coding system, another for the Imagine video generator, and finally a team focused on the Macrohard project, which spans from simple computer use simulation to modeling entire corporations.\n\n“[Macrohard] is able to do anything on a computer that a computer is able to do,” Toby Pohlen, who will lead the project under the new organizational structure, told his colleagues. “There should be rocket engines fully designed by AI.”\n\nThe all-hands also featured claims about new usage and revenue figures for xAI and X. Nikita Bier, X’s head of product, said X had “just crossed” $1 billion in annual recurring revenue from subscriptions, which he attributed to a marketing push during the holidays.\n\nAdditionally",
      "excerpt": "On Wednesday, xAI took the rare step of publishing a full 45-minute all-hands meeting video on X, making it publicly accessible. Details of the Tuesday night meeting werepreviously reported by The New York Times, which may have influenced xAI’s decision to post the video online.\n\nThe full video reve",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "OpenAI disbands mission alignment team",
      "link": "https://techcrunch.com/2026/02/11/openai-disbands-mission-alignment-team-which-focused-on-safe-and-trustworthy-ai-development/",
      "author": "Lucas Ropek",
      "date": "2026-02-11T13:57:18-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2198379368.jpg?resize=1200,800",
      "category": "AI",
      "content": "OpenAI has disbanded a team that was designed to communicate the company’s mission to the public and to its own employees. At the same time, the team’s former leader has been given a new role as the company’s “chief futurist.”\n\nOpenAI confirmed to TechCrunch that the team’s members have now been assigned to other roles. The news wasfirst reportedby Platformer.\n\nThe disbanded team in question appears to have beenformed in September of 2024. Platformer reports that the team was dedicated to promoting “the company’s stated mission to ensure that artificial general intelligence benefits all of humanity.”\n\nAn official OpenAI spokesperson described the team thusly: “The Mission Alignment project was a support function to help employees and the public understand our mission and the impact of AI. That work continues throughout the organization.”\n\nIna blog postpublished Wednesday, Josh Achiam, the former head of OpenAI’s mission alignment team, explained his new role as the company’s chief futurist. “My goal is to support OpenAI’s mission — to ensure that artificial general intelligence benefits all of humanity — by studying how the world will change in response to AI, AGI, and beyond,” Achiam wrote.\n\nAchiam noted that, in his new role, he would be collaborating with Jason Pruet, an OpenAI physicist.\n\nA spokesperson for OpenAI said the rest of the mission alignment team — a group of six or seven people — had subsequently been reassigned to different parts of the company. The spokesperson couldn’t say where exactly the team members had been assigned, but said that they were engaged in similar work in those roles. It was also unclear whether Achiam would have a new team as part of his “futurist” role.\n\nThe spokesperson attributed the disbanding of the team to the kinds of routine reorganizations that occur within a fast-moving company.\n\nOpenAI previously had what it called a “superalignment team” — which wasformed in 2023and focused on studying long-term existential threats po",
      "excerpt": "OpenAI has disbanded a team that was designed to communicate the company’s mission to the public and to its own employees. At the same time, the team’s former leader has been given a new role as the company’s “chief futurist.”\n\nOpenAI confirmed to TechCrunch that the team’s members have now been ass",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}