{
  "last_updated": "2026-02-13T19:43:51.014378+00:00",
  "articles": [
    {
      "title": "The SEC closed its investigation into Fisker",
      "link": "https://techcrunch.com/2026/02/13/the-sec-closed-its-investigation-into-fisker/",
      "author": "Sean O'Kane",
      "date": "2026-02-13T09:48:43-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/07/fisker-ocean-black.jpg?resize=1200,763",
      "category": "Transportation",
      "content": "The Securities and Exchange Commission closed its investigation into bankrupt electric vehicle startup Fisker  last September, roughlyone year after the probe was opened.\n\nTechCrunch learned the investigation was closed when the financial regulator responded to a Freedom of Information Act (FOIA) request in January. The SEC’s FOIA department said it had identified “approximately 21.7 gigabytes of electronically maintained records” related to the investigation. The agency doesn’t typically make records available if investigations are still open, and it explained in a follow-up email that it “was closed in September 2025.”\n\nIt’s not clear how far the investigation progressed. The SECrevealed the existence of the probein an October 2024 filing in Fisker’s bankruptcy case. The agency wrote at the time that it had sent subpoenas to the company and that it may need to “request or subpoena additional documents in the future relating to its ongoing investigation.”\n\nA spokesperson for the agency declined to comment. Founder and former CEO Henrik Fisker did not respond to a message seeking comment.\n\nThe closure of the Fisker investigation comes amid a significant drop in enforcement actions and settlements during President Trump’s second term. The SEC initiated 313 enforcement actions in 2025 — the lowest in a decade and down 27% from the the final year of President Biden’s term, according toan analysis by law firm Paul, Weiss. Only four of those enforcement actions were against public companies. Total monetary settlements fell 45% from 2024.\n\nFisker was one of the last remaining electric vehicle startups under investigation by the SEC. Over the last few years, the agency settled fraud or other charges brought againstNikola,Lordstown Motors,Canoo,Hyzon Motors, and others. In 2023, itclosed an investigationinto Lucid Motors without a lawsuit.\n\nThe only known active investigation remaining into an electric vehicle startup is the one related to Faraday Future, which is now nearl",
      "excerpt": "The Securities and Exchange Commission closed its investigation into bankrupt electric vehicle startup Fisker  last September, roughlyone year after the probe was opened.\n\nTechCrunch learned the investigation was closed when the financial regulator responded to a Freedom of Information Act (FOIA) re",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "India partners with Alibaba.com for export push despite past China tech bans",
      "link": "https://techcrunch.com/2026/02/13/india-partners-with-alibaba-com-for-export-push-despite-past-china-tech-bans/",
      "author": "Jagmeet Singh",
      "date": "2026-02-13T09:32:59-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/alibaba-com-jagmeet-singh-techcrunch.jpg?resize=1200,800",
      "category": "Government & Policy",
      "content": "India’s government has partnered with China’s Alibaba.com on an export-focused program aimed at helping startups and small businesses reach overseas buyers. The move highlights New Delhi’s selective engagement with Chinese-linked tech platforms years after itimposed sweeping banson consumer apps and games.\n\nThis week, the Indian government’s Startup India initiativeannouncedthe collaboration with Alibaba.com to identify and support Indian startups that can help onboard and scale Indian exporters on the group’s global B2B platform. The program offers commissions and technical support to those startups to assist small manufacturers and traders in reaching overseas markets.\n\nThe new partnership arrives after years of strained India–China relations. New Delhibanned dozens of Chinese-linked appsin 2020 following a deadly border clash, including major platforms such as TikTok, PUBG Mobile, and AliExpress, an e-commerce app operated by Alibaba Group. Those restrictions remain in place, making the Indian government’s public collaboration with Alibaba’s export-focused platform a carefully circumscribed form of engagement rather than a broader policy reset.\n\nIndia’s export ambitions are closely tied to its small businesses and the platforms they use to reach overseas markets. Micro, small, and medium enterprises account fornearly half of the country’s exportsand about 31% of GDP, according to the Indian government’s latest Economic Survey, underlining why New Delhi has focused on expanding digital market access for smaller firms through global B2B channels, including Alibaba.com.\n\nAlibaba.com’s B2B platform connects more than 50 million active buyers across over 200 countries and regions, said Rocky Lu, head of India business at the company.\n\n“Alibaba.com has been active in India for over two decades, and we remain dedicated to our core mission of empowering MSMEs to scale their businesses globally,” Lu told TechCrunch. “Our focus continues to be on leveraging our digital inf",
      "excerpt": "India’s government has partnered with China’s Alibaba.com on an export-focused program aimed at helping startups and small businesses reach overseas buyers. The move highlights New Delhi’s selective engagement with Chinese-linked tech platforms years after itimposed sweeping banson consumer apps and",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "A Stanford grad student created an algorithm to help his classmates find love; now, Date Drop is the basis of his new startup",
      "link": "https://techcrunch.com/2026/02/13/a-stanford-grad-student-created-an-algorithm-to-help-his-classmates-find-love-now-date-drop-is-the-basis-of-his-new-startup/",
      "author": "Amanda Silberling",
      "date": "2026-02-13T08:24:53-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/headshot.jpg?resize=898,1200",
      "category": "Apps",
      "content": "As Valentine’s Day approaches at Stanford, some students may be gearing up for first dates — not with people they met on Tinder or Hinge, but with matches from a service calledDate Drop, designed by Stanford graduate student Henry Weng. Date Drop pairs students with potential dates once per week based on their responses to a questionnaire.\n\nA Stanford whiz kid is trying to disrupt an established industry from his Palo Alto dorm?Stop meifyou’ve heard thisonebefore! But young adults are deeplydisillusionedwith the frustrating, demoralizingstate of online dating. Why not try something different?\n\nOver 5,000 students at Stanford have given Date Drop a try since its launch in the fall. It has also rolled out at 10 more schools, including MIT, Princeton, and the University of Pennsylvania, and Weng says he wants to roll out Date Drop more broadly in some cities this summer.\n\n“Our matches convert to actual dates at about 10x the rate of Tinder,” Weng told TechCrunch. “Instead of swiping, we get to know each person deeply and send them one compatible match per week.”\n\nAt first, Weng didn’t intend to turn Date Drop into the foundation of a startup. Then, a close friend of his met their partner via Date Drop. “That was when I got the sense that this was less of a project,” he said.\n\nNow, Weng thinks of Date Drop as just the first service from his startup, TheRelationship Company, which is a public benefit corporation — a type of company legally required to consider social impact alongside profits.\n\n“This started as something I just wanted to exist on campus, and it became a company because people kept on asking for it in their schools and I needed resources to do that,” he said.\n\nAlready, Weng has raised “a few million” from some angel investors, including Zynga founder and early Facebook backer Mark Pincus, who has taught business courses at Stanford (including to Weng). Andy Chen, a former partner at Coatue, and Elad Gil, an early backer of Airbnb, Stripe, and Pinterest, al",
      "excerpt": "As Valentine’s Day approaches at Stanford, some students may be gearing up for first dates — not with people they met on Tinder or Hinge, but with matches from a service calledDate Drop, designed by Stanford graduate student Henry Weng. Date Drop pairs students with potential dates once per week bas",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Anthropic’s Super Bowl ads mocking AI with ads helped push Claude’s app into the top 10",
      "link": "https://techcrunch.com/2026/02/13/anthropics-super-bowl-ads-mocking-ai-with-ads-helped-push-claudes-app-into-the-top-10/",
      "author": "Sarah Perez",
      "date": "2026-02-13T09:16:27-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Claude-app-gettyImages-2216579136.jpg?w=1024",
      "category": "Apps",
      "content": "Anthropic’sSuper Bowl ads— which feature darkly comedic scenarios of people seeking advice from chatbots, only to be steered to “cougar” dating sites and height-boosting insoles — have been paying off. In the days since, Anthropic’s AI chatbot Claude has climbed from No. 41 on the U.S. App Store to become a top 10 app. As of Friday, Claude sits at No. 7 — its highest rank to date — suggesting its “no ads” pitch resonates strongly with users.\n\nAccording to new data from market intelligence providerAppfigures, Claude’s U.S. downloads across both iOS and Android totaled an estimated 148,000 from Sunday through Tuesday — the most recent data available. That’s a 32% increase from the preceding three days, Thursday through Saturday, where downloads totaled approximately 112,000.\n\nClaude’s daily average number of downloads from Sunday through Tuesday was 49,200, up 32% from the usual Sunday through Tuesday average of 37,400 per day.\n\nThe numbers suggest that Anthropic’s Super Bowl commercials, combined with Anthropic’s recentrelease of its new Opus 4.6 model, worked to drive attention to Claude’s app and its key differentiator from ChatGPT. The latterrolled out ads to free usersthis week, just as Anthropic’s ads had warned.\n\nAs a result, Claude’s app is gaining more attention than it did when it first debuted on mobile.\n\nThe consumer-focused AI apparrived on iOS in May 2024to a fairly tepid reception. ChatGPT had beaten it to market on mobile devices and had grown tonearly half a million installsin its first five days. By comparison, Claude had only pulled in 157,000 total global downloads within its first week and didn’t reach a rank higher than No. 55 on the U.S. App Store.\n\nGlobally, Claude saw some gains this past week, too. Overall worldwide downloads of Claude across both the App Store and Google Play grew 15% from Sunday to Tuesday versus last Thursday to Saturday. However, this was less than half the gains seen in the U.S., Appfigures noted.",
      "excerpt": "Anthropic’sSuper Bowl ads— which feature darkly comedic scenarios of people seeking advice from chatbots, only to be steered to “cougar” dating sites and height-boosting insoles — have been paying off. In the days since, Anthropic’s AI chatbot Claude has climbed from No. 41 on the U.S. App Store to ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Fusion startup Helion hits blistering temps as it races toward 2028 deadline",
      "link": "https://techcrunch.com/2026/02/13/fusion-startup-helion-hits-blistering-temps-as-it-races-toward-2028-deadline/",
      "author": "Tim De Chant",
      "date": "2026-02-13T02:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Helion-Polaris-D-T.jpeg?resize=1200,800",
      "category": "Climate",
      "content": "Fusion energy startupHelionannounced Friday that it has hit a key milestone in its quest for fusion power. Plasmas inside the company’s Polaris prototype reactor have reached 150 million degrees Celsius, three-quarters of the way toward what the company thinks it will need to operate a commercial fusion power plant.\n\n“We’re obviously really excited to be able to get to this place,” David Kirtley, Helion’s co-founder and CEO, told TechCrunch.\n\nPolaris is also operating using deuterium-tritium fuel — a mixture of two hydrogen isotopes — which Kirtley said makes Helion the first fusion company to do so. “We were able to see the fusion power output increase dramatically as expected in the form of heat,” he said.\n\nThe Everett, Washington-based startup is locked in a race with several other companies that are seeking to commercialize fusion power, a potentially unlimited source of clean energy.\n\nThat potential has investors rushing to bet on the technology. This week, Inertia Enterprises announced a$450 million Series Around that included Bessemer and GV. In January, Type One Energy told TechCrunch it was in themidst of raising $250 million, while last summer Commonwealth Fusion Systems raised$863 millionfrom investors including Google and Nvidia. Helion itself raised$425 millionlast year from a group that included Sam Altman, Mithril, Lightspeed, and SoftBank.\n\nWhile most other fusion startups are targeting the early 2030s to put electricity on the grid, Helion has a contract with Microsoft to sell it electricity starting in 2028, though that power would come from a larger commercial reactor called Orion that the company is currently building, not Polaris.\n\nEvery fusion startup has its own milestones based on the design of its reactor. Commonwealth Fusion Systems, for example, needs to heat its plasmas to more than 100 million degrees C inside of its tokamak, a doughnut-shaped device that uses powerful magnets to contain the plasma.\n\nHelion’s reactor is different, needin",
      "excerpt": "Fusion energy startupHelionannounced Friday that it has hit a key milestone in its quest for fusion power. Plasmas inside the company’s Polaris prototype reactor have reached 150 million degrees Celsius, three-quarters of the way toward what the company thinks it will need to operate a commercial fu",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Dutch phone giant Odido says millions of customers affected by data breach",
      "link": "https://techcrunch.com/2026/02/13/dutch-phone-giant-odido-says-millions-of-customers-affected-by-data-breach/",
      "author": "Zack Whittaker",
      "date": "2026-02-13T07:54:13-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/odido.jpg?resize=1200,810",
      "category": "Security",
      "content": "Dutch phone company Odido has confirmed a data breach affected millions of its customers.\n\nThe company said in astatementThursday that unidentified hackers gained access to its customer contact system and covertly downloaded reams of customer information. A spokesperson for Odido toldlocal Dutch mediathat the breach affects more than 6.2 million customers, or about a third of the country’s population.\n\nThe stolen data includes customer names, phone numbers, postal and email addresses, dates of birth, bank account numbers (IBAN), and details of customers’ government-issued IDs, such as passport or driver’s license numbers and dates of validity.\n\nThe company said former customers who had service within the past two years may also be affected.\n\nOdido said the data did not include customer call records, location data, billing information, or image scans of government IDs. The data does not affect business customers, the company said.\n\nThe breach affects customers of both Odido and itssubsidiary Ben NL. Both companies said that their phone, internet, and television operations were unaffected by the breach.\n\nThis is the latest in a series of data thefts targeting phone and telecommunication giants in recent years, as governments and financially motivated hackers continue to seek highly confidential information that telcos have on their customers.\n\nEarlier this week, the Singaporean governmentconfirmedthat a China-related hacking group had previously broken into four of the country’s top phone giants as part of a surveillance operation, but did not access customers’ personal information.\n\nAll the while, hackers associated with the China-backed threat group known as Salt Typhoon have hacked hundreds of phone companies around the world, including inCanada,Norway, theUnited Kingdom, and theUnited States, as part of an ongoing espionage campaign aimed at spying on senior government officials and diplomats.",
      "excerpt": "Dutch phone company Odido has confirmed a data breach affected millions of its customers.\n\nThe company said in astatementThursday that unidentified hackers gained access to its customer contact system and covertly downloaded reams of customer information. A spokesperson for Odido toldlocal Dutch med",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Waymo is asking DoorDash drivers to shut the doors of its self-driving cars",
      "link": "https://techcrunch.com/2026/02/12/waymo-is-asking-doordash-drivers-to-shut-the-doors-of-its-self-driving-cars/",
      "author": "Amanda Silberling",
      "date": "2026-02-12T20:41:41-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/waymo-getty-streets.jpg?resize=1200,800",
      "category": "Transportation",
      "content": "It still feels like a technological marvel: Waymo’s autonomous cars are now transporting passengers across six cities. Alas, this driverless future comes with its own set of problems. These vehicles can be rendered inert if a passenger accidentally leaves the door open.\n\nAccording toa Reddit post, one DoorDash driver discovered this issue when an odd request appeared in their queue. Instead of making a delivery, the driver was offered $6.25 to drive less than one mile to a Waymo vehicle and close its door. After “verified completion,” they would get an extra $5.\n\n“You actually ‘door’ dashed,” one commenter noted.\n\nIt seems too ironic to be real. Waymo vehicles represent technological breakthroughs that once seemed unfathomable. The Alphabet-owned company just raised$16 billionto take its driverless cars international!\n\nBut Waymo and DoorDash confirmed to TechCrunch that this Reddit post is legitimate. This is, in fact, a real problem.\n\n“Waymo is currently running a pilot program in Atlanta to enhance its AV fleet efficiency. In the rare event a vehicle door is left ajar, preventing the car from departing, nearby Dashers are notified, allowing Waymo to get its vehicles back on the road quickly,” Waymo and DoorDash said in a joint response. (The door-closing partnership, which beganearlier this year, is just one facet of Waymo and DoorDash’s broader relationship. In October, the companies launched an autonomous delivery service in Phoenix, where Waymo vehicles deliver food and groceries to DoorDash customers.)\n\nIf a Waymo door is left open, it’s worth it to the company to pay someone to close it — the car cannot complete any more rides if it’s left immobile. Not to mention, an unmoving car could block the flow of traffic.\n\nThis isn’t the first time Waymo has enlisted help with its door troubles. In Los Angeles, Waymo works withHonk, an app that’s like Uber for towing services. According to reports, Honk users in L.A. have been offeredup to $24to close a Waymo door — m",
      "excerpt": "It still feels like a technological marvel: Waymo’s autonomous cars are now transporting passengers across six cities. Alas, this driverless future comes with its own set of problems. These vehicles can be rendered inert if a passenger accidentally leaves the door open.\n\nAccording toa Reddit post, o",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Musk needed a new vision for SpaceX and xAI. He landed on Moonbase Alpha.",
      "link": "https://techcrunch.com/2026/02/12/musk-needed-a-new-vision-for-spacex-and-xai-he-landed-on-moonbase-alpha/",
      "author": "Tim Fernholz",
      "date": "2026-02-12T14:10:55-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Screenshot-2026-02-12-at-10.37.51-AM.png?resize=1200,666",
      "category": "AI",
      "content": "“Join xAI if the idea of mass drivers on the Moon appeals to you,” CEO Elon Muskproclaimedyesterday following a restructuring that saw a stream of former executivesexit the AI lab.\n\nThis is an interesting recruitment strategy after the company’s merger with Musk’s rocket maker, SpaceX, and the combined company’s anticipated IPO. You might think that xAI employees ought to be fascinated with achieving AGI, using deep learning models to disrupt traditional software companies, or simply bad wordplay like “Macrohard.” But instead, Elon is going to the moon.\n\nAfter outlining plans tobuild AI data centers in orbit, the primary synergy between the two companies, Musk took the idea further. “What if you want to go beyond a mere terawatt per year?” Musk asked. “To do that, you have to go to the moon…I really want to see a mass driver on the moon that is shooting AI satellites into deep space.”\n\nIn Musk’s telling, the step beyond data centers orbiting Earth is even larger computers in deep space. And furthermore, Musk says the best way to achieve that is to build a city on the moon to manufacture space computers and hurl them into the solar system using a big maglev train.\n\nIf that all feels a bit much, veteran Musk watchers know there’s a clue about where the discussion appears in a video of anall-hands meetingxAI shared with the public. The slide describing the moon base comes at the end of the presentation deck, where, during SpaceX pep talks, Musk typically shares renderings of SpaceX rockets landing on Mars and waxes rhapsodic about the future of multi-planetary humanity.\n\nNotably, the moon base comes just after SpaceX has publicly backed away from its long-held goal of colonizing Mars. Now, with xAI in the corporate fold, Musk needs a new science fiction metaphor for the future: In this case, theKardashev Scale, a theoretical measure of galactic civilizations coined by the eponymous Soviet astronomer in the 1960s. The idea is climbing the scale of energy usage — early c",
      "excerpt": "“Join xAI if the idea of mass drivers on the Moon appeals to you,” CEO Elon Muskproclaimedyesterday following a restructuring that saw a stream of former executivesexit the AI lab.\n\nThis is an interesting recruitment strategy after the company’s merger with Musk’s rocket maker, SpaceX, and the combi",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "OpenAI removes access to sycophancy-prone GPT-4o model",
      "link": "https://techcrunch.com/2026/02/13/openai-removes-access-to-sycophancy-prone-gpt-4o-model/",
      "author": "Amanda Silberling",
      "date": "2026-02-13T10:10:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=1024",
      "category": "",
      "content": "Starting Friday, OpenAI willcease providing accessto five legacy ChatGPT models, including the popular but controversial GPT-4o model.\n\nThe 4o model has been at the center of a number oflawsuitsconcerning user self-harm, delusional behavior, and AIpsychosis. It remains OpenAI’shighest scoring model for sycophancy.\n\nIn addition to GPT-4o, the GPT-5, GPT-4.1, GPT-4.1 mini, and OpenAI o4-mini models have also been deprecated.\n\nOpenAI intended to retire GPT-4o in August, when it unveiled theGPT-5 model. But at the time, there was enough backlash for OpenAI to keep the legacy model available for paid subscribers, who could manually choose to interact with that model. In a recent blog post, OpenAI noted that only 0.1% of customers have been using GPT-4o, but for a company with800 million weekly active users, that small percentage still amounts to 800,000 people.\n\nThousands of users haverallied against the retirement of 4o, citing their close relationships with the model.",
      "excerpt": "Starting Friday, OpenAI willcease providing accessto five legacy ChatGPT models, including the popular but controversial GPT-4o model.\n\nThe 4o model has been at the center of a number oflawsuitsconcerning user self-harm, delusional behavior, and AIpsychosis. It remains OpenAI’shighest scoring model ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Roku to launch streaming bundles as part of its efforts to continue growing its profitability",
      "link": "https://techcrunch.com/2026/02/13/roku-to-launch-streaming-bundles-as-part-of-its-efforts-to-continue-growing-its-profitability/",
      "author": "Lauren Forristal",
      "date": "2026-02-13T08:39:27-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2023/04/roku-logo.jpg?resize=1200,800",
      "category": "Media & Entertainment",
      "content": "Roku shared itsfourth-quarter earningsfor 2025 this week, as well as some exciting plans in the pipeline. The company is rolling out new streaming bundles, expanding its $3 subscription service, Howdy, to more platforms, and partnering with more premium streaming services following the successful addition of HBO Max.\n\nLaunching bundles in 2026 is a smart move, as it could attract more viewers looking for enticing deals amid rising subscription prices. Many streaming platforms have been increasing their rates recently, and Roku aims to appeal to cost-conscious consumers. The positive impact of HBO Max on Roku’s premium subscriptions has encouraged the company to continue this strategy by adding more top-tier partners, which is likely to drive growth going forward.\n\nAdditionally, Rokulaunchedits ad-free subscription streaming service, Howdy, last year and plans to expand its availability beyond the Roku platform. While specific details remain undisclosed, Roku CEO Anthony Woodstated at CES last monththat the goal is to distribute Howdy widely, saying, “We want to distribute it everywhere.”\n\nOther highlights include Roku users streaming 145.6 billion hours of video in 2025, marking a 15% increase from 2024. The company is also nearing the milestone of 100 million streaming households, though it has decided to report this figure less frequently.\n\nFinancially, Roku delivered an impressive quarter, posting net income of $80.5 million, a rebound from a $35.5 million loss in the same period last year. Total revenue for Q4 2025 reached $1.4 billion, representing a 16% year-over-year increase.\n\nLooking ahead, Roku is optimistic, projecting total net revenue of $5.5 billion and gross profit of $2.4 billion.\n\n“In 2023, our priority was to rightsize our cost structure and reach adjusted EBITDA breakeven in 2024, and we achieved that goal a full year ahead of schedule,” Wood told investors during the call yesterday afternoon. “Looking ahead to 2026 and beyond, we are confident in",
      "excerpt": "Roku shared itsfourth-quarter earningsfor 2025 this week, as well as some exciting plans in the pipeline. The company is rolling out new streaming bundles, expanding its $3 subscription service, Howdy, to more platforms, and partnering with more premium streaming services following the successful ad",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}