{
  "last_updated": "2026-02-18T23:33:39.324894+00:00",
  "articles": [
    {
      "title": "A startup called Germ becomes the first private messenger that launches directly from Bluesky’s app",
      "link": "https://techcrunch.com/2026/02/18/a-startup-called-germ-becomes-the-first-private-messenger-that-launches-directly-from-blueskys-app/",
      "author": "Sarah Perez",
      "date": "2026-02-18T12:57:48-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Drop-In_PR_Horizontal.png?w=1200",
      "category": "Startups",
      "content": "Here’s something that you’ve never seen on Big Tech social platforms: The decentralized open social network Bluesky has integrated new technology from a startup calledGerm Networkin order to bring end-to-end encrypted (E2E) messaging to the Bluesky app. The move makes Germ DM the first private messenger that can be launched natively within the Bluesky app.\n\nAlongside the launch, Germ is also releasingnew guidancethat would allow other apps built on the underlying AT Protocol that powers Bluesky to do the same thing.\n\nThe move is a notable example of how open social networking ecosystems work differently from the Big Tech platforms that dominate the space today, as new functionality and features can be developed by the community, not just by the company itself.\n\nBlueskyannouncedthe integration with Germ earlier this month, noting that the experimental integration will allow Germ users to add a button to their profile so others can message them on Bluesky in an E2E encrypted environment.\n\nMeanwhile, Germ’s standalone app is also available in a public beta on iOS in North America and Europe. That app had seen thousands of downloads so far, but after the official integration announcement, daily active users jumped by 5x, the team said.\n\nCalifornia-based Germ is a startup founded byTessa Brown, a communications scholar who previously taught at Stanford, andMark Xue, who worked as a privacy engineer at Apple on technologies like FaceTime and iMessage. The idea, the company previously explained to TechCrunch, was to offer an alternative to other E2E encrypted platforms like iMessage, Signal, and WhatsApp that’s built on newer technologies.\n\nToday, Germ takes advantage of Messaging Layer Security (MLS), a new standard approved by theInternet Engineering Task Force(IETF), and theAT Protocol(or ATProto), which powers Bluesky, Skylight, and a growing number of other social apps.\n\nInstead of requiring a user’s phone number, Germ integrates with ATProto to enable its encrypted chats. That means Germ’s messages cannot be decrypted by another service, including itself or Bluesky.\n\nTo use the new messenger, you’ll simply click on the badge on a friend’s profile on Bluesky, which opens an iOS App Clip — a lightweight, temporary app. You click “open” on this app experience and then authenticate by logging in with your ATProto handle. You can then send a message to a friend immediately. You’ll also be nudged to download the full Germ DM app, but this is optional.\n\nIf you want to add the badge to your own profile, you’ll download the Germ DM app on iOS and authenticate your Bluesky credentials there. (Note: We had to force-quit the Bluesky iOS app and restart it before the Germ badge appeared.)\n\nThe company has been building up to the official Bluesky integration for many months, starting with a private beta in August, which was launched using “magic links” shared in users’ bios. Now, users who set up Germ to work within Bluesky will receive a new badge that’s displayed on their profiles, allowing them to remove the link-in-bio option they were using before. (The links will still work, but the badge is easier and more noticeable, of course.)\n\nGerm told TechCrunch their startup has been in conversation with the ATProto developer community, including Bluesky’s app and protocol teams, since theATmosphere Conference in Seattlelast year.\n\n“We’ve been transparent about our planning and roadmap, and shipping our private beta in August generated valuable feedback from users and developers about the desire to replace our links in bios with native UI,” said Xue, who serves as CTO at Germ Network. “Both our team and Bluesky’s saw value in better AppView support for the Germ link.”\n\nThe changes to Bluesky’s app were led by head of product Alex Benzer, as the company waslooked to experimentwith implementing third-party services within Bluesky.\n\n“Working directly with the Bluesky team has been a treat,” Brown, Germ’s CEO, told TechCrunch. “They ship fast, prioritize the user experience, and care about their users’ access to end-to-end encrypted messaging. We’re thrilled to be the first secure messenger they’ve brought natively into their app.”\n\nWhile it’s true that the AT Protocol could eventually implement E2E encryption, that is not a focus today. As Bluesky protocol engineer Daniel Holms recently explained, the company has several reasons not to design a system itself.\n\n“The reality is that E2EE is hard,” hewrote in a blog post. “And this inherent complexity isn’t something that the protocol team at Bluesky can just handle – it gets pushed out to every dev trying to build a client that works with encrypted data,” Holms said.\n\nXue agreed, adding, “We align with the ATProto ethos that people should be able to communicate using the apps and tools they choose. We believe that by solving the hard problems for ATProto users in safe, transparent, and user-friendly ways, they’ll continue to choose us,” he said.\n\nShortly after Bluesky added support for the Germ badge, anotherAT Protocol-based client, Blacksky, did as well.\n\nBrown noted the team is currently focused on shipping more everyday messaging features, not on monetization. But further down the road, Germ may test paid features.\n\n“We expect that our first paid features will be centered on the needs of prosumer power users like creators, journalists, and politicians—for example, support for multiple handles and private AI-powered screening for first messages from new connections,” she said.",
      "excerpt": "Here’s something that you’ve never seen on Big Tech social platforms: The decentralized open social network Bluesky has integrated new technology from a startup calledGerm Networkin order to bring end-to-end encrypted (E2E) messaging to the Bluesky app. The move makes Germ DM the first private messe",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "SeatGeek and Spotify team up to offer concert ticket sales inside the music platform",
      "link": "https://techcrunch.com/2026/02/18/seatgeek-and-spotify-team-up-to-offer-concert-ticket-sales-inside-the-music-platform/",
      "author": "Lauren Forristal",
      "date": "2026-02-18T11:07:40-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2016/07/smartphone_concert.jpg?resize=1200,900",
      "category": "Apps",
      "content": "SeatGeekannouncedon Wednesday a new integration with Spotify, bringing a seamless ticket-buying experience for Spotify users.\n\nNow when Spotify users browse an artist’s page or upcoming tour dates, they will see ticket links powered by SeatGeek for concerts at these participating venues, allowing for a streamlined purchase process.\n\nCurrently, the integration is available for a select group of venues where SeatGeek serves as the primary ticket seller. Specifically, it covers SeatGeek’s 15 major U.S. venue partners, including State Farm Stadium in Glendale, Nissan Stadium in Nashville, and AT&T Stadium in Arlington. (So, although SeatGeek is a major player in the secondary ticketing space, this integration is exclusive to venues where it operates as the primary ticketing platform.)\n\nThis is a strategic win for SeatGeek. With direct placement in the Spotify app, SeatGeek is positioned to reach millions of active music fans as they discover upcoming events, increasing the chances of converting listeners into ticket buyers.\n\nAlthough SeatGeek has made significant strides in the space, it continues to face competition from heavyweights Ticketmaster and AXS.\n\nThese rivals command a greater share of the ticketing market, bolstered by long-term contracts with many top venues and event organizers. It’sestimatedthat Ticketmaster alone services 53 of the top 68 U.S. arenas. Even Barclays Center, which switched from Ticketmaster to SeatGeek in 2021,quickly reversed courseless than a year into a seven-year agreement and ended the deal to return to Ticketmaster.\n\nNotably, the latest partnership follows Spotify’sannouncementthat it has helped artists generate over $1 billion in ticket sales by linking fans with live events through its ticketing partners. The company works with more than 45ticketing partners, including Ticketmaster, AXS, Eventbrite, DICE, and Bandsintown.\n\nSpotify previously experimented withdirect ticket salesin 2022.\n\nThis also isn’t SeatGeek’s first time teaming up with a popular app. The companypartnered with Snapchatin 2018, allowing users to buy tickets directly within the social app.\n\nSeparately, Spotify’s latest earnings call occurred last week, where the company reported having more than750 million monthly usersand 290 million paid subscribers. Spotify projects these numbers will rise to 759 million users and 293 million paid subscribers in the current quarter, highlighting its continued focus on profitability.",
      "excerpt": "SeatGeekannouncedon Wednesday a new integration with Spotify, bringing a seamless ticket-buying experience for Spotify users.\n\nNow when Spotify users browse an artist’s page or upcoming tour dates, they will see ticket links powered by SeatGeek for concerts at these participating venues, allowing fo",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Amazon halts Blue Jay robotics project after less than 6 months",
      "link": "https://techcrunch.com/2026/02/18/amazon-halts-blue-jay-robotics-project-after-less-than-six-months/",
      "author": "Rebecca Szkutak",
      "date": "2026-02-18T10:27:10-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/08/about-amazon-hero-20230227-amazon-288.jpg?resize=1200,675",
      "category": "Robotics",
      "content": "Amazon has hundreds of thousands of robots in its warehouses, but that doesn’t mean all of its robotic initiatives are a success story.\n\nThe e-commerce giant has halted its Blue Jay warehouse robotics project just months after unveiling the tech, as originallyreported by Business Insiderand confirmed by TechCrunch.\n\nBlue Jay, a multi-armed robot designed to sort and move packages, was unveiled in October for use in the company’s same-day delivery facilities. At the time, the company was testing the robots at a facility in South Carolina and said it took Amazonsignificantly less time to develop Blue Jay— only about a year— than it did to develop its other warehouse robots, a speed the company credited to advancements in AI.\n\nAmazon spokesperson Terrence Clark told TechCrunch that Blue Jay was launched as a prototype — although that was not made clear in the company’s original press release.\n\nThe company plans to use Blue Jay’s core technology for other robotics “manipulation programs” with employees who worked on Blue Jay being moved to other projects.\n\n“We’re always experimenting with new ways to improve the customer experience and make work safer, more efficient, and more engaging for our employees,” Clark told TechCrunch over email. “In this case, we’re actually accelerating the use of the underlying technology developed for Blue Jay, and nearly all of the technologies are being carried over and will continue to support employees across our network.”\n\nAmazon also unveiled the Vulcan robot last year, which is used in the storage compartments of the company’s warehouses.Vulcan is a two-armed robot, with one arm meant to rearrange and move items in a compartment while the other is equipped with a camera and suction cups to grab goods. The Vulcan can allegedly “feel” the objects that it touches and was trained on data gathered from real-world interactions.\n\nAmazon has been developing its internal robotics program since 2012 when it purchased Kiva Systems, a robotics company whose warehouse automation technology formed the foundation of Amazon’s fulfillment operations. It surpassed1 million robots in its warehouseslast July.",
      "excerpt": "Amazon has hundreds of thousands of robots in its warehouses, but that doesn’t mean all of its robotic initiatives are a success story.\n\nThe e-commerce giant has halted its Blue Jay warehouse robotics project just months after unveiling the tech, as originallyreported by Business Insiderand confirme",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "OpenAI pushes into higher education as India seeks to scale AI skills",
      "link": "https://techcrunch.com/2026/02/18/openai-pushes-into-higher-education-as-india-seeks-to-scale-ai-skills/",
      "author": "Jagmeet Singh",
      "date": "2026-02-18T06:32:42-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/08/openai-india.jpg?resize=1200,800",
      "category": "AI",
      "content": "OpenAI is expanding its footprint in India and moving into the country’s higher-education system through partnerships with leading academic institutions. The move comes as the South Asian nation seeks to scale AI skills and build domestic capacity in one of the world’s largest talent markets.\n\nOn Wednesday, OpenAI said it was partnering with six public and private higher-education institutions in India, including top engineering, management, medical, and design-focused institutes, with the aim of reaching more than 100,000 students, faculty, and staff over the next year.\n\nRather than focusing on consumer use, the initiative centers on integrating AI into core academic functions, signaling OpenAI’s interest in influencing how AI is taught, governed, and normalized within one of the world’s largest higher-education systems.\n\nOpenAI has already built a large consumer audience for its ChatGPT chatbot, which has over100 million monthly active usersin India, according to CEO Sam Altman, and India has emerged as the company’s second-largest user base after the U.S. The announcement also coincides with a broader push by leading AI firms to deepen their presence in India, which is hosting anAI Impact Summitin New Delhi this week.\n\nThe first cohort of partners includes some of India’s most influential academic institutions, such as the Indian Institute of Technology Delhi, the Indian Institute of Management Ahmedabad, and the All India Institute of Medical Sciences New Delhi, alongside private universities and specialized design schools. The ChatGPT maker said the partnerships would span disciplines ranging from engineering and management to healthcare and creative fields.\n\nIndia has already emerged as a key testing ground for AI use in education. Last month, Google said India accounts for thehighest global usage of its Gemini tools for learning. Microsoft, similarly, said this week it wouldexpand its Elevate skilling programin India to train teachers across schools, vocational institutes, and higher-education settings, working with government agencies as part of a broader push to build AI skills at scale.\n\nOpenAI said the partnerships would involve campus-wide access to its ChatGPT Edu tools, faculty training, and responsible-use frameworks. The focus, the company said, is on embedding AI into core academic workflows such as coding, research, analytics, and case analysis, rather than offering standalone access to tools.\n\nTwo of the partner institutions, the Indian Institute of Management Ahmedabad and Manipal Academy of Higher Education, will also introduce OpenAI-backed certifications. Additionally, OpenAI said it would work with Indian ed-tech platforms, including Physics Wallah, upGrad, and HCL GUVI, to extend AI training beyond campuses. These platforms will launch structured courses on AI fundamentals and ChatGPT use cases, aimed at students and early-career professionals.\n\nRaghav Gupta, head of education at OpenAI India, said educational institutions were a “critical route” to closing the gap between rapidly advancing AI tools and how people are actually using them, as skills demands shift across the economy.\n\nLast year, OpenAI hired Gupta, a former Coursera Asia-Pacific managing director, as its India and Asia-Pacific head of education, alongside the launch of a Learning Accelerator program focused on expanding AI skills.\n\nThe flurry of moves into education underscores how AI companies are increasingly looking beyond consumer tools and corporate clients toward institutions that shape skills, norms, and long-term adoption. For countries like India, the contest is not just around access to AI, but also about who helps define how it is taught, governed, and embedded at scale.",
      "excerpt": "OpenAI is expanding its footprint in India and moving into the country’s higher-education system through partnerships with leading academic institutions. The move comes as the South Asian nation seeks to scale AI skills and build domestic capacity in one of the world’s largest talent markets.\n\nOn We",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "World Labs lands $1B, with $200M from Autodesk, to bring world models into 3D workflows",
      "link": "https://techcrunch.com/2026/02/18/world-labs-lands-200m-from-autodesk-to-bring-world-models-into-3d-workflows/",
      "author": "Rebecca Bellan",
      "date": "2026-02-18T10:07:16-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/11/Untitled-design.png?resize=1200,764",
      "category": "AI",
      "content": "Fei-Fei Li’s World Labs has secured a $200 million investment from software design giant Autodesk as part of alarger $1 billion roundfrom backers, including AMD, Emerson Collective, Fidelity, Nvidia, and others.\n\nWorld Labs, which emerged fromstealth in 2024 with $230 millionat a $1 billion valuation, declined to say whether the latest round boosted its valuation. However,reportsa month ago suggested it was aiming to raise at a $5 billion valuation.\n\nThe partnership between World Labs and Autodesk will see the two companies collaborating to explore how World Labs’ models — AI systems that can generate and reason about immersive 3D environments — can work alongside Autodesk’s tools, and vice versa, starting with a focus on entertainment use cases.\n\nFor World Labs, Autodesk’s investment is a signal that its product has commercial appeal. The startup’s first world model product,Marble, released last November, lets users create editable, downloadable 3D environments.\n\nAutodesk is one of the biggest developers of 3D CAD (computer-aided design) software. Its platform underpins architectural, engineering, construction, manufacturing, and entertainment workflows. That focus on the built world makes investment in advanced spatial AI a natural extension of its core business.\n\nOr as Li put it in a statement: “Autodesk has long helped people think spatially and solve real-world problems and, together, we share a clear purpose: building physical AI that augments human creativity and puts more powerful tools in the hands of designers, builders, and creators.”\n\nAs part of the deal, Autodesk will serve as an adviser to World Labs, and the two will collaborate at the “research and model level.”\n\nDaron Green, Autodesk’s chief scientist, told TechCrunch the partnership is still in its early days, so the precise form it’s going to take hasn’t been determined yet.\n\n“You could anticipate us consuming their models or them consuming our models in different settings,” Green said.\n\nHe mused that customers might like to start with a world-model-based sketch in World Labs (say, of an office layout) and then drill down on certain design aspects (like the design of the desk), which is where Autodesk’s tech might come in.\n\n“Similarly, you might want to take an object that you’ve designed in our [platform], and put it in a context that you create through one of [World Labs’] prompts,” Green said.\n\nGreen added that data sharing is not part of the agreement.\n\nGreen said the two companies plan to start with media and entertainment use cases. Most companies building world models — includingGoogle DeepMindandRunway— see gaming and interactive entertainment as an initial go-to-market strategy.\n\nAutodesk already works with most major media production companies and has been training models for character animation.\n\n“These are close to world models,” Green said. “They’re a characterization of an animal in the world that’s responding to physical constraints like time, maybe a terrain it needs to traverse. So there’s a physical understanding in the model, and you can see how that might be combined [with World Labs’ tech]. You’re not just animating the dog, but you’re giving it a world within which it can now interact.”\n\nThe partnership with World Labs supports Autodesk’s broader push to integrate more AI features across its software portfolio. The company is developing“neural CAD,”a new kind of generative AI model trained on geometric data that can reason about components and entire systems. Put simply, it can generate working 3D models, not just images, with an understanding of how those designs would function in the real world.\n\nAutodesk’s neural CAD models are already being integrated into the firm’s product design and architecture products as a step toward more advanced spatial intelligence. But World Labs’ models could help extend that capability beyond individual design files toward more holistic digital representations of the physical world.\n\nGreen thinks different AI systems, including large language models, world models, and neural CAD will be combined in the future to improve designs for Autodesk’s customers.\n\n“If AI is to be truly useful, it must understand worlds, not just words,” Li said in the statement. “Worlds are governed by geometry, physics, and dynamics, and reconciling the semantic, spatial, and physical is the next great frontier of AI.”\n\nThis article has been updated to include more details on World Labs’ raise.",
      "excerpt": "Fei-Fei Li’s World Labs has secured a $200 million investment from software design giant Autodesk as part of alarger $1 billion roundfrom backers, including AMD, Emerson Collective, Fidelity, Nvidia, and others.\n\nWorld Labs, which emerged fromstealth in 2024 with $230 millionat a $1 billion valuatio",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "This former Microsoft PM thinks she can unseat CyberArk in 18 months",
      "link": "https://techcrunch.com/2026/02/18/the-former-microsoft-pm-who-thinks-she-can-unseat-cyberark-in-18-months/",
      "author": "Connie Loizos",
      "date": "2026-02-18T07:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Or-Vaknin-and-Rotem-Lurie.-Credit-Assaf-Revivo.jpg?resize=1200,834",
      "category": "Fundraising",
      "content": "The internet today has a permissions problem. As non-humans — chatbots, AI agents, and automated systems — have proliferated on the web, so has the need to provide them with credentials, permissions, and identities. That’s one major reason identity and access management startups that help manage this new kind of digital workforce are raking in venture capital.\n\nNow, a 35-person Israeli-American startup called Venice is emerging from stealth with fresh cash and a plucky claim: that it’s already replacing industry stalwarts like CyberArk and Okta at Fortune 500 companies.\n\nVenice, founded just over two years ago, says it raised $20 million in Series A funding in December, led by IVP, with participation from Index Ventures, which led its earlier seed round.\n\nUnlike many of its well-funded rivals — which include Persona (raised a$200 millionSeries D last April), Veza (closed a$108 millionSeries D last May), and GitGuardian SAS (raised$50 millionlast week) — Venice is tackling both cloud-based and on-premises environments, a technical choice that has made the product harder to build but positioned it to win over the large enterprises still running legacy systems alongside modern cloud infrastructure.\n\nAt its helm sits 31-year-old Rotem Lurie, whose path to entrepreneurship pretty much ticks every box on VCs’ checklists. The daughter of two programmer parents in Israel (her mother was one of the country’s first female software engineers), Lurie spent four-and-a-half years as a lieutenant in Unit 8200, Israel’s elite intelligence corps, before joining Microsoft as a product manager working on what would become Defender for Identity.\n\nShe later became the first product hire at Axis Security, an access management startup that sold to Hewlett Packard Enterprise for $500 million in 2022. Just before that acquisition closed, Lurie left to join YL Ventures, a cybersecurity-focused venture firm.\n\nThat brief stint at YL Ventures proved particularly instructive. “Every day, I used to meet a team of three 23-year-old boys,” Lurie says straightforwardly over a Zoom call. “Most of those companies build their technology to be acquired. The entire strategy around what problem you’re solving and how you penetrate the market — it’s a completely different approach.”\n\nTo replace incumbents like CyberArk, which has long dominated the privileged access management market, Lurie realized she’d need to play a longer game. That meant building technology that’s both deep and comprehensive enough to support the complex, hybrid IT environments of most large enterprises.\n\nThe technical challenge ahead of Lurie went thus: Most identity and access management teams juggle roughly 10 different tools to manage who and what has access to corporate systems. Venice’s platform consolidates that sprawl into a single system that handles privileged access across on-premises servers, SaaS applications, and cloud infrastructure for humans and non-human entities alike.\n\n“Tying everything together was what mattered to customers the most,” Lurie says. Indeed, Venice operates a SaaS subscription model, but Lurie insists it isn’t competing on price. “We reduce the cost, but it’s not because we go cheap on pricing,” she explains.\n\n“It’s because we spare all the overhead [associated with many of today’s offerings], especially the professional services” — the consultant fees and lengthy implementations that have become an almost unavoidable tax for enterprise security deployments.\n\nThe bet appears to be paying off. Lurie says Venice is now “completely replacing” legacy vendors at Fortune 500 and Fortune 1000 customers, and cutting implementation time to just a week-and-a-half, from the typical six months to two years, thanks to AI-powered automation. While she declined to name customers on the record, she told TechCrunch off the record that they include a 170-year-old, publicly traded manufacturing giant as well as a global music conglomerate.\n\nCack Wilhelm, the partner at IVP who led Venice’s Series A, says Lurie stood out. “The problem with most cybersecurity pitches is everyone’s tackling something too small to ever be material,” Wilhelm says. “When you look at the massive exits — CrowdStrike, Palo Alto Networks — they were doing audacious things from the beginning. Rotem is the same.”\n\nWilhelm points to the urgency created by AI agents as a key factor driving IVP’s investment thesis. “If every individual is going to have tens of agents working on their behalf, and privileged access tools were built for a static world of IT professionals, we need our identity concept to adjust to that,” Wilhelm said. “Very often, when [companies] are breached, they’re breached by people simply logging in with someone else’s credentials. You solve that with just-in-time permissions that are scoped to the individual and the moment.”\n\nThough crowded, the market seems eager for new solutions. Identity and access management spending was expected to exceed $24 billion in 2025, increasing by 13% from a year earlier, according to an industry group called Identity Management Institute.\n\nVenice’s team is split between Israel, where R&D is based, and North America, where the go-to-market team operates. Notably, nearly half of the cybersecurity company is women, a rarity in one of tech’s most stubbornly male-dominated sectors.\n\nLurie’s co-founder, Or Vaknin, serves as CTO (he’s pictured with Lurie, above). The company’s investors include Assaf Rappaport, co-founder and CEO of Wiz, and Raaz Herzberg, CMO at Wiz and Lurie’s former colleague from their days as interns at Microsoft.\n\nFor Lurie, who says she has spent much of her career as “the only woman in the room,” creating a more balanced team wasn’t a calculated act. “You can never see yourself doing something if you didn’t see someone like you doing it,” she says. “This is something that attracts other women — to feel like they can be part of it.”\n\nThe question now is whether Venice’s two-year head start and early Fortune 500 wins will be enough to fend off deep-pocketed competitors as they chase the same enterprise buyers. Can the market support multiple winners? Or, will identity management follow the path of other security categories and consolidate around one or two dominant players?",
      "excerpt": "The internet today has a permissions problem. As non-humans — chatbots, AI agents, and automated systems — have proliferated on the web, so has the need to provide them with credentials, permissions, and identities. That’s one major reason identity and access management startups that help manage thi",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Tesla dodges 30-day suspension in California after removing ‘Autopilot’",
      "link": "https://techcrunch.com/2026/02/17/tesla-dodges-30-day-suspension-in-california-after-removing-autopilot/",
      "author": "Kirsten Korosec",
      "date": "2026-02-17T20:07:15-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/tesla-autopiot-Getty.jpg?resize=1200,800",
      "category": "Transportation",
      "content": "The California Department of Motor Vehicles will not suspend Tesla’s sales and manufacturing licenses for 30 days because the EV maker has stopped using the term “Autopilot” in the marketing of its vehicles in the state.\n\nThe decision,issued late Tuesday, means Tesla can continue selling its EVs in California without interruption and officially settles a case that has been dragging on for nearly three years. California is Tesla’s biggest U.S. market.\n\nIn November 2023, the DMV filed accusations that Tesla violated state law by using deceptive marketing of Autopilot, its basic advanced driver-assistance system, as well as its more capable Full Self-Driving driver-assistance software. The state regulator argued that the terms misled customers and distorted the capabilities of the advanced driver-assistance systems.\n\nTesla stopped using the term “Full Self-Driving Capability” and instead used Full Self-Driving (Supervised) to more accurately describe the system and clarify that drivers were still required to monitor it. But Tesla held on to the Autopilot term, prompting the DMV to refer the case to an administrative law judge at the California Office of Administrative Hearings.\n\nIn December, the administrative law judge agreed with the DMV’s request to suspend Tesla’s sales and manufacturing licenses in the state for 30 days as a penalty for its actions. The DMV agreed with the ruling but didn’t pounce; instead, the state regulator gave Tesla 60 days to comply.\n\n“Since then, Tesla took corrective action and has stopped using the misleading term ‘Autopilot’ in the marketing of its electric vehicles in California,” the DMV stated in a release posted on its website. “Tesla had previously modified its use of the term ‘Full Self-Driving’ to clarify that driver supervision is required. By taking this prescribed action, Tesla will avoid having its dealer and manufacturer licenses suspended in the state for 30 days by the DMV.”\n\nTesla didn’t just stop using the term Autopilot, though. In January, the companydiscontinued Autopilotin the U.S. and Canada altogether. The move not only helped it comply with the DMV but was also viewed as a way to boost adoption of FSD, which, unlike Autopilot, requires the owner to pay for the upgraded system.\n\nFSD Supervised, which until February 14 required an $8,000 one-time fee, is now only available through a monthly subscription of $99. That subscription fee is expected to increase as the system becomes more capable, Tesla CEO Elon Muskhas said.",
      "excerpt": "The California Department of Motor Vehicles will not suspend Tesla’s sales and manufacturing licenses for 30 days because the EV maker has stopped using the term “Autopilot” in the marketing of its vehicles in the state.\n\nThe decision,issued late Tuesday, means Tesla can continue selling its EVs in ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Meta’s own research found parental supervision doesn’t really help curb teens’ compulsive social media use",
      "link": "https://techcrunch.com/2026/02/17/metas-own-research-found-parental-supervision-doesnt-really-help-curb-teens-compulsive-social-media-use/",
      "author": "Sarah Perez",
      "date": "2026-02-17T12:45:33-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2021/12/GettyImages-1237098710.jpeg?resize=1200,800",
      "category": "Social",
      "content": "An internal research study at Meta dubbed “Project MYST” created in partnership with theUniversity of Chicago, found that parental supervision and controls — such as time limits and restricted access — had little impact on kids’ compulsive use of social media. The study also found that kids who experienced stressful life events were more likely to lack the ability to moderate their social media use appropriately.\n\nThis was one of the notable claims revealed during testimony at the social media addiction trial that began last week in Los Angeles County Superior Court. The plaintiff in the lawsuit is identified by her initials “KGM” or her first name, “Kaley.” She, along with her mother and others joining the case, is accusing social media companies of creating “addictive and dangerous” products that led the young users to suffer anxiety, depression, body dysmorphia, eating disorders, self-harm, suicidal ideation, and more.\n\nThe case is now one of several landmark trials that will take place this year, which accuse social media companies of harming children. The results of these lawsuits will impact these companies’ approach to their younger users and could prompt regulators to take further action.\n\nIn this case, the plaintiff sued Meta, YouTube, ByteDance (TikTok), and Snap, but the latter two companieshadsettledtheir claims before the trial’s start.\n\nIn the jury trial now underway in LA, Kaley’s lawyer, Mark Lanier, brought up an internal study at Meta, which he said found evidence that Meta knew of, yet didn’t publicize, these specific harms.\n\nIn Project MYST, which stands for the Meta and Youth Social Emotional Trends survey, Meta’s research concluded that “parental and household factors have little association with teens’ reported levels of attentiveness to their social media use.”\n\nOr, in other words, even when parents try to control their children’s social media use, either by using parental controls or even just household rules and supervision, it doesn’t impact whether or not the child will overuse social media or use it compulsively. The study was based on a survey of 1,000 teens and their parents about their social media use.\n\nThe study also noted that both parents and teens agreed on this front, saying “there is no association between either parental reports or teen reports of parental supervision, and teens’ survey measures of attentiveness or capability.”\n\nIf the study’s findings are accurate, that would mean that the use of things like the built-in parental controls in the Instagram app or the time limits on smartphones wouldn’t necessarily help teens become less inclined to overuse social media, the plaintiff’s lawyer argued. As the original complaint alleges, teens are being exploited by social media products, whose defects include algorithmic feeds designed to keep users scrolling, intermittent variable rewards that manipulate dopamine delivery, incessant notifications, deficient tools for parental controls, and more.\n\nDuring his testimony, Instagram head Adam Mosseri claimed not to be familiar with Meta’s Project MYST, even though a document seemed to indicate he had given his approval to move forward with the study.\n\n“We do a lot of research projects,” Mosseri said, after claiming he couldn’t remember anything specific about MYST beyond its name.\n\nHowever, the plaintiff’s lawyer pointed to this study as an example of why social media companies should be held accountable for their alleged harms, not the parents. He noted that Kaley’s mother, for example, had tried to stop her daughter’s social media addiction and use, even taking her phone away at times.\n\nWhat’s more, the study found that teens who had a greater number of adverse life experiences — like those dealing with alcoholic parents, harassment at school, or other issues — reported less attentiveness over their social media use. That means that kids facing trauma in their real lives were more at risk of addiction, the lawyer argued.\n\nOn the stand, Mosseri seemed to partially agree with this finding, saying, “There’s a variety of reasons this can be the case. One I’ve heard often is that people use Instagram as a way to escape from a more difficult reality.” Meta is careful not to label any sort of overuse as addiction; instead, Mosseri stated that the company uses the term “problematic use” to refer to someone “spending more time on Instagram than they feel good about.”\n\nLawyers for Meta, meanwhile, pushed the idea that the study was more narrowly focused on understanding if teens felt they were using social media too much, not whether or not they were actually addicted. They also generally aimed to put more of the responsibility on parents and the realities of life as the catalyst for kids like Kaley’s negative emotional states, not companies’ social media products.\n\nFor instance,Meta’s lawyers pointed toKaley being a child of divorced parents, with an abusive father, and facing bullying at school.\n\nHow the jury will interpret the findings of studies likeProject MYST and others, along with the testimonies from both sides, remains to be seen. Mosseri did note, however, that MYST’s findings had not been published publicly, and no warnings were ever issued to teens or parents as a result of the research.\n\nReached for comment, a Meta spokesperson said, “Aside from the fact that this analysis showed nothing about the impact of parental oversight on teens’ behavior, parents tell us over and over that they want and need digital monitoring tools. That’s why we build them.”\n\nUpdated after publication with Meta’s comment.",
      "excerpt": "An internal research study at Meta dubbed “Project MYST” created in partnership with theUniversity of Chicago, found that parental supervision and controls — such as time limits and restricted access — had little impact on kids’ compulsive use of social media. The study also found that kids who expe",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Etsy sells secondhand clothing marketplace Depop to eBay for $1.2B",
      "link": "https://techcrunch.com/2026/02/18/etsy-sells-secondhand-clothing-marketplace-depop-to-ebay-for-1-2b/",
      "author": "Aisha Malik",
      "date": "2026-02-18T14:55:41-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2023/03/GettyImages-1240165689.jpg?resize=1200,800",
      "category": "Commerce",
      "content": "Etsy is selling Depop, a secondhand clothing app popular with Gen Z and millennials, to eBay for $1.2 billion in cash, the companyannouncedon Wednesday. Etsy says the deal will allow it to focus on its own marketplace.\n\nThe deal comes nearly five years afterEtsy acquired Depopfor $1.62 billion, at a time when secondhand clothing apps weregaining in popularity.\n\nFounded in 2011, Depop generated approximately $1 billion in gross merchandise sales — the total value of goods sold through its platform — in 2025. In the U.S., the company saw nearly 60% year-over-year growth. As of December 31, 2025, the marketplace had seven million active buyers, nearly 90% of whom were under 34, and more than three million active sellers.\n\n“Depop has built a trusted, social-forward marketplace with strong momentum in the pre-loved fashion category, and we are confident that as part of eBay, Depop will be even more well-positioned for long-term growth, benefiting from our scale, complementary offerings, and operational capabilities,” said eBay CEO Jamie Iannone in thepress release.\n\nThe move comes as Etsy has struggled to grow its business after the pandemic-era e-commerce boom, competing with marketplaces like Temu and Shein, as well as Amazon.\n\nThe company’s year-over-year revenue grew 2.2% in 2024, down from 7.1% growth reported in 2023. Etsy is scheduled to release its 2025 earnings on Thursday.\n\n“We are excited that this transaction allows us to focus exclusively on the compelling opportunity we see in front of us: to grow the Etsy marketplace in ways that matter most to our buyers and sellers,” said Etsy CEO Kruti Patel Goyal in the press release. “We are proud of what the Depop team has built – a truly differentiated brand and product, grounded in clear purpose and strong community – becoming one of the fastest-growing fashion resale marketplaces in the U.S. I am confident that Depop is well-positioned for its next phase of growth as part of eBay.”\n\nThe sale is the latest in a pattern of Etsy acquiring and then divesting niche online marketplaces. Etsy’s sale of Depop comes as the company has purchased and then sold other niche online marketplaces in recent years, including Brazilian e-commerce company Elo7 and musical instrument marketplace Reverb.\n\nThe deal is expected to close in the second quarter of this year.",
      "excerpt": "Etsy is selling Depop, a secondhand clothing app popular with Gen Z and millennials, to eBay for $1.2 billion in cash, the companyannouncedon Wednesday. Etsy says the deal will allow it to focus on its own marketplace.\n\nThe deal comes nearly five years afterEtsy acquired Depopfor $1.62 billion, at a",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Hacking conference Def Con bans three people linked to Epstein",
      "link": "https://techcrunch.com/2026/02/18/hacking-conference-def-con-bans-three-people-linked-to-epstein/",
      "author": "Lorenzo Franceschi-Bicchierai",
      "date": "2026-02-18T14:04:13-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/def-con-conference-2025.jpg?w=999",
      "category": "Security",
      "content": "Def Con, one of the largest and longest-running hacking conferences in the world, announced on Wednesday that three people linked to Jeffrey Epstein are no longer allowed to attend.\n\nThe conference justified adding Pablos Holman, Vincenzo Iozzo, and Joichi Ito to its public list ofbanned individuals, citing the three as appearing in the Department of Justice’s latest release of files related to its investigation of the late investor and convicted sex offender. Def Con also citedan article in Politicobased on emails that the three exchanged with Epstein.\n\nJoan Vollero, a spokesperson for Iozzo, told TechCrunch in a statement that Def Con’s actions are “entirely performative, given that Mr. Iozzo has barely attended the conference in the past twenty years.”\n\n“It was a rush to judgment not based on any investigation or wrongdoing by Mr. Iozzo,” the spokesperson said.\n\nRepresentatives for Def Con, Holman, and Ito did not immediately respond to TechCrunch’s request for comment.\n\nThe move to ban the three comes days after TechCrunch reported that cybersecurity conferences Black Hat and Code Blueremoved Iozzo from their official review board pages, amid new and emerging revelations linking the prominent hacker, among others, to Epstein.\n\nContact UsDo you have more information about Epstein’s connections in the cybersecurity world?? From a non-work device, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram, Keybase and Wire @lorenzofb, orby email.\n\nIozzo is a veteran of the cybersecurity industry who is currently the founder and chief executive of identity startup SlashID. He previously served as a director at CrowdStrike after the security giant acquired his cybersecurity startup IperLane in 2017. AsTechCrunch previously reported, Iozzo interacted with Epstein between 2014 and 2018, including after the Miami Heraldreportednew allegationsthat Epstein had abused dozens of women and children.\n\nEpsteinpleaded guiltyin 2008 to soliciting sex from girls and registered as a sex offender in New York and Florida. In 2019, the Department of JusticeaccusedEpstein of trafficking, exploiting, and abusing dozens of underage girls. Epsteindiedin jail.\n\nIozzo previously told TechCrunch that his interactions with Epstein were “limited to business opportunities that never materialized, as well as discussion of the markets and emerging technologies,” and that he “never observed nor participated in any illegal activity or behavior.”\n\nPrior to his startups, Iozzo was a research affiliate at MIT Media Lab, which was overseen by Ito at the time. The two appear in several Epstein emails together.\n\nJoichi Ito was the director of the MIT Media Lab until 2019, whenhe resignedafter it was reported that he was aware that Epstein was a convicted sex offender and that he and the university had extensive personal and financial relationships with Epstein.\n\nHolman, meanwhile, is the general partner at venture capital firm Deep Future and describes himself on his website as “a hacker, inventor & technology futurist.”\n\nHolman was in contact with Epstein since 2010,planned to stayat one of his apartments in New York City in 2013, andtried to helpEpstein hide negative online news stories about himself.\n\nAccording to an email, Epstein made plans to attend Def Con along with Holman in 2013, but it’s unclear if they attended. Def Con founder Jeff Mosssaidthat as far as he knows, “Epstein never attended.”",
      "excerpt": "Def Con, one of the largest and longest-running hacking conferences in the world, announced on Wednesday that three people linked to Jeffrey Epstein are no longer allowed to attend.\n\nThe conference justified adding Pablos Holman, Vincenzo Iozzo, and Joichi Ito to its public list ofbanned individuals",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}