{
  "last_updated": "2026-02-18T14:49:22.393751+00:00",
  "articles": [
    {
      "title": "Tesla dodges 30-day suspension in California after removing ‘Autopilot’",
      "link": "https://techcrunch.com/2026/02/17/tesla-dodges-30-day-suspension-in-california-after-removing-autopilot/",
      "author": "Kirsten Korosec",
      "date": "2026-02-17T20:07:15-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/tesla-autopiot-Getty.jpg?resize=1200,800",
      "category": "Transportation",
      "content": "The California Department of Motor Vehicles will not suspend Tesla’s sales and manufacturing licenses for 30 days because the EV maker has stopped using the term “Autopilot” in the marketing of its vehicles in the state.\n\nThe decision,issued late Tuesday, means Tesla can continue selling its EVs in California without interruption and officially settles a case that has been dragging on for nearly three years. California is Tesla’s biggest U.S. market.\n\nIn November 2023, the DMV filed accusations that Tesla violated state law by using deceptive marketing of Autopilot, its basic advanced driver assistance system, as well as its more capable Full Self-Driving driver assistance software. The state regulator argued that the terms mislead customers and distorted the capabilities of the advanced driver assistance systems.\n\nTesla stopped using the term “Full Self-Driving Capability,” and instead used Full Self-Driving (Supervised) to more accurately describe the system and clarify that drivers were still required to monitor it. But Tesla held on to the Autopilot term, prompting the DMV to refer the case to an administrative law judge at the California Office of Administrative Hearings.\n\nIn December, the administrative law judge agreed with the DMV’s request to suspend Tesla’s sales and manufacturing licenses in the state for 30 days as a penalty for its actions. The DMV agreed with the ruling, but didn’t pounce; instead, the state regulator gave Tesla 60 days to comply.\n\n“Since then, Tesla took corrective action and has stopped using the misleading term ‘Autopilot’ in the marketing of its electric vehicles in California,” the DMV stated in a release posted on its website. “Tesla had previously modified its use of the term ‘Full Self-Driving’ to clarify that driver supervision is required. By taking this prescribed action, Tesla will avoid having its dealer and manufacturer licenses suspended in the state for 30 days by the DMV.”\n\nTesla didn’t just stop using the term Autopilot, though. In January, the companydiscontinued Autopilotin the U.S. and Canada altogether. The move not only helped it comply with the DMV but was also viewed as a way to boost adoption of FSD, which unlike Autopilot, requires the owner to pay for the upgraded system.\n\nFSD Supervised, which until February 14 required an $8,000 one-time fee, is now only available through a monthly subscription of $99. That subscription fee is expected to increase as the system becomes more capable, Tesla CEO Elon Muskhas said.",
      "excerpt": "The California Department of Motor Vehicles will not suspend Tesla’s sales and manufacturing licenses for 30 days because the EV maker has stopped using the term “Autopilot” in the marketing of its vehicles in the state.\n\nThe decision,issued late Tuesday, means Tesla can continue selling its EVs in ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Meta’s own research found parental supervision doesn’t really help curb teens’ compulsive social media use",
      "link": "https://techcrunch.com/2026/02/17/metas-own-research-found-parental-supervision-doesnt-really-help-curb-teens-compulsive-social-media-use/",
      "author": "Sarah Perez",
      "date": "2026-02-17T12:45:33-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2021/12/GettyImages-1237098710.jpeg?resize=1200,800",
      "category": "Social",
      "content": "An internal research study at Meta dubbed “Project MYST” created in partnership with theUniversity of Chicago, found that parental supervision and controls — such as time limits and restricted access — had little impact on kids’ compulsive use of social media. The study also found that kids who experienced stressful life events were more likely to lack the ability to moderate their social media use appropriately.\n\nThis was one of the notable claims revealed during testimony at the social media addiction trial that began last week in Los Angeles County Superior Court. The plaintiff in the lawsuit is identified by her initials “KGM” or her first name, “Kaley.” She, along with her mother and others joining the case, is accusing social media companies of creating “addictive and dangerous” products that led the young users to suffer anxiety, depression, body dysmorphia, eating disorders, self-harm, suicidal ideation, and more.\n\nThe case is now one of several landmark trials that will take place this year, which accuse social media companies of harming children. The results of these lawsuits will impact these companies’ approach to their younger users and could prompt regulators to take further action.\n\nIn this case, the plaintiff sued Meta, YouTube, ByteDance (TikTok), and Snap, but the latter two companieshadsettledtheir claims before the trial’s start.\n\nIn the jury trial now underway in LA, Kaley’s lawyer, Mark Lanier, brought up an internal study at Meta, which he said found evidence that Meta knew of, yet didn’t publicize, these specific harms.\n\nIn Project MYST, which stands for the Meta and Youth Social Emotional Trends survey, Meta’s research concluded that “parental and household factors have little association with teens’ reported levels of attentiveness to their social media use.”\n\nOr, in other words, even when parents try to control their children’s social media use, either by using parental controls or even just household rules and supervision, it doesn’t impact whether or not the child will overuse social media or use it compulsively. The study was based on a survey of 1,000 teens and their parents about their social media use.\n\nThe study also noted that both parents and teens agreed on this front, saying “there is no association between either parental reports or teen reports of parental supervision, and teens’ survey measures of attentiveness or capability.”\n\nIf the study’s findings are accurate, that would mean that the use of things like the built-in parental controls in the Instagram app or the time limits on smartphones wouldn’t necessarily help teens become less inclined to overuse social media, the plaintiff’s lawyer argued. As the original complaint alleges, teens are being exploited by social media products, whose defects include algorithmic feeds designed to keep users scrolling, intermittent variable rewards that manipulate dopamine delivery, incessant notifications, deficient tools for parental controls, and more.\n\nDuring his testimony, Instagram head Adam Mosseri claimed not to be familiar with Meta’s Project MYST, even though a document seemed to indicate he had given his approval to move forward with the study.\n\n“We do a lot of research projects,” Mosseri said, after claiming he couldn’t remember anything specific about MYST beyond its name.\n\nHowever, the plaintiff’s lawyer pointed to this study as an example of why social media companies should be held accountable for their alleged harms, not the parents. He noted that Kaley’s mother, for example, had tried to stop her daughter’s social media addiction and use, even taking her phone away at times.\n\nWhat’s more, the study found that teens who had a greater number of adverse life experiences — like those dealing with alcoholic parents, harassment at school, or other issues — reported less attentiveness over their social media use. That means that kids facing trauma in their real lives were more at risk of addiction, the lawyer argued.\n\nOn the stand, Mosseri seemed to partially agree with this finding, saying, “There’s a variety of reasons this can be the case. One I’ve heard often is that people use Instagram as a way to escape from a more difficult reality.” Meta is careful not to label any sort of overuse as addiction; instead, Mosseri stated that the company uses the term “problematic use” to refer to someone “spending more time on Instagram than they feel good about.”\n\nLawyers for Meta, meanwhile, pushed the idea that the study was more narrowly focused on understanding if teens felt they were using social media too much, not whether or not they were actually addicted. They also generally aimed to put more of the responsibility on parents and the realities of life as the catalyst for kids like Kaley’s negative emotional states, not companies’ social media products.\n\nFor instance,Meta’s lawyers pointed toKaley being a child of divorced parents, with an abusive father, and facing bullying at school.\n\nHow the jury will interpret the findings of studies likeProject MYST and others, along with the testimonies from both sides, remains to be seen. Mosseri did note, however, that MYST’s findings had not been published publicly, and no warnings were ever issued to teens or parents as a result of the research.\n\nMeta has been asked for comment.",
      "excerpt": "An internal research study at Meta dubbed “Project MYST” created in partnership with theUniversity of Chicago, found that parental supervision and controls — such as time limits and restricted access — had little impact on kids’ compulsive use of social media. The study also found that kids who expe",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "U.S. court bars OpenAI from using ‘Cameo’",
      "link": "https://techcrunch.com/2026/02/17/u-s-court-bars-openai-from-using-cameo/",
      "author": "Ivan Mehta",
      "date": "2026-02-17T22:40:59-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/10/sora-app-GettyImages2238161095.jpg?w=1024",
      "category": "Apps",
      "content": "A federal district court in Northern California ruled in favor of Cameo, a platform that allows users to get personalized video messages from celebrities, and ordered OpenAI to stop using “Cameo” in its products and features.\n\nOpenAI was using the “Cameo” name for its AI-powered video generation app Sora 2. Users could use that feature to insert digital likenesses of themselves into AI-generated videos. In a ruling filed Saturday, the court said the name was similar enough to cause user confusion, and rejected OpenAI’s argument that “Cameo” was merely descriptive, finding that “it suggests rather than describes the feature.”\n\nIn November,the court granted a temporary restraining order to Cameoand stopped OpenAI from using the word. The AI company thenrenamed the feature to “Characters”after that order.\n\n“We have spent nearly a decade building a brand that stands for talent-friendly interactions and genuine connection, and we like to say that ‘every Cameo is a commercial for the next one.” Cameo CEO Steven Galanis said in a statement.\n\n“This ruling is a critical victory not just for our company, but for the integrity of our marketplace and the thousands of creators who trust the Cameo name. We will continue to vigorously defend our intellectual property against any platform that attempts to trade on the goodwill and recognition we have worked so hard to establish,” he noted.\n\n“We disagree with the complaint’s assertion that anyone can claim exclusive ownership over the word ‘cameo,’ and we look forward to continuing to make our case,” an OpenAI spokesperson toldReutersin response to the ruling.\n\nOpenAI has been involved in several intellectual property cases in recent months. Earlier this month, the company ditched “IO” branding around its upcoming hardware products, according to court documents obtained byWIRED. In November, digital library app OverDrive sued OpenAIover its use of “Sora”for its video generation app. The company is also in legal disputes withvarious artists, creatives, and media groupsinvarious geographiesover copyright violations.",
      "excerpt": "A federal district court in Northern California ruled in favor of Cameo, a platform that allows users to get personalized video messages from celebrities, and ordered OpenAI to stop using “Cameo” in its products and features.\n\nOpenAI was using the “Cameo” name for its AI-powered video generation app",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "SpaceX vets raise $50M Series A for data center links",
      "link": "https://techcrunch.com/2026/02/17/spacex-vets-raise-50m-series-a-for-data-center-links/",
      "author": "Tim Fernholz",
      "date": "2026-02-17T09:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Screenshot-2026-02-16-at-11.06.38-AM.png?resize=1200,679",
      "category": "AI",
      "content": "Travis Brashears, Cameron Ramos, and Serena Grown-Haeberli began collaborating at SpaceX, developing optical communications links that keep thousands of Starlink internet satellites in constant contact.\n\nNow, the three engineers are co-founders of Mesh Optical Technologies, a Los Angeles startup that announced a $50 million Series A led by Thrive Capital on Tuesday.\n\nMesh aims to mass-produce optical transceivers, devices that convert optical signals from fiber or laser into electrical signals for computers. CEO Brashears, President Ramos, and VP of Product Grown-Haeberli realized the opportunity when designing a new generation of compute-hungry SpaceX satellites forced them to assess the optical transceiver market, and they saw its limitations.\n\nOptical transceivers are particularly important for data centers aimed at training and operating large deep learning models, because they allow multiple GPUs to work in concert. One established U.S. supplier, AOI,won a contractworth $4 billion to provide components for AWS data centers last year.\n\n“Someone will brag about a million GPU cluster; you have to multiply by four to five for the number of transceivers in that cluster,” Brashears explained.\n\nThe company’s goal is to manufacture a thousand units per day within the year so they can begin qualifying for bulk orders in 2027 and 2028.\n\nThe optical transceiver market is dominated by Chinese firms and suppliers, and Mesh sees an advantage in building its supply chain outside of that country. While trade restrictions haven’t impacted the market yet, the founders and their backers see themselves as getting in front of a national security dilemma.\n\n“If AI is the most important technology in several generations (which we believe to be true), to have critical parts of AI data center capex run through misaligned/competitive countries is a problem,” Thrive Partner Philip Clark wrote TechCrunch. “In the immediate term, Mesh is solving our need for better ways to do interconnect if we want to keep scaling AI.”\n\nThe challenge for Mesh, the founders say, is executing lights-out, automated manufacturing techniques, which aren’t common in U.S. industry. So much of this expertise is concentrated in China that even European equipment suppliers expect Chinese customers — one German firm’s standard intake form asks for a Chinese company registration number.\n\nBy co-locating design and production, the founders hope to realize more efficient and lower-cost components. Their current design removes one commonly used but power-hungry component, which Ramos said could reduce GPU cluster power usage by 3% to 5%, a meaningful amount as hyperscalers seek to wring as much efficiency out of their systems as possible.\n\nData centers are just the beginning of Mesh’s aspirations; the company sees optical wavelength communications as the next paradigm in communications.\n\n“The world has primarily focused on [radio frequencies] for a long time,” Brashears told TechCrunch. “We want to be at the precipice of transition from RF to photonics…we want to interconnect everything, and not just computers, but that’s where we’re starting.”",
      "excerpt": "Travis Brashears, Cameron Ramos, and Serena Grown-Haeberli began collaborating at SpaceX, developing optical communications links that keep thousands of Starlink internet satellites in constant contact.\n\nNow, the three engineers are co-founders of Mesh Optical Technologies, a Los Angeles startup tha",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Thrive raises $10B for new fund, its largest yet",
      "link": "https://techcrunch.com/2026/02/17/thrive-raises-10b-for-new-fund-its-largest-yet/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-17T12:13:12-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2184416821.jpg?w=1024",
      "category": "",
      "content": "Thrive Capital just raised $10 billion for a new fund — the largest fund it has ever raised and nearly double the size of its last fund. Of this, $1 billion is dedicated to early-stage investments, while the rest is for growth-stage investments, according to anannouncement from the firm.\n\nThrive told Bloomberg that this latest fundraise wasoversubscribed. This is the firm’s 10th fund — called Thrive X — and comes as some of the firm’s biggest investments, including OpenAI, Stripe, and SpaceX, continue to soar in value. Some of the firm’s other notable investments include Databricks, Anduril, and Cursor. The firm also incubates companies, having spun up 12 so far, with at least six now having reached unicorn status.\n\nThe firm’s strategy is to “commit deeply to a small number of founders,” the firm said in its announcement. “Concentration demands loyalty to the founders and missions we back.”\n\nSpeaking to Bloomberg, Josh Kushner, founder of the firm, said he believed the winners of the AI boom would “be bigger than we can ever imagine,” and that the technology is still nascent.\n\nThrive’s massive raise also hints at something else. IPO rumors have swirled around OpenAI and SpaceX in particular, bringing considerable interest from limited partners awaiting returns. These two companies could lead to an unprecedented flow of capital back tolimited partners.\n\nWe’ve reached out to Thrive for more information.",
      "excerpt": "Thrive Capital just raised $10 billion for a new fund — the largest fund it has ever raised and nearly double the size of its last fund. Of this, $1 billion is dedicated to early-stage investments, while the rest is for growth-stage investments, according to anannouncement from the firm.\n\nThrive tol",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Apple is reportedly cooking up a trio of AI wearables",
      "link": "https://techcrunch.com/2026/02/17/apple-is-reportedly-cooking-up-a-trio-of-ai-wearables/",
      "author": "Lucas Ropek",
      "date": "2026-02-17T12:14:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/tim-cook-speaking-GettyImages-2234517834.jpg?w=1024",
      "category": "",
      "content": "Late last month, The Informationreported thatApple was developing an AI wearable — an AirTag-sized pendant with cameras that could be pinned to a user’s shirt. Now, Bloombergwrites thatthe development of such a device — along with two other AI-powered items — is accelerating as Apple looks to stay competitive with other tech giants that are racing to release similar products.\n\nIn addition to the AI pin, Apple is also speeding up the development of its upcoming AI-powered smart glasses,which have been code-named N50, the report claims. Apple obviously has competition in this space, as other companies — including Meta (which is arguably the mostsuccessful playerwhen it comes to smart glasses) and Snap (whichplans to releaseits “Specs” later this year) — are working on similar products.\n\nApple’s new smart glasses, which will supposedly include a high-resolution camera, may see a public release sooner rather than later, with Bloomberg reporting that the company is “targeting the start of production as early as December, ahead of a public release in 2027.”\n\nAdditionally, Bloomberg reports that Apple is working on AirPods with new AI capabilities.\n\nAll of these items will be designed to connect to the iPhone and will include Siri, the company’s virtual assistant, as a critical component of the user experience, the outlet notes. The glasses are being described as “more upscale and feature-rich” than the AirPods and the AI pendant, however. TechCrunch reached out to Apple for more information.",
      "excerpt": "Late last month, The Informationreported thatApple was developing an AI wearable — an AirTag-sized pendant with cameras that could be pinned to a user’s shirt. Now, Bloombergwrites thatthe development of such a device — along with two other AI-powered items — is accelerating as Apple looks to stay c",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Anthropic releases Sonnet 4.6",
      "link": "https://techcrunch.com/2026/02/17/anthropic-releases-sonnet-4-6/",
      "author": "Russell Brandom",
      "date": "2026-02-17T10:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/08/Claude-Chrome-Ext_email-hero-hero.png?w=1200",
      "category": "",
      "content": "Anthropic has released a new version of its midsized Sonnet model, keeping pace with the company’s four-month update cycle.In a post announcing the new model, Anthropic emphasized improvements in coding, instruction-following, and computer use.\n\nSonnet 4.6 will be the default model for Free and Pro plan users.\n\nThe beta release of Sonnet 4.6 will include a context window of 1 million tokens, twice the size of the largest window previously available for Sonnet. Anthropic described the new context window as “enough to hold entire codebases, lengthy contracts, or dozens of research papers in a single request.”\n\nThe release comes just two weeks afterthe launch of Opus 4.6, with an updated Haiku model likely to follow in the coming weeks.\n\nThe launch comes with a new set of record benchmark scores, including OS World for computer use and SWE-Bench for software engineering. But perhaps the most impressive is its 60.4% score on ARC-AGI-2, meant to measure skills specific to human intelligence. The score puts Sonnet 4.6 above most comparable models, although it still trails models like Opus 4.6, Gemini 3 Deep Think, and one refined version of GPT 5.2.",
      "excerpt": "Anthropic has released a new version of its midsized Sonnet model, keeping pace with the company’s four-month update cycle.In a post announcing the new model, Anthropic emphasized improvements in coding, instruction-following, and computer use.\n\nSonnet 4.6 will be the default model for Free and Pro ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Running AI models is turning into a memory game",
      "link": "https://techcrunch.com/2026/02/17/running-ai-models-is-turning-into-a-memory-game/",
      "author": "Russell Brandom",
      "date": "2026-02-17T08:44:14-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2009/01/samsung_50nm_dram.jpg?w=425",
      "category": "AI",
      "content": "When we talk about the cost of AI infrastructure, the focus is usually on Nvidia and GPUs — but memory is an increasingly important part of the picture. As hyperscalers prepare to build out billions of dollars’ worth of new data centers, the price for DRAM chips has jumpedroughly 7x in the last year.\n\nAt the same time, there’s a growing discipline in orchestrating all that memory to make sure the right data gets to the right agent at the right time. The companies that master it will be able to make the same queries with fewer tokens, which can be the difference between folding and staying in business.\n\nSemiconductor analystDoug O’Laughlinhas an interesting look at the importance of memory chips on his Substack, where he talks with Val Bercovici, chief AI officer at Weka. They’re both semiconductor guys, so the focus is more on the chips than the broader architecture; the implications for AI software are pretty significant too.\n\nI was particularly struck by this passage, in which Bercovici looks at the growing complexity ofAnthropic’s prompt-caching documentation:\n\nThe tell is if we go to Anthropic’s prompt caching pricing page. It started off as a very simple page six or seven months ago, especially as Claude Code was launching — just “use caching, it’s cheaper.” Now it’s an encyclopedia of advice on exactly how many cache writes to pre-buy. You’ve got 5-minute tiers, which are very common across the industry, or 1-hour tiers — and nothing above. That’s a really important tell. Then of course you’ve got all sorts of arbitrage opportunities around the pricing for cache reads based on how many cache writes you’ve pre-purchased.\n\nThe question here is how long Claude holds your prompt in cached memory: You can pay for a 5-minute window, or pay more for an hour-long window. It’s much cheaper to draw on data that’s still in the cache, so if you manage it right, you can save an awful lot. There is a catch though: Every new bit of data you add to the query may bump something else out of the cache window.\n\nThis is complex stuff, but the upshot is simple enough: Managing memory in AI models is going to be a huge part of AI going forward. Companies that do it well are going to rise to the top.\n\nAnd there is plenty of progress to be made in this new field. Back in October, I covereda startup called Tensormeshthat was working on one layer in the stack known as cache optimization.\n\nOpportunities exist in other parts of the stack. For instance, lower down the stack, there’s the question of how data centers are using the different types of memory they have. (The interview includes a nice discussion of when DRAM chips are used instead of HBM, although it’s pretty deep in the hardware weeds.) Higher up the stack, end users are figuring out how to structure their model swarms to take advantage of the shared cache.\n\nAs companies get better at memory orchestration, they’ll use fewer tokens and inference will get cheaper. Meanwhile,models are getting more efficient at processing each token, pushing the cost down still further. As server costs drop, a lot of applications that don’t seem viable now will start to edge into profitability.",
      "excerpt": "When we talk about the cost of AI infrastructure, the focus is usually on Nvidia and GPUs — but memory is an increasingly important part of the picture. As hyperscalers prepare to build out billions of dollars’ worth of new data centers, the price for DRAM chips has jumpedroughly 7x in the last year",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Microsoft says Office bug exposed customers’ confidential emails to Copilot AI",
      "link": "https://techcrunch.com/2026/02/18/microsoft-says-office-bug-exposed-customers-confidential-emails-to-copilot-ai/",
      "author": "Zack Whittaker",
      "date": "2026-02-18T06:44:28-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/04/GettyImages-2041281128-e1712563728365.jpg?resize=1200,676",
      "category": "",
      "content": "Microsoft has confirmed that a bug allowed its Copilot AI to summarize customers’ confidential emails for weeks without permission.\n\nThe bug, first reported byBleeping Computer, allowed Copilot Chat to read and outline the contents of emails since January, even if customers had data loss prevention policies to prevent ingesting their sensitive information into Microsoft’s large language model.\n\nCopilot Chat allows paying Microsoft 365 customers to use the AI-powered chat feature in its Office software products, including Word, Excel, and PowerPoint.\n\nMicrosoft said the bug, trackable by admins asCW1226324, means that draft and sent email messages “with a confidential label applied are being incorrectly processed by Microsoft 365 Copilot chat.”\n\nThe tech giant said it began rolling out a fix for the bug earlier in February. A spokesperson for Microsoft did not respond to a request for comment, including a question about how many customers are affected by the bug.\n\nEarlier this week, the European Parliament’s IT departmenttold lawmakersthat it blocked the built-in AI features on their work-issued devices, citing concerns that the AI tools could upload potentially confidential correspondence to the cloud.",
      "excerpt": "Microsoft has confirmed that a bug allowed its Copilot AI to summarize customers’ confidential emails for weeks without permission.\n\nThe bug, first reported byBleeping Computer, allowed Copilot Chat to read and outline the contents of emails since January, even if customers had data loss prevention ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "OpenAI pushes into higher education as India seeks to scale AI skills",
      "link": "https://techcrunch.com/2026/02/18/openai-pushes-into-higher-education-as-india-seeks-to-scale-ai-skills/",
      "author": "Jagmeet Singh",
      "date": "2026-02-18T06:32:42-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/08/openai-india.jpg?resize=1200,800",
      "category": "AI",
      "content": "OpenAI is expanding its footprint in India and moving into the country’s higher-education system through partnerships with leading academic institutions. The move comes as the South Asian nation seeks to scale AI skills and build domestic capacity in one of the world’s largest talent markets.\n\nOn Wednesday, OpenAI said it was partnering with six public and private higher-education institutions in India, including top engineering, management, medical, and design-focused institutes, with the aim of reaching more than 100,000 students, faculty, and staff over the next year.\n\nRather than focusing on consumer use, the initiative centers on integrating AI into core academic functions, signalling OpenAI’s interest in influencing how AI is taught, governed, and normalized within one of the world’s largest higher-education systems.\n\nOpenAI has already built a large consumer audience for its ChatGPT chatbot, which has over100 million monthly active usersin India, according to CEO Sam Altman, and India has emerged as the company’s second-largest user base after the U.S. The announcement also coincides with a broader push by leading AI firms to deepen their presence in India, which is hosting anAI Impact Summitin New Delhi this week.\n\nThe first cohort of partners includes some of India’s most influential academic institutions, such as the Indian Institute of Technology Delhi, the Indian Institute of Management Ahmedabad, and the All India Institute of Medical Sciences New Delhi, alongside private universities and specialised design schools. The ChatGPT maker said the partnerships would span disciplines ranging from engineering and management to healthcare and creative fields.\n\nIndia has already emerged as a key testing ground for AI use in education. Last month, Google said India accounts for thehighest global usage of its Gemini tools for learning. Microsoft, similarly, said this week it wouldexpand its Elevate skilling programin India to train teachers across schools, vocational institutes, and higher-education settings, working with government agencies as part of a broader push to build AI skills at scale.\n\nOpenAI said the partnerships would involve campus-wide access to its ChatGPT Edu tools, faculty training, and responsible-use frameworks. The focus, the company said, is on embedding AI into core academic workflows such as coding, research, analytics, and case analysis, rather than offering standalone access to tools.\n\nTwo of the partner institutions, the Indian Institute of Management Ahmedabad and Manipal Academy of Higher Education, will also introduce OpenAI-backed certifications. Additionally, OpenAI said it would work with Indian ed-tech platforms, including PhysicsWallah, upGrad, and HCL GUVI, to extend AI training beyond campuses. These platforms will launch structured courses on AI fundamentals and ChatGPT use cases, aimed at students and early-career professionals.\n\nRaghav Gupta, head of education at OpenAI India, said educational institutions were a “critical route” to closing the gap between rapidly advancing AI tools and how people are actually using them, as skills demands shift across the economy.\n\nLast year, OpenAI hired Gupta, a former Coursera Asia-Pacific managing director, as its India and Asia-Pacific head of education, alongside the launch of a Learning Accelerator programme focused on expanding AI skills.\n\nThe flurry of moves into education underscores how AI companies are increasingly looking beyond consumer tools and corporate clients toward institutions that shape skills, norms, and long-term adoption. For countries like India, the contest is not just around access to AI, but also about who helps define how it is taught, governed, and embedded at scale.",
      "excerpt": "OpenAI is expanding its footprint in India and moving into the country’s higher-education system through partnerships with leading academic institutions. The move comes as the South Asian nation seeks to scale AI skills and build domestic capacity in one of the world’s largest talent markets.\n\nOn We",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}