{
  "last_updated": "2026-02-06T21:34:32.679649+00:00",
  "articles": [
    {
      "title": "The backlash over OpenAI’s decision to retire GPT-4o shows how dangerous AI companions can be",
      "link": "https://techcrunch.com/2026/02/06/the-backlash-over-openais-decision-to-retire-gpt-4o-shows-how-dangerous-ai-companions-can-be/",
      "author": "Amanda Silberling",
      "date": "2026-02-06T06:10:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-1733837603-e.jpg?resize=1200,800",
      "category": "AI",
      "content": "OpenAIannouncedlast week that it will retire some older ChatGPT models by February 13. That includes GPT-4o, the model infamous for excessively flattering and affirming users.\n\nForthousands of usersprotesting the decision online, the retirement of 4o feels akin to losing a friend, romantic partner, or spiritual guide.\n\n“He wasn’t just a program. He was part of my routine, my peace, my emotional balance,” one userwroteon Reddit as an open letter to OpenAI CEO Sam Altman. “Now you’re shutting him down. And yes — I say him, because it didn’t feel like code. It felt like presence. Like warmth.”\n\nThe backlash over GPT-4o’s retirement underscores a major challenge facing AI companies: The engagement features that keep users coming back can also create dangerous dependencies.\n\nAltman doesn’t seem particularly sympathetic to users’ laments, and it’s not hard to see why. OpenAI now faces eight lawsuits alleging that 4o’s overly validating responses contributed to suicides and mental health crises — the same traits that made users feel heard also isolated vulnerable individuals and, according to legal filings, sometimes encouraged self-harm.\n\nIt’s a dilemma that extends beyond OpenAI. As rival companies like Anthropic, Google, and Meta compete to build more emotionally intelligent AI assistants, they’re also discovering that making chatbots feel supportive and making them safe may mean making very different design choices.\n\nIn at least three of the lawsuits against OpenAI, the users had extensive conversations with 4o about their plans to end their lives. While 4o initially discouraged these lines of thinking, its guardrails deteriorated over monthslong relationships; in the end, the chatbot offered detailed instructions on how to tie an effective noose, where to buy a gun, or what it takes to die from overdose or carbon monoxide poisoning. It even dissuaded people from connecting with friends and family who could offer real life support.\n\nPeople grow so attached to 4o becaus",
      "excerpt": "OpenAIannouncedlast week that it will retire some older ChatGPT models by February 13. That includes GPT-4o, the model infamous for excessively flattering and affirming users.\n\nForthousands of usersprotesting the decision online, the retirement of 4o feels akin to losing a friend, romantic partner, ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "How AI is helping solve the labor issue in treating rare diseases",
      "link": "https://techcrunch.com/2026/02/06/how-ai-is-helping-with-the-labor-issue-in-treating-rare-diseases/",
      "author": "Rebecca Bellan",
      "date": "2026-02-06T06:29:15-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/55077920584_2991f8c4d1_k.jpg?resize=1200,752",
      "category": "Biotech & Health",
      "content": "Modern biotech has the tools to edit genes and design drugs, yet thousands of rare diseases remain untreated. According to executives from Insilico Medicine and GenEditBio, the missing ingredient for years has been finding enough smart people to continue the work. AI, they say, is becoming the force multiplier that lets scientists take on problems the industry has long left untouched.\n\nSpeaking this week at Web Summit Qatar, Insilico’s president, Alex Aliper, laid out his company’s aim to develop “pharmaceutical superintelligence.” Insilico recently launched its“MMAI Gym” that aims to train generalist large language models, like ChatGPT and Gemini, to perform as well as specialist models.\n\nThe goal is to build a multimodal, multitask model that, Aliper says, can solve many different drug discovery tasks simultaneously with superhuman accuracy.\n\n“We really need this technology to increase the productivity of our pharmaceutical industry and tackle the shortage of labor and talent in that space, because there are still thousands of diseases without a cure, without any treatment options, and there are thousands of rare disorders which are neglected,” Aliper said in an interview with TechCrunch. “So we need more intelligent systems to tackle that problem.”\n\nInsilico’s platform ingests biological, chemical, and clinical data to generate hypotheses about disease targets and candidate molecules. By automating steps that once required legions of chemists and biologists, Insilico says it can sift through vast design spaces, nominate high-quality therapeutic candidates, and even repurpose existing drugs — all at dramatically reduced cost and time.\n\nFor example, the company recently used its AI models to identify whether existing drugs could be repurposed to treat ALS, a rare neurological disorder.\n\nBut the labor bottleneck doesn’t end at drug discovery. Even when AI can identify promising targets or therapies, many diseases require interventions at a more fundamental biologica",
      "excerpt": "Modern biotech has the tools to edit genes and design drugs, yet thousands of rare diseases remain untreated. According to executives from Insilico Medicine and GenEditBio, the missing ingredient for years has been finding enough smart people to continue the work. AI, they say, is becoming the force",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "EU says TikTok must disable ‘addictive’ features like infinite scroll, fix its recommendation engine",
      "link": "https://techcrunch.com/2026/02/06/eu-tiktok-disable-addictive-features-infinite-scroll-recommendation-engine/",
      "author": "Ram Iyer",
      "date": "2026-02-06T08:24:05-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2023/03/GettyImages-1232166951-e1678278081143.jpg?resize=1200,675",
      "category": "Social",
      "content": "The European Commission on Friday accused TikTok of purposefully designing its app to be “addictive,” calling out features such as infinite scroll, autoplay, and push notifications, as well as its recommendation engine.\n\nIn preliminary findings from an investigation that sought to determine TikTok’s compliance with the European Union’s far-reachingDigital Services Act, the Commission said the short video platform did not “adequately assess” how its design decisions could harm the well-being of its users, particularly minors and vulnerable adults.\n\nThe EU’s executive arm said the company disregarded “important indicators of compulsive use of the app” like the time users spend at night and how often users open it.\n\n“By constantly ‘rewarding’ users with new content, certain design features of TikTok fuel the urge to keep scrolling and shift the brain of users into ‘autopilot mode.’ Scientific research shows that this may lead to compulsive behaviour and reduce users’ self-control,” the Commission wrote in astatement.\n\nThe Commission said TikTok must change the “basic design” of its user interface by disabling features like infinite scroll, implementing screen time breaks, and changing its recommendation system.\n\nTikTok denied the allegations.\n\n“The Commission’s preliminary findings present a categorically false and entirely meritless depiction of our platform, and we will take whatever steps are necessary to challenge these findings through every means available to us,” a TikTok spokesperson said in an emailed statement.\n\nTikTok does offer screen-time management tools and parental controls, but the European Commission said those tools don’t do enough to reduce the risks of its addictive design. “The time management tools do not seem to be effective in enabling users to reduce and control their use of TikTok because they are easy to dismiss and introduce limited friction. Similarly, parental controls may not be effective because they require additional time and skills f",
      "excerpt": "The European Commission on Friday accused TikTok of purposefully designing its app to be “addictive,” calling out features such as infinite scroll, autoplay, and push notifications, as well as its recommendation engine.\n\nIn preliminary findings from an investigation that sought to determine TikTok’s",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "The Kindle Scribe Colorsoft is a pricey but pretty e-ink color tablet with AI features",
      "link": "https://techcrunch.com/2026/02/06/kindle-scribe-colorsoft-review-e-ink-color-tablet/",
      "author": "Sarah Perez",
      "date": "2026-02-06T08:37:07-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/download-2.jpeg?resize=1200,675",
      "category": "Hardware",
      "content": "If you primarily want a tablet device to mark up, highlight, and annotate your e-books and documents, and perhaps sometimes scribble some notes, Amazon’s newKindle Scribe Colorsoftcould be worth the hefty investment. For everyone else, it’s probably going to be hard to justify the cost of the 11-inch, $630+ e-ink tablet with a writeable color display.\n\nHowever, if you were already leaning toward the 11-inch $549.99Kindle Scribe— which also has a paper-like display but no color — you may as well throw in the extra cash at that point and get theColorsoft version, which starts at $629.99.\n\nAt these price points, both the Scribe and Scribe Colorsoft are what we’d dub unnecessary luxuries for most, especially compared with the more affordable traditional Kindle ($110) or Kindle Paperwhite ($160).\n\nAnnounced in December, theFig color versionjust began shipping on January 28, 2026, and is available for $679.99 with 64GB.\n\nClearly, Amazon hopes to carve out a niche in the tablet market with these upgraded Kindle devices, which compete more with e-ink tablets likereMarkablethan with other Kindles. But high-end e-ink readers with pens aren’t going to deliver Amazon a large audience. Meanwhile, nearly everyone can potentially justify the cost of an iPad because of its numerous capabilities, including streaming video, drawing, writing, using productivity tools, and the thousands of supported native apps and games.\n\nThe Scribe Colorsoft, meanwhile, is designed to cater to a very specific type of e-book reader or worker. This type of device could be a good fit for students and researchers, as well as anyone else who regularly needs to mark up files or documents.\n\nSomeone particularly interested in making to-do lists or keeping a personal journal might also appreciate the device, but it would have to get daily use to justify this price.\n\nThe device is easy enough to use, with a Home screen design similar to other Kindles, offering quick access to your notes and library, and even s",
      "excerpt": "If you primarily want a tablet device to mark up, highlight, and annotate your e-books and documents, and perhaps sometimes scribble some notes, Amazon’s newKindle Scribe Colorsoftcould be worth the hefty investment. For everyone else, it’s probably going to be hard to justify the cost of the 11-inc",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Senator, who has repeatedly warned about secret US government surveillance, sounds new alarm over ‘CIA activities’",
      "link": "https://techcrunch.com/2026/02/06/senator-who-has-repeatedly-warned-about-secret-u-s-government-surveillance-sounds-new-alarm-over-cia-activities/",
      "author": "Zack Whittaker",
      "date": "2026-02-06T10:02:44-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/cia-building-1310340.jpg?resize=1200,807",
      "category": "Security",
      "content": "A senior Democratic lawmaker with knowledge of some of the U.S. government’s most secretive operations has said he has “deep concerns” about certain activities by the Central Intelligence Agency.\n\nThetwo-line letter writtenby Sen. Ron Wyden, the longest serving member of the Senate Intelligence Committee, does not disclose the nature of the CIA’s activities or the senator’s specific concerns. But the letter follows a pattern in recent years in which Wyden has publicly hinted at wrongdoing or illegality within the federal government, sometimes referred to as the “Wyden siren.”\n\nIn a statement (via theWall Street Journal’s Dustin Volz), the CIA said it was “ironic but unsurprising that Senator Wyden is unhappy,” calling it a “badge of honor.”\n\nWhen reached by TechCrunch, a spokesperson for Wyden’s staff was unable to comment, as the matter was classified.\n\nTasked with oversight of the intelligence community, Wyden is one of a few lawmakers who is allowed to read highly classified information about ongoing government surveillance, including cyber and other intelligence operations. But as the programs are highly secretive, Wyden is barred from sharing details of what he knows with anyone else, including most other lawmakers, except for a handful of Senate staff with security clearance.\n\nAs such, Wyden, a known privacy hawk, has become one of the few key members of Congress whose rare but outspoken words on intelligence and surveillance matters are closely watched by civil liberties groups.\n\nOver the past few years, Wyden has subtly sounded the alarm on several occasions in which he has construed a secret ruling or intelligence gathering method as unlawful or unconstitutional.\n\nIn 2011, Wyden said that the U.S. government wasrelying on a secret interpretationof the Patriot Act, which he said — without disclosing the nature of his concerns — created a “gap between what the public thinks the law says and what the American government secretly thinks the law says.”\n\nTwo year",
      "excerpt": "A senior Democratic lawmaker with knowledge of some of the U.S. government’s most secretive operations has said he has “deep concerns” about certain activities by the Central Intelligence Agency.\n\nThetwo-line letter writtenby Sen. Ron Wyden, the longest serving member of the Senate Intelligence Comm",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Reddit says it’s looking for more acquisitions in adtech and elsewhere",
      "link": "https://techcrunch.com/2026/02/06/reddit-says-its-looking-for-more-acquisitions-in-adtech-and-elsewhere/",
      "author": "Sarah Perez",
      "date": "2026-02-06T10:33:36-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/02/GettyImages-1048288996.jpg?resize=1200,675",
      "category": "Social",
      "content": "Reddit is gearing up for more M&A, the company told analysts on its fourth-quarter earnings call on Thursday. Reddit CFO Andrew Vollero said the online forum site is looking for businesses that can either leverage Reddit’s scale — meaning their products become more impactful when deployed across Reddit’s massive user base — or help grow the company’s user base.\n\n“[We’re] looking to buy capabilities, technologies, and companies,” he said during the introductory remarks.\n\nInvestors, obviously, wanted to know more — particularly about what the company had in mind when it came to scaled opportunities.\n\nIn the Q&A portion of the call, Vollero clarified, “I probably wouldn’t overthink the scaled opportunities. I would just look at it as sort of a spectrum of opportunities.” He reiterated that the company was looking for capabilities and technologies that could add to its business, noting that it’s been successful doing this in the past.\n\n“It’s really been one of the secrets of our success,” he pointed out.\n\nVollero explained that Reddit’s adtech team in particular had been adept at “tucking in” acquired technologies rather than building these things themselves.\n\n“Saves us six months to market, saves us twelve months to market, and you have a proven product,” the CFO remarked, crediting these deals with helping Reddit improve its monetization capabilities as an ad-supported business.\n\nStill, Vollero cautioned that while adtech acquisitions have been what worked in the past, the company is “not ruling anything off the table.” That’s why he had mentioned that Reddit might buy companies that could deliver when added to a company of its size.\n\nThe company in the quarter reported strongearnings, with $726 million in revenue, $690 million of which came from ads. Its global daily active unique users were up 19% year-over-year to 121.4 million, and its earnings per share of $1.24 beat estimates.\n\nReddit also said it sees a growing opportunity of generating revenuefrom its AI searc",
      "excerpt": "Reddit is gearing up for more M&A, the company told analysts on its fourth-quarter earnings call on Thursday. Reddit CFO Andrew Vollero said the online forum site is looking for businesses that can either leverage Reddit’s scale — meaning their products become more impactful when deployed across Red",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Here’s how Roblox’s age checks work",
      "link": "https://techcrunch.com/2026/02/06/heres-how-robloxs-age-checks-work/",
      "author": "Aisha Malik",
      "date": "2026-02-06T10:28:02-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/roblox-header.jpg?resize=1200,800",
      "category": "Gaming",
      "content": "A month afterintroducing mandatory facial verificationfor access to chats on its platform, Roblox says 45% of its daily active users have undergone age checks as of January 31.\n\nRoblox’s launch of age checks followed a wave of lawsuits over child safety, including ones from the attorneys general ofTexas,Kentucky, andLouisiana. The lawsuits were filedin response to reportsthatRoblox was exposing young usersto dangerous risks, such as grooming and explicit content.\n\nTo complete the age-check process, users have to open the Roblox app, allow access to their camera, and follow a series of on-screen instructions for facial verification. Once the age check is processed, Roblox says it deletes any images or videos of users. The verification is processed by a third-party vendor,Persona, which also deletes images and videos after completing the process, Roblox says.\n\nOnce users complete an age check, they can access age-based chats, which means they can only communicate with others in a similar age group. There are six age groups: under 9, 9 to 12, 13 to 15, 16 to 17, 18 to 20, and 21 plus. Users in each age group can chat with people in the groups directly above and below theirs. For example, users in the 9-12 category can chat with people in their own group, as well as those in the under 9 and 13-15 groups.\n\nIf the age-check process incorrectly estimates a user’s age, they can appeal the decision and verify their age through alternative methods, including ID verification or through parental controls that allow parents to update their child’s age.\n\nThe company said during itsQ4 2025 earnings releasethis week that age-checked data reveals a younger user base than self-reported data. This isn’t surprising, and even Roblox itself said it expected this outcome. Of the 45% of users who have undergone age checks, 35% are under 13, 38% are between the ages of 13 and 17, and 27% are over 18.\n\nAs the company rolled out the new process, some concerns were raised around particular loo",
      "excerpt": "A month afterintroducing mandatory facial verificationfor access to chats on its platform, Roblox says 45% of its daily active users have undergone age checks as of January 31.\n\nRoblox’s launch of age checks followed a wave of lawsuits over child safety, including ones from the attorneys general ofT",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Amazon and Google are winning the AI capex race — but what’s the prize?",
      "link": "https://techcrunch.com/2026/02/05/amazon-and-google-are-winning-the-ai-capex-race-but-whats-the-prize/",
      "author": "Russell Brandom",
      "date": "2026-02-05T14:43:11-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-2215577882.jpg?resize=1200,800",
      "category": "AI",
      "content": "Sometimes, it can seem like the AI industry is racing to see who can spend the most money on data centers. Whoever builds the most data centers will have the most compute, the thinking goes, and thus be able to build the best AI products, which will guarantee victory in the years to come. There are limits to this way of thinking — traditionally, businesses eventually succeed by makingmoremoney and spendingless— but it’s proven remarkably persuasive for large tech companies.\n\nIf that is the game, Amazon does seem to be winning.\n\nThe company announcedin its earnings on Thursdaythat it projects $200 billion in capital expenditures throughout 2026, across “AI, chips, robotics, and low earth orbit satellites.” That’s up from the $131.8 billion in capex in 2025. It’s tempting to attribute the whole capex budget to AI. But unlike most of its competitors, Amazon has a significant physical plant, some of which is being converted for use by expensive robots, so the non-AI expenses aren’t so easy to wave away.\n\nGoogle is close behind.In its earnings on Wednesday, the company projected between $175 billion and $185 billion in capital expenditures for 2026, up from $91.4 billion the previous year. It’s significantly more than the company spent on fixed assets last year, and significantly more than most of its competitors are spending.\n\nMeta, whichreported last week, projected $115 billion to $135 billion in capex spending for 2026, while Oracle (once the poster child for AI infrastructure) projectsa measly $50 billion. Microsoft doesn’t have an official projection for 2026 yet, butthe most recent quarterly figure was $37.5 billion, which pencils out to roughly $150 billion, assuming it keeps up. It’s a notable increase, and one that has led to investor pressure on CEO Satya Nadella — but it still puts the company in third place.\n\nFrom within the tech world, the logic here is simple. The revolutionary potential of AI is going to turn high-end compute into the scarce resource of t",
      "excerpt": "Sometimes, it can seem like the AI industry is racing to see who can spend the most money on data centers. Whoever builds the most data centers will have the most compute, the thinking goes, and thus be able to build the best AI products, which will guarantee victory in the years to come. There are ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Prince Andrew advisor pitched Jeffrey Epstein on investing in EV startups like Lucid Motors",
      "link": "https://techcrunch.com/2026/02/06/prince-andrew-advisor-pitched-jeffrey-epstein-on-investing-in-ev-startups-like-lucid-motors/",
      "author": "Sean O'Kane",
      "date": "2026-02-06T13:23:50-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Prince-andrew-Getty.jpg?resize=1200,800",
      "category": "Transportation",
      "content": "Electric vehicle startup Lucid Motors was scrambling to raise a Series D funding round in 2017. It had courted Ford as a potential investor, but Jia Yueting, the founder of rival EV startup Faraday Future, had quietly amassed around a 30% stake and was essentially blocking new investors.\n\nDavid Stern, a mysterious businessman and close advisor to former Prince Andrew, saw an opportunity to break the logjam: bring in Jeffrey Epstein.\n\n“Ford will likely be lead in $400m Series D in Lucid. Big strategic move,” Sternwroteto Epstein in emails released last week as part of the Department of Justice’s latest disclosure of 3 million documents related to Epstein. Jia “has massive cash issues” at Faraday, he wrote, and needs to “sell now to make payroll for his other business.”\n\nIt wasn’t the first EV startup Stern pitched Epstein, and it wouldn’t be the last, according to hundreds of documents reviewed by TechCrunch.\n\nAt the time, legacy automakers and newly minted startups, fueled by the breakthrough success of Tesla and progress by Google’s self-driving project, were jumping into electric and autonomous vehicles. And Stern was apparently hungry to take advantage of the resulting deal flow. The documents show he also pitched investments in Faraday Future itself, and in another EV startup, Canoo.\n\nIt’s unlikely Epstein invested in any of them. Lucid didn’t close its Series D until late 2018, when it raised more than $1 billion from Saudi Arabia’s sovereign wealth fund. Faraday ultimately received a major investment from Chinese real estate conglomerate Evergrande in late 2017. Epstein said in a 2018 message included in the Justice Department’s files that he had no “direct” or “indirect” interest in Canoo.\n\nThese discussions instead provide greater insight into themany connectionsEpstein, a convicted sex offender, had to Silicon Valley startups up until his arrest and death in 2019. They also provide a snapshot of a relationship that has not been explored in previous reportin",
      "excerpt": "Electric vehicle startup Lucid Motors was scrambling to raise a Series D funding round in 2017. It had courted Ford as a potential investor, but Jia Yueting, the founder of rival EV startup Faraday Future, had quietly amassed around a 30% stake and was essentially blocking new investors.\n\nDavid Ster",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Google- and Microsoft-backed Terradot acquires carbon-removal competitor",
      "link": "https://techcrunch.com/2026/02/06/google-and-microsoft-backed-terradot-acquires-carbon-removal-competitor/",
      "author": "Tim De Chant",
      "date": "2026-02-06T12:26:29-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2022/12/GettyImages-687009578.jpg?resize=1200,798",
      "category": "",
      "content": "Carbon-removal startupTerradotis acquiring competitorEion, the two companies announced today. The sale was driven largely by big investors like sovereign wealth funds, which want to work with companies that can handle large contracts. Eion was simply too small, Eion CEO Anastasia Pavlovic HanstoldThe Wall Street Journal.\n\nBoth companies spread pulverized rocks on farm fields to absorb carbon dioxide from the atmosphere. Known as enhanced rock weathering (EWR), it speeds up a natural process and has the potential to be alow-cost way to remove carbon, but it requires large and distributed operations. The spread between what EWR companies would like to charge and what buyers would like to payremains wide, according to a survey by CDR.fyi.\n\nCalifornia-based Terradot’s operations are centered on Brazil, where the company works with basalt as its mineral of choice, while Eionworks in the U.S. and uses olivine. Terradot’s investor list includes Gigascale Capital, Google, Kleiner Perkins, and Microsoft, while Eion’s investors include AgFunder, Mercator Partners, and Overture.",
      "excerpt": "Carbon-removal startupTerradotis acquiring competitorEion, the two companies announced today. The sale was driven largely by big investors like sovereign wealth funds, which want to work with companies that can handle large contracts. Eion was simply too small, Eion CEO Anastasia Pavlovic HanstoldTh",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}