{
  "last_updated": "2026-02-05T09:50:46.779669+00:00",
  "articles": [
    {
      "title": "Alphabet won’t talk about the Google-Apple AI deal, even to investors",
      "link": "https://techcrunch.com/2026/02/04/alphabet-wont-talk-about-the-google-apple-ai-deal-even-to-investors/",
      "author": "Sarah Perez",
      "date": "2026-02-04T15:28:31-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/imgi_38_mp840x830mattef8f8f8t-pad1000x1000f8f8f8.jpg?w=1000",
      "category": "AI",
      "content": "Alphabet declined to answer one of its investors during questions about Google’s AI deal with Apple on Wednesday’s fourth-quarter earnings call. Instead of responding to an analyst’s question about how the tech giant is thinking about AI partnerships, such as the one with Apple to power AI for Siri, the question was completely ignored.\n\nThat decision tells us something, though — Alphabet isn’t ready to talk about how this partnership will impact its core business, which is increasingly focused on AI.\n\nOver the years, the Google-Apple relationship has been mutually beneficial. The two companies’ search partnership saw the search giant paying the iPhone maker$20 billionto be the default search engine on Apple devices,filingsfrom the Department of Justice’s lawsuit against the search giant revealed. In turn, Google gained access to Apple’s massive customer base — the iPhone maker last quarterannouncedit has 2.5 billion active devices worldwide, to give you an idea of scale.\n\nThe latest Apple AI deal isrumored to cost Apple roughly $1 billion per year, but the payoff beyond that for Google isn’t as immediately obvious as it is with search. In Google Search, consumers see links to advertisers’ websites at the top of their search results. Ads in AI Mode, which could one day represent the future of Google’s search business, are still an “experiment” for now.\n\nThe company firstannouncedlast May that it would bring ads to AI Mode, the chatbot-style interface for Google Search, but these tests see the ads’ placement below or integrated into the chatbot’s responses. Google is also trying outagentic shopping,including Shop with AI Mode, to guide consumers with product-related queries to a seamless checkout experience from the AI interface.\n\nMeanwhile, Google’s AI competitor Anthropic is taking aim at ad-supported AI withits forthcoming Super Bowl ad,which challenges the business model being adopted by ChatGPT maker OpenAI and Google.\n\nHow this will all play out longer-term is s",
      "excerpt": "Alphabet declined to answer one of its investors during questions about Google’s AI deal with Apple on Wednesday’s fourth-quarter earnings call. Instead of responding to an analyst’s question about how the tech giant is thinking about AI partnerships, such as the one with Apple to power AI for Siri,",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Sam Altman got exceptionally testy over Claude Super Bowl ads",
      "link": "https://techcrunch.com/2026/02/04/sam-altman-got-exceptionally-testy-over-claude-super-bowl-ads/",
      "author": "Julie Bort",
      "date": "2026-02-04T16:45:11-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2019/10/Sam-Altman-OpenAI-DSC02881.jpg?resize=1200,800",
      "category": "AI",
      "content": "Anthropic’s Super Bowl commercial, one of four ads the AI lab droppedon Wednesday, begins with the word “BETRAYAL” splashed boldly across the screen. The camera pans to a man earnestly asking a chatbot (obviously intended to depict ChatGPT) for advice on how to talk to his mom.\n\nThe bot, portrayed by a blonde woman, offers some classic bits of advice. Start by listening. Try a nature walk! And then twists into an ad for a fictitious (we hope!) cougar-dating site called Golden Encounters. Anthropic finishes the spot by saying that while ads are coming to AI, they won’t be coming to its own chatbot, Claude.\n\nAnother commercialfeatures a slight young man looking for advice on building a six pack. After offering his height, age, and weight, the bot serves him an ad for height-boosting insoles.\n\nThe Anthropic commercials are cleverly aimed at OpenAI’s users, after that company’srecent announcementthat ads will be coming to ChatGPT’s free tier. And they caused an immediate stir, spawning headlines that Anthropic“mocks,”“skewers,”and“dunks on”OpenAI.\n\nThey are funny enough that even Sam Altmanadmitted on Xthat he laughed at them. But he clearly didn’t really find them funny. They inspired him to write a novella-sized rant that devolved into calling his rival “dishonest” and “authoritarian.”\n\nFirst, the good part of the Anthropic ads: they are funny, and I laughed.But I wonder why Anthropic would go for something so clearly dishonest. Our most important principle for ads says that we won’t do exactly this; we would obviously never run ads in the way Anthropic…\n\nIn that post, Altman explains that an ad-supported tier is intended to shoulder the burden of offering free ChatGPT to many of its millions of users. ChatGPTis still the most popular chatbot by a large margin.\n\nBut the OpenAI CEO insisted the ads were “dishonest” in implying that ChatGPT will twist a conversation to insert an ad (and possibly for an off-color product, to boot).”We would obviously never run ads in the",
      "excerpt": "Anthropic’s Super Bowl commercial, one of four ads the AI lab droppedon Wednesday, begins with the word “BETRAYAL” splashed boldly across the screen. The camera pans to a man earnestly asking a chatbot (obviously intended to depict ChatGPT) for advice on how to talk to his mom.\n\nThe bot, portrayed b",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Meet Gizmo: A TikTok for interactive, vibe-coded mini apps",
      "link": "https://techcrunch.com/2026/02/04/meet-gizmo-a-tiktok-for-interactive-vibe-coded-mini-apps/",
      "author": "Sarah Perez",
      "date": "2026-02-04T13:45:32-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/gizmo-app.jpg?resize=1200,764",
      "category": "Apps",
      "content": "Gizmo, a TikTok-like app for vibe-coded mini applications, is offering a new way to create interactive media. The relatively new mobile app from the startupAtma Scienceslets anyone create experiences using text, photos, sound, and touch, which are then displayed in a vertical feed, similar to TikTok or Reels. But unlike traditional short-form video apps, you don’t just watch and scroll in Gizmo — you play.\n\nDepending on the type of “Gizmo” you encounter, you might poke the screen, swipe, tap, draw, drag, and more to interact with the mini app. These Gizmos aren’t just games but are more like digital toys — things that could include interactive puzzles, memes, art, animation, or anything else a creator can dream up.\n\nThe result is an engaging, playful feed, where you can like and comment on the tiny creations and even remix existing Gizmos to create your own version, if you choose.\n\nWhat’s more, you don’t need to know how to code or even vibe code to get started. Instead, you can simply type out an AI prompt to explain your idea using natural language.\n\nThe app then leverages AI coding technology to turn your idea into an interactive experience by generating the code that makes it work. As part of this process, Gizmo will also render your idea visually to ensure that each app functions properly and runs smoothly. Apps are also vetted using AI and human moderation to ensure user safety, a companyFAQnotes.\n\nEvery post on gizmo is a mini app#brainrot#robloxmemes#lebronjamesedit\n\nGizmo hails from a New York-based startup calledAtma Sciences, co-founded by Rudd Fawcett and Brandon Francis, along with CEO Josh Siegel and CTO Daniel Amitay. The company last year raised a $5.49 million seed round from First Round Capital and others, according to data fromPitchBook. On the company’s website (which is also silly and interactive), the team explains their focus is on combining “powerful technology with simple, elegant foundations,” starting with their creativity app, Gizmo.\n\nNon",
      "excerpt": "Gizmo, a TikTok-like app for vibe-coded mini applications, is offering a new way to create interactive media. The relatively new mobile app from the startupAtma Scienceslets anyone create experiences using text, photos, sound, and touch, which are then displayed in a vertical feed, similar to TikTok",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Elon Musk’s SpaceX company town is getting a police department",
      "link": "https://techcrunch.com/2026/02/04/elon-musks-spacex-company-town-is-getting-a-police-department/",
      "author": "Sean O'Kane",
      "date": "2026-02-04T13:47:41-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/04/GettyImages-2074390033.jpg?resize=1200,675",
      "category": "Space",
      "content": "Starbase, the company town that Elon Musk’s SpaceX created in South Texas, is forming its own police squad.\n\nThe city’s commission approved anordinanceduring a special meeting Tuesday that would create a municipal police department, subject to approval from the Texas Commission on Law Enforcement (TCOLE). The department will be run by a chief of police elected by the city’s commission, and is expected to hire eight officers, according to local news outletValley Central. It could be up and running in a few months.\n\n“There is a lot of assets here with the operations of SpaceX,” Starbase city administrator Kent Myers told the outlet. “Those assets need to be protected, and so the police department will play a critical part in protecting those assets.”\n\nIt’s not clear if Starbase has submitted its application to the TCOLE yet. The city and the TCOLE did not respond to requests for comment. Starbase reportedly hired security consulting firm Vision Quest Solutions to build out the department.\n\nStarbase is where SpaceX makes and tests its prototype Starship rocket. The city is small — it is currently home to just a few hundred residents, most of whom are SpaceX employees (or family of those workers). But it is geographically isolated. The closest neighboring town is Brownsville, which is about 10 miles away, though the drive can take 45 minutes or longer.\n\nA police department would be the latest addition to public services that have become available in Starbase since it was incorporatedas a city last year. In October, a handful of SpaceX employees who live at Starbasestarted a volunteer fire department. The city also created a fire marshal position and took on its own building inspections and permitting around that same time.\n\nStarbase initially tried to handle law enforcement within its city limits by contracting with the Cameron County sheriff’s office. The citystruck a $3.5 million, five-year contractwith the sheriff’s office that was supposed to see two deputies patrol",
      "excerpt": "Starbase, the company town that Elon Musk’s SpaceX created in South Texas, is forming its own police squad.\n\nThe city’s commission approved anordinanceduring a special meeting Tuesday that would create a municipal police department, subject to approval from the Texas Commission on Law Enforcement (T",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Hackers publish personal information stolen during Harvard, UPenn data breaches",
      "link": "https://techcrunch.com/2026/02/04/hackers-publish-personal-information-stolen-during-harvard-upenn-data-breaches/",
      "author": "Lorenzo Franceschi-Bicchierai",
      "date": "2026-02-04T09:56:37-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/harvard-university-campus-2025.jpg?resize=1200,770",
      "category": "Security",
      "content": "A notorious hacking group has claimed responsibility for last year’s data breaches at Harvard University and the University of Pennsylvania (UPenn) and published the data that they claim to have stolen from the two schools.\n\nOn Wednesday, the group known asShinyHunterspublished what it claims are more than 1 million records from each university on the group’s dedicated leak site, which the gang uses to extort its victims.\n\nIn November,UPenn confirmed a data breachof “a select group of information systems related to Penn’s development and alumni activities.” At the time, the hackers also sent alumni emails announcing the hack fromofficial university addresses.\n\nThe university blamed the breach onsocial engineering, an attack that often relies on hackers impersonating someone and tricking them into doing something they would not normally do. In itsofficial breach disclosure web page, which has since been taken offline, UPenn did not say exactly what type of data the hackers stole, simply saying the cybercriminals accessed “systems related to Penn’s development and alumni activities.”\n\nContact UsDo you have more information about these breaches, or similar attacks? From a non-work device, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram, Keybase and Wire @lorenzofb, oremail.\n\nTechCrunch verified a portion of the dataset by confirming with alumni and public records, such as matching the data against student ID numbers.\n\nLater in November, Harvard University also confirmed a breach on its alumni systems, blaming it on a voicephishingattack, meaning an attack where hackers tricked the targets into clicking on a link or opening an attachment with a voice call.\n\nHarvardsaidthat the stolen data included email addresses, phone numbers, home and business addresses, event attendance, details of donations to the university, and other biographical information relating to the university’s fundraising and alumni engagement activit",
      "excerpt": "A notorious hacking group has claimed responsibility for last year’s data breaches at Harvard University and the University of Pennsylvania (UPenn) and published the data that they claim to have stolen from the two schools.\n\nOn Wednesday, the group known asShinyHunterspublished what it claims are mo",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "As it preps Specs for the masses, Snap’s Q4 shows revenue growth but fewer daily users",
      "link": "https://techcrunch.com/2026/02/04/as-it-preps-specs-for-the-masses-snaps-q4-shows-revenue-growth-but-fewer-daily-users/",
      "author": "Lucas Ropek",
      "date": "2026-02-04T16:07:59-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/09/IMG_1806.jpg?resize=1200,900",
      "category": "Social",
      "content": "Snap is on a mission to diversify its revenue sources — moving from a business model in which it largely chases ad revenue to one where it can also make money through subscriptions and, eventually,hardware. The company’s latest quarterly earnings report shows that, so far, the firm is having moderate success with that strategy.\n\nIn Q4, Snap’s revenuewas $1.7 billion, which is up 10% year-over-year. Its average revenue per user was also up, slightly (to $3.62 from $3.44). The company’s net income was $45 million, up from $9 million the previous year, its earnings report shows.\n\nThe company has also continued to generate a significant amount of revenue from Snap+, the paid subscription service that the platformlaunched back in 2022. The service’s subscribers grew 71% year-over-year, reaching 24 million.\n\nWhile those numbers might seem to suggest a company whose trajectory is headed in the right direction, the earnings report also shows the platform had slightly fewer daily active users last quarter — dropping from 477 million to 474 million. Those users fell away in North America and Europe, the report shows, while growing slightly throughout the rest of the world.\n\nReuters also reportsthat the company expects its revenue during the first quarter of this year to be below analysts’ previous estimates, as competition from Facebook, Instagram, and TikTok cuts into its advertising earnings.\n\nDuring Wednesday’s earnings call, CEO Evan Spiegel focused on the company’s newer offerings, including its recent effort tocharge users for Memoriesstorage — a feature that lets users save and store their Snaps — and its plans to launch Specs later this year. The company has not launched a public-facing version of the augmented-reality glasses since 2019. In anticipation of that event, Snap recentlyannounced the creationof a new subsidiary, Specs Inc., that is focused solely on further developing the glasses.\n\n“Our long-term vision for augmented reality extends beyond the smartphone t",
      "excerpt": "Snap is on a mission to diversify its revenue sources — moving from a business model in which it largely chases ad revenue to one where it can also make money through subscriptions and, eventually,hardware. The company’s latest quarterly earnings report shows that, so far, the firm is having moderat",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Tinder looks to AI to help fight ‘swipe fatigue’ and dating app burnout",
      "link": "https://techcrunch.com/2026/02/04/tinder-looks-to-ai-to-help-fight-swipe-fatigue-and-dating-app-burnout/",
      "author": "Sarah Perez",
      "date": "2026-02-04T10:08:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/03/GettyImages-2197117084.jpg?resize=1200,843",
      "category": "Apps",
      "content": "Tinder is turning to a new AI-powered feature, Chemistry, to help it reduce so-called “swipe fatigue,” a growing problem among online dating users who are feeling burned out and are in search of better outcomes.\n\nIntroduced last quarter, the Match-owned dating app said that Chemistry leverages AI to get to know users through questions and, with permission, accesses their Camera Roll on their phone to learn more about their interests and personality.\n\nOn Match’s Q4 2026 earnings call, one analyst from Morgan Stanley asked for an update on the product’s success so far.\n\nMatch CEO Spencer Rascoff noted that Chemistry was still only being tested in Australia for the time being, but said that the feature offered users an “AI way to interact with Tinder.” He explained that users could choose to answer questions to then “get just a single drop or two, rather than swiping through many, many profiles.”\n\nIn addition to Chemistry’s Q&A and Camera Roll features, the company plans to use the AI feature in other ways going forward, the CEO also hinted.\n\nMost importantly, Rascoff said the feature is designed to combat swipe fatigue — a complaint from users who say they have to swipe through too many profiles to find a potential match.\n\nThe company’s turn toward AI comes as Tinder and other dating apps have been experiencing paying subscriber declines, user burnout, and declines in new sign-ups.\n\nIn the fourth quarter, new registrations on Tinder were still down 5% year-over-year, and its monthly active users were down 9%. These numbers show some slight improvements over prior quarters, which Match attributes to AI-driven recommendations that change the order of profiles shown to women, and other product experiments.\n\nMatch said that this year, it aims to address common Gen Z pain points, including better relevance, authenticity, and trust. To do so, the company said it is redesigning discovery to make it less repetitive and is using other features, likeFace Check— a facial recogni",
      "excerpt": "Tinder is turning to a new AI-powered feature, Chemistry, to help it reduce so-called “swipe fatigue,” a growing problem among online dating users who are feeling burned out and are in search of better outcomes.\n\nIntroduced last quarter, the Match-owned dating app said that Chemistry leverages AI to",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "ElevenLabs raises $500M from Sequoia at an $11 billion valuation",
      "link": "https://techcrunch.com/2026/02/04/elevenlabs-raises-500m-from-sequioia-at-a-11-billion-valuation/",
      "author": "Ivan Mehta",
      "date": "2026-02-04T07:33:58-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/01/ElevenLabs-feat.jpg?resize=1200,669",
      "category": "Venture",
      "content": "Voice AI company ElevenLabs said today it raised $500 million in a new funding round led by Sequoia Capital, which was an investor inthe startup’s last secondary round through a tender. Sequoia partner Andrew Reed is joining the company’s board.\n\nThe startup is now valued at $11 billion, more than three times its valuation inits last round in January 2025. Earlier in the year, theFinancial Timesreported that the startup was looking to raise at that valuation.\n\nThe company said that existing investor a16z quadrupled its investment amount, and Iconiq, which led the last round, tripled it. Some prior investors, like BroadLight, NFDG, Valor Capital, AMP Coalition, and Smash Capital, also joined the round. New investors for the funding included Lightspeed Venture Partners, EvanticCapital, and Bond.\n\nElevenLabs said that it will disclose some investors later in February, which might be strategic partners. The company has raised over $781 million to date. It said that it will use the funding for research and product development, along with expansion in international markets like India, Japan, Singapore, Brazil, and Mexico.\n\nThe company’s co-founder, Mati Staniszewski, indicated that ElevenLabs might work on agents beyond voice and incorporate video. In January, the company announceda partnership with LTX to produce audio-to-video content.\n\n“The intersection of models and products is critical – and our team has proven, time and again, how to translate research into real-world experiences. This funding helps us go beyond voice alone to transform how we interact with technology altogether. We plan to expand our Creative offering – helping creators combine our best-in-class audio with video and Agents – enabling businesses to build agents that can talk, type, and take action,” he said in a statement.\n\nThe company has seen good growth momentum as it closed the year at $330 million ARR. In an interview withBloombergearlier this year, Staniszewski said that it took ElevenLabs fiv",
      "excerpt": "Voice AI company ElevenLabs said today it raised $500 million in a new funding round led by Sequoia Capital, which was an investor inthe startup’s last secondary round through a tender. Sequoia partner Andrew Reed is joining the company’s board.\n\nThe startup is now valued at $11 billion, more than t",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Mundi Ventures closes on €750M for Kembara, its largest deep tech and climate fund",
      "link": "https://techcrunch.com/2026/02/04/mundi-ventures-closes-on-e750m-for-kembara-its-largest-deep-tech-and-climate-fund/",
      "author": "Anna Heim",
      "date": "2026-02-04T16:01:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/KEMBARA.jpg?resize=1200,903",
      "category": "Venture",
      "content": "Europe invests billions into early-stage climate startups, only to watch too many fail at Series B, according to arecent report. But new funds are being raised to fill this gap, and Spain-based Mundi Ventures’ latest fund, Kembara Fund I, is one of them.\n\nAfter securing a€350 million commitmentfrom the European Investment Fund under theEuropean Tech Champions Initiativein 2024, Mundi Ventures has just completed a €750 million first close forKembara, its fifth fund and largest to date.\n\nRegulatory filing from Spainreveals that the fund — focused on deep tech — could even stretch its final closing to €1.25 billion. But according to Kembara co-founder and general partner Yann de Vries, getting to €750 million in two years as a first fund in this environment “was not easy.”\n\nKembara is managed by a specialist team within Mundi Ventures, with offices in Madrid, London, Barcelona, and Paris. Mundi Ventures founder Javier Santiso is now also a co-founder and GP of the Kembara fund, which has now disclosed the full list of its senior partners.\n\nAlongside de Vries and Santiso, climate tech VC Robert Trezona and deep tech VC Pierre Festal have also joined as general partners, as well as former Atomico partner Siraj Khaliq as senior strategic advisor.(Pictured from left to right: Javier Santiso, Siraj Khaliq, Robert Trezona, Yann de Vries and Pierre Festal.)\n\nTheir individual track records helped them raise funds from institutional backers waking up to the need for European growth capital that can turn itsmany university spinoutsinto sizable businesses with industrial synergies. But it also gave them a front-row seat into the broader growing pains of European climate and deep tech startups — especially de Vries.\n\nA seasoned venture capitalist who founded Redpoint eVentures Brazil and later became a partner at Atomico, de Vries had moved to the other side of the table tojoin German electric aircraft startup Lilium— only for the company tocease operationsin 2024 after raising mo",
      "excerpt": "Europe invests billions into early-stage climate startups, only to watch too many fail at Series B, according to arecent report. But new funds are being raised to fill this gap, and Spain-based Mundi Ventures’ latest fund, Kembara Fund I, is one of them.\n\nAfter securing a€350 million commitmentfrom ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Stripe alumni raise €30M Series A for Duna, backed by Stripe and Adyen execs",
      "link": "https://techcrunch.com/2026/02/04/stripe-alumni-raise-e30m-series-a-for-duna-backed-by-stripe-and-adyen-execs/",
      "author": "Anna Heim",
      "date": "2026-02-04T15:49:18-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Duna-founders-David-Schreiber-and-Duco-Van-Lanschot.jpg?resize=1200,857",
      "category": "Fintech",
      "content": "Anthropic and OpenAI may berivals, but their presidents Daniela Amodei and Gregory Brockman have one thing in common: they are both Stripe alumni. With former employees who went on to create dozens of startups, the fintech company has become one of the most prolific “founder factories” — and the money is following. The latest example: business identity verification startup Duna, which just raised a €30 million Series A to become the best-funded European member of the so-called “Stripe mafia.” The funding round was led by Alphabet’s growth fundCapitalG, which has also backed Stripe sinceco-leading its Series Din 2016.\n\nBased in Germany and the Netherlands, Duna was co-founded by Stripe alumni Duco van Lanschot and David Schreiber. With customers includingPlaid, the startup helps fintech companies onboard business customers more efficiently, reducing the typical churn associated with corporate ID checks and other fraud prevention measures.\n\nStripe is not a customer of Duna, van Lanschot said, but its executives were well placed to understand the opportunity that the startup is seizing, which is reflected in its cap table. The company’s angel investors include former Stripe executives David Singleton (CTO), Claire Hughes Johnson (COO) and Michael Cocoman (Global Chief Compliance Officer). Even Stripe rival Adyen got involved, with CRCO Mariëtte Swart and CFO Ethan Tandowsky joining as angels.\n\nTheir endorsements also validate van Lanschot’s hunch that these companies won’t compete with Duna, even though they could. “It requires such fine-grained controls that change on a company-by-company basis, that an Adyen or a Stripe isn’t going to spin out their business onboarding as a separate product where another enterprise customer can change all of the configurations,” he told TechCrunch.\n\nIf it’s still worth the effort for Duna, it’s because the startup is going after the long tail of enterprise clients that don’t have huge resources to dedicate to business onboarding. But",
      "excerpt": "Anthropic and OpenAI may berivals, but their presidents Daniela Amodei and Gregory Brockman have one thing in common: they are both Stripe alumni. With former employees who went on to create dozens of startups, the fintech company has become one of the most prolific “founder factories” — and the mon",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}