{
  "last_updated": "2026-02-03T11:36:49.456602+00:00",
  "articles": [
    {
      "title": "Elon Musk’s SpaceX officially acquires Elon Musk’s xAI, with plan to build data centers in space",
      "link": "https://techcrunch.com/2026/02/02/elon-musk-spacex-acquires-xai-data-centers-space-merger/",
      "author": "Sean O'Kane",
      "date": "2026-02-02T14:21:57-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/10/OLM_Full_Pressure_Water_Deluge_Test_202307280728232180_1_8ac578ec57.jpeg?resize=1200,675",
      "category": "Space",
      "content": "SpaceX has acquired Elon Musk’s artificial intelligence startup, xAI, creating the world’s most valuable private company, the spaceflight company announced Monday. Musk, who is also the CEO of SpaceX, wrote in amemoposted to the rocket company’s website that the merger is largely about creating space-based data centers — an idea he has become fixated on over the last few months. “Current advances in AI are dependent on large terrestrial data centers, which require immense amounts of power and cooling. Global electricity demand for AI simply cannot be met with terrestrial solutions, even in the near term, without imposing hardship on communities and the environment,” he wrote. (xAI has been accused ofimposing some of that hardshipon the communities near its data centers in Memphis, Tennessee.) The tie-up values the combined company at $1.25 trillion, according to Bloomberg News, which was first toreport the completed deal. SpaceX has beenreportedlypreparing an IPO for as early as June of this year. It’s unclear whether the merger will affect that timeline. Musk did not address the IPO in his public memo. The merger brings together two of Musk’s companies, each with its own financial challenges. xAI is currently burning around $1 billion per month, according to Bloomberg. SpaceX, meanwhile, generates as much as 80% of its revenue from launching its own Starlink satellites,according to Reuters. Last year,xAI acquired X, the social media company also owned by Musk, with Musk claiming a combined company valuation of $113 billion. Musk wrote in his memo that it will take a constant stream of many — although he did not specify how many — satellites to create these space-based data centers, ensuring that SpaceX will have an even-larger constant stream of revenue for the foreseeable future. (That revenue loop likely looks even more attractive when you consider that satellites are required to be de-orbited every five years by the Federal Communications Commission.) While spac",
      "excerpt": "SpaceX has acquired Elon Musk’s artificial intelligence startup, xAI, creating the world’s most valuable private company, the spaceflight company announced Monday. Musk, who is also the CEO of SpaceX, wrote in amemoposted to the rocket company’s website that the merger is largely about creating spac",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Fintech CEO and Forbes 30 Under 30 alum has been charged for alleged fraud",
      "link": "https://techcrunch.com/2026/02/02/fintech-ceo-and-forbes-30-under-30-alum-has-been-charged-for-alleged-fraud/",
      "author": "Lucas Ropek",
      "date": "2026-02-02T16:16:14-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2019/10/GettyImages-1131974626.jpg?resize=1200,800",
      "category": "Fintech",
      "content": "By now, theForbes 30 Under 30 listhas become more than a little notorious for the amount of entrants who go on to be charged with fraud. Notable alumni includeFTX founder Sam Bankman-Fried, Frank CEO Charlie Javice,Joanna Smith-Griffin, founder of the AI startup AllHere Education, and “pharma bro” Martin Shkreli, among others. Now, another member of the list has been hit with federal charges. Gökçe Güven, a 26-year-old Turkish national and the founder and CEO of fintech startupKalder, wascharged last weekwith alleged securities fraud, wire fraud, visa fraud, and aggravated identity theft. The New York-based fintech startup — which uses the “Turn Your Rewards into [a] Revenue Engine” tagline — says it can help companies create and monetize individual rewards programs. The company was founded in 2022, and offers participating firms the opportunity to earn ongoing revenue streams via partner affiliate sales, Axiospreviously reported. Güven was featured in last year’s Forbes 30 Under 30 list. The magazinenotes in the writeup thatGüven’s clients included major chocolatier Godiva and the International Air Transport Association, the trade organization that represents a majority of the world’s airlines. Kalder also claims to have enjoyed the backing ofa number of prominent VC firms. The U.S. Department of Justice alleges that, during Kalder’sseed roundin April of 2024, Güven managed to raise $7 million from more than a dozen investors after presenting a pitch deck that was rife with false information. According to the government, Kalder’s pitch deck claimed that there were 26 brands “using Kalder” and another 53 brands in “live freemium.” However, officials say that, in reality, Kalder had, in many cases, only been offering heavily discounted pilot programs to many of those companies. Other brands “had no agreement with Kalder whatsoever—not even for free services,” officials said in a press release announcing the indictment. The pitch deck also “falsely reported that Kalde",
      "excerpt": "By now, theForbes 30 Under 30 listhas become more than a little notorious for the amount of entrants who go on to be charged with fraud. Notable alumni includeFTX founder Sam Bankman-Fried, Frank CEO Charlie Javice,Joanna Smith-Griffin, founder of the AI startup AllHere Education, and “pharma bro” M",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "China is leading the fight against hidden car door handles",
      "link": "https://techcrunch.com/2026/02/02/china-is-leading-the-fight-against-hidden-car-door-handles/",
      "author": "Kirsten Korosec",
      "date": "2026-02-02T13:55:38-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/tesla-door-Getty.jpg?resize=1200,900",
      "category": "Transportation",
      "content": "One of the design features that became synonymous with Tesla has been banned in China. Under new safety rulespublished Mondayby China’s Ministry of Industry and Information Technology, cars sold in the country must have mechanical releases on their door handles. The new rules, which go in effect January 1, 2027, will prohibit the hidden, electronically actuated door handles popularized by Tesla — and now found on numerous other electric vehicles in China. The new rule dictates that each door (excluding the tailgate) should be equipped with a mechanically released external door handle. Vehicles must also have a mechanical release on the interior of the vehicle. Bloombergpreviously reportedon the new safety policy. Numerous high-profile fatal incidents, in which occupants have become trapped in their vehicles, have raised concerns among safety regulators and advocates globally. China is the first country to issue a ban. Aninvestigation by Bloomberglast September uncovered problems with the concealed door handles on Tesla vehicles, citing several crashes in which first responders or occupants were unable to open the doors because the electronic door locks weren’t getting enough power from the vehicle’s battery system to work properly. The U.S. National Highway Traffic Safety Administration then opened adefect investigationinto certain Tesla Model Y andModel 3door handles. While Tesla does have manual releases inside its vehicles, federal investigators noted that the releases can be hard for children to access, and many owners are unaware of their existence. Some U.S. lawmakers haveproposed regulationrequiring manual door releases in all new vehicles. Fatal incidents in China, including a crash involving a Xiaomi SU7 electric sedan, prompted regulators there to propose changes to EV door handles last year. The Chinese government began the process in May 2025 with more than 40 domestic vehicle manufacturers, parts suppliers, and testing institutions participating in the ",
      "excerpt": "One of the design features that became synonymous with Tesla has been banned in China. Under new safety rulespublished Mondayby China’s Ministry of Industry and Information Technology, cars sold in the country must have mechanical releases on their door handles. The new rules, which go in effect Jan",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "What Snowflake’s deal with OpenAI tells us about the enterprise AI race",
      "link": "https://techcrunch.com/2026/02/02/what-snowflakes-deal-with-openai-tells-us-about-the-enterprise-ai-race/",
      "author": "Rebecca Szkutak",
      "date": "2026-02-02T11:09:44-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/06/GettyImages-2215876044.jpg?w=1024",
      "category": "Enterprise",
      "content": "Cloud data company Snowflake entered into a$200 million multi-year AI dealwith OpenAI on Monday, the latest signal that enterprise AI competition continues to heat up. Under the deal, Snowflake’s 12,600 customers will have access to OpenAI models across all three major cloud providers. Snowflake employees have access to OpenAI’s ChatGPT Enterprise as well. The two companies are also partnering to build new AI agents and other AI products. “By bringing OpenAI models to enterprise data, Snowflake enables organizations to build and deploy AI on top of their most valuable asset using the secure, governed platform they already trust,” Snowflake CEO Sridhar Ramaswamy said in a press release. “Customers can now harness all their enterprise knowledge in Snowflake together with the world-class intelligence of OpenAI models, enabling them to build AI agents that are powerful, responsible, and trustworthy. Together, we’re setting a new standard for AI innovation, helping businesses transform with confidence, while maintaining strong security and compliance standards.” OpenAI declined to share information on the deal beyond the press release. If this deal feels familiar, it should. Snowflake announced a$200 million enterprise deal with AI research lab Anthropicat the beginning of December. At the time, Ramaswamy was quoted making very similar comments about how the partnership with Anthropic would give its customers access to powerful AI models on top of their existing data. “Our partnership with OpenAI is a multi-year commercial commitment focused on reliability, performance, and real customer usage. At the same time, we remain intentionally model-agnostic. Enterprises need choice, and we do not believe in locking customers into a single provider,” Baris Gultekin, vice president of AI at Snowflake, told TechCrunch over email. “OpenAI is an important partner, and it is one of several frontier model providers available on Snowflake today, alongside Anthropic, Google, Meta, and o",
      "excerpt": "Cloud data company Snowflake entered into a$200 million multi-year AI dealwith OpenAI on Monday, the latest signal that enterprise AI competition continues to heat up. Under the deal, Snowflake’s 12,600 customers will have access to OpenAI models across all three major cloud providers. Snowflake emp",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Adobe Animate is shutting down as company focuses on AI",
      "link": "https://techcrunch.com/2026/02/02/adobe-animate-is-shutting-down-as-company-focuses-on-ai/",
      "author": "Sarah Perez",
      "date": "2026-02-02T13:15:03-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2019/07/GettyImages-95799630.jpg?resize=1200,800",
      "category": "Apps",
      "content": "As AdoberampsupitsinvestmentsinAI, the company has decided to shut down its 2D animation software,Adobe Animate. On Monday, Adobe issued anupdateto the company’s support site and sent emails to existing customers announcing Adobe Animate will be discontinued on March 1, 2026. Enterprise customers can continue to receive technical support through March 1, 2029, to ease the transition. Other customers will have support through March of next year, the company said. The decision has beenmetwithincredulity, disappointment, and anger among Adobe Animate users, who are concerned about the lack of alternatives that mirror Animate’s functionality. One customer,posting on X, pleaded with Adobe to at least open source the software rather than abandon it. Commenters on the thread responded with angst, saying thingslike“this is legit gonna ruin my life,”and“literally what the hell are they doing? animate is the reason a good chunk of adobe users even subscribe in the first place. Adobe explained its decision to discontinue the program in anFAQ, saying, “Animate has been a product that has existed for over 25 years and has served its purpose well for creating, nurturing, and developing the animation ecosystem. As technologies evolve, new platforms and paradigms emerge that better serve the needs of the users. Acknowledging this change, we are planning to discontinue supporting Animate.” Hey@Adobeopen source this instead of ending itpic.twitter.com/ZZNn5cZYS4 we literally had a whole semester of adobe animate class and now they're discontinuing it 😭https://t.co/Xsn9t05qpV I’m sorry: Adobe Animate is getting WHAT and H U H???pic.twitter.com/JfVrJIBYUl Adobe Animate will be discontinued.@adobehas been legendary at destroying great products.pic.twitter.com/ABOUIJkQqS Reading between the lines, it sounds as if Adobe is saying that Animate no longer represents the current direction of the company, which is now more focused on products that incorporate AI technologies. What’s surprising",
      "excerpt": "As AdoberampsupitsinvestmentsinAI, the company has decided to shut down its 2D animation software,Adobe Animate. On Monday, Adobe issued anupdateto the company’s support site and sent emails to existing customers announcing Adobe Animate will be discontinued on March 1, 2026. Enterprise customers ca",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Notepad++ says Chinese government hackers hijacked its software updates for months",
      "link": "https://techcrunch.com/2026/02/02/notepad-says-chinese-government-hackers-hijacked-its-software-updates-for-months/",
      "author": "Zack Whittaker",
      "date": "2026-02-02T10:09:34-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-591881449.jpg?resize=1200,799",
      "category": "Security",
      "content": "The developer of the popular open source text editor Notepad++ has confirmed that hackers hijacked the software to deliver malicious updates to users over the course of several months in 2025. In ablog postpublished Monday, Notepad++ developer Don Ho said that the cyberattack was likely carried out by hackers associated with the Chinese government between June and December 2025, citing multiple analyses by security experts who examined the malware payloads and attack patterns. Ho said this “would explain the highly selective targeting” seen during the campaign. Rapid7, whichinvestigated the incident, attributed the hacking to Lotus Blossom, a long-running espionage group known to work for China, and said the hacks targeted government, telecom, aviation, critical infrastructure, and media sectors. Notepad++ is one of the longest-running open source projects, spanning more than two decades, and it counts at least tens of millions of downloads to date, including by employees at organizations around the world. According to Kevin Beaumont, a security researcher whofirst discovered the cyberattack and wrote up his findingsin December, the hackers compromised a small number of organizations “with interests in East Asia” after someone unwittingly used a tainted version of the popular software. Beaumont said that the hackers were able to gain “hands-on” access to the computers of victims who were running hijacked versions of Notepad++. Ho said that the “exact technical mechanism” of how the hackers broke into his servers remains under investigation, but provided some details as to how the attack went down. In the blog, Ho said that Notepad++’s website was hosted on a shared hosting server. The attackers “specifically targeted” Notepad++’s web domain with the goal of exploiting a bug in the software to redirect some users to a malicious server run by the hackers. This allowed the hackers to deliver malicious updates to certain users who had requested a software update, until ",
      "excerpt": "The developer of the popular open source text editor Notepad++ has confirmed that hackers hijacked the software to deliver malicious updates to users over the course of several months in 2025. In ablog postpublished Monday, Notepad++ developer Don Ho said that the cyberattack was likely carried out ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Carbon Robotics built an AI model that detects and identifies plants",
      "link": "https://techcrunch.com/2026/02/02/carbon-robotics-built-an-ai-model-that-detects-and-identifies-plants/",
      "author": "Rebecca Szkutak",
      "date": "2026-02-02T07:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/LaserWeeder-G2-Daytime-Spinach-Yuma-Aerial.jpg?resize=1200,675",
      "category": "Robotics",
      "content": "What is and isn’t a weed that needs to be eliminated in the field is determined by the eyes of the farmer — and now, increasingly, by a new AI model from Carbon Robotics. Seattle-basedCarbon Robotics, which builds the LaserWeeder — a robot fleet that uses lasers to kill weeds — announced a new AI model, the Large Plant Model (LPM), on Monday. This model recognizes plant species instantly and allows farmers to target new weeds without needing to retrain the robots. The LPM is trained on more than 150 million photos and data points collected by the company’s machines across the more than 100 farms in 15 countries where the robots currently operate. The model now powers Carbon AI, the AI system that serves as the brains inside the company’s autonomous weed-killing robots. Paul Mikesell, the founder and CEO of Carbon Robotics, told TechCrunch that prior to LPM, every time a new type of weed would show up on a farm — or even the same type of weed in different soil or with a slightly different appearance — the company would have to create new data labels to retrain its machines to recognize the plant. This process took about 24 hours each time, Mikesell said. Now, LPM can learn a new weed instantly, even if it’s never seen it before. “The farmer can live in real time and say, ‘Hey, this is a new weed. I want you to kill this,’ and that was something that had never been done before,” Mikesell said. “There’s no new labeling or retraining because the Large Plant Model understands, at a much deeper level, what it’s looking at and the type of plant.” Mikesell said that the company, which was founded in 2018, started developing this model shortly after it began shipping its first machines in 2022. Mikesell has years of experience building these types of neural networks from previous roles at Uber and working on Meta’s Oculus virtual reality headsets. This new model will reach the company’s existing systems through a software update. From there, farmers can tell the machine what",
      "excerpt": "What is and isn’t a weed that needs to be eliminated in the field is determined by the eyes of the farmer — and now, increasingly, by a new AI model from Carbon Robotics. Seattle-basedCarbon Robotics, which builds the LaserWeeder — a robot fleet that uses lasers to kill weeds — announced a new AI mo",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Ring brings its ‘Search Party’ feature for finding lost dogs to non-Ring camera owners",
      "link": "https://techcrunch.com/2026/02/02/ring-brings-its-search-party-feature-for-finding-lost-dogs-to-non-ring-camera-owners/",
      "author": "Sarah Perez",
      "date": "2026-02-02T07:33:45-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/ring-search-party-hero-lt-0129hero-1.jpg?resize=1200,675",
      "category": "Hardware",
      "content": "Ring’s AI-powered “Search Party” feature, which leverages the company’s network of cameras to find lost dogs, is nowavailable to allRing customers in the U.S. For the first time, the feature will be made available to those who don’t own a Ring camera, too. Launched last fall, Search Party uses AI to findpossible matchesfor lost dogs across neighbors’ camera footage. When a neighbor reports a lost dog in the Ring app, nearby outdoor cameras use AI to scan for possible matches. If a match is found, that camera owner receives an alert and can optionally choose to share any related video clips with their neighbor who reported the pet missing. They’ll also have an option to call the owner or send them a message, without sharing their own phone number. Ring says the feature has been reuniting more than a dog per day since its launch. Previously, Search Party was only available to customers with a Ring camera installed. The company is now making Search Party accessible to anyone through the Ring app. “Now, pet owners can mobilize the whole community—and communities are empowered to help—to find lost pets more effectively than ever before,” noted Ring founder Jamie Siminoff, in anannouncement. “That’s why we believe it’s so important to make this feature available to anyone who shares a lost dog post in Neighbors,” he added, referring to the company’s Neighbors app for Ring customers. Alongside the launch and expansion, Amazon-owned Ring said it’s committing $1 million to equip animal shelters with Ring camera systems, and aims to aid 4,000 U.S. shelters. By adding the shelters to Ring’s network, the company hopes more lost dogs will be reunited with their owners. The company already works with other nonprofits, including Petco Love and Best Friends Animal Society, and is open to other partnerships.",
      "excerpt": "Ring’s AI-powered “Search Party” feature, which leverages the company’s network of cameras to find lost dogs, is nowavailable to allRing customers in the U.S. For the first time, the feature will be made available to those who don’t own a Ring camera, too. Launched last fall, Search Party uses AI to",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Avalanche thinks the fusion power industry should think smaller",
      "link": "https://techcrunch.com/2026/02/03/avalanche-thinks-the-fusion-power-industry-should-think-smaller/",
      "author": "Tim De Chant",
      "date": "2026-02-03T03:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/avalanche-energy-plasma-core.jpg?resize=1200,798",
      "category": "Climate",
      "content": "Nuclear fusion conjures images of massive reactors or banks of dozens of large lasers. Avalanche co-founder and CEO Robin Langtry thinks smaller is better. For the last several years, Langtry and his colleagues atAvalanchehave been working on what’s essentially a desktop version of nuclear fusion. “We’re using the small size to learn quickly and iterate quickly,” Langtry told TechCrunch. Fusion power promises to supply the world with large amounts of clean heat and electricity, if researchers and engineers can solve some vexing challenges. At its core, fusion power seeks to harness the power of the Sun. To do that, fusion startups must figure out how to heat and compress plasma for long enough that atoms inside the mix fuse, releasing energy in the process. Fusion is a famously unforgiving industry. The physics is challenging, the materials science is cutting edge, and the power requirements can be gargantuan. Parts need to be machined with precision, and the scale is usually so large as to obviate rapid fire experimentation. Some companies like Commonwealth Fusion Systems (CFS) are using large magnets to contain the plasma in a doughnut-like tokamak, others are compressing fuel pellets by shooting them with powerful lasers. Avalanche, though, uses electric current at extremely high voltages to draw plasma particles into an orbit around an electrode. (It also uses some magnets to keep things orderly, though they’re not nearly as powerful as a tokamak’s.) As the orbit tightens and the plasmas speed up, the particles begin to smash into each other and fuse. The approach has won over some investors. Avalanche recently added another $29 million in an investment round led by R.A. Capital Management with participation from 8090 Ventures, Congruent Ventures, Founders Fund, Lowercarbon Capital, Overlay Capital, and Toyota Ventures. To date, the company has raised $80 million from investors, arelatively small amount in the fusion world. Other companies have raised several hu",
      "excerpt": "Nuclear fusion conjures images of massive reactors or banks of dozens of large lasers. Avalanche co-founder and CEO Robin Langtry thinks smaller is better. For the last several years, Langtry and his colleagues atAvalanchehave been working on what’s essentially a desktop version of nuclear fusion. “",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Waymo raises $16B to scale robotaxi fleet internationally",
      "link": "https://techcrunch.com/2026/02/02/waymo-raises-16-billion-round-to-scale-robotaxi-fleet-london-tokyo/",
      "author": "Kirsten Korosec",
      "date": "2026-02-02T15:04:33-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/Waymo-parking-charging-getty.jpg?resize=1200,800",
      "category": "Transportation",
      "content": "Waymo, the Alphabet-owned autonomous vehicle company, has raised $16 billion as it plans to grow its fleet of driverless taxicabs this year to more than a dozen new cities internationally, including London and Tokyo. Dragoneer Investment Group, DST Global, and Sequoia Capital led the funding round, which now values Waymo at $126 billion, the companysaid in a blog postMonday. Parent company Alphabet supported the round and maintained its position as majority investor. The round also included significant investments from Andreessen Horowitz and Mubadala Capital, as well as Bessemer Venture Partners, Silver Lake, Tiger Global, and T. Rowe Price. Additional investors included BDT & MSD Partners, CapitalG, Fidelity Management & Research Company, GV, Kleiner Perkins, Perry Creek Capital, and Temasek. Waymo said the funds will be used to fuel its growth, which has accelerated over the past year and doesn’t appear to be slowing. The companyrecently secured ridesto and from San Francisco International Airport and has expanded its robotaxi service throughout Northern California and several major metropolitan areas in the U.S., including Los Angeles, Austin, and Miami. For years, the former Google self-driving project slowly progressed forward, testing its autonomous vehicle tech on public roads in Silicon Valley and the Bay Area and providing the occasional public or media demo. In 2016, it made its first geographic leap forward and began testing in Phoenix, where it eventually pulled itshuman safety driverout of the vehicles. Phoenix became Waymo’s first robotaxi market, in which the public could hail driverless Chrysler Pacifica minivans. Waymo pushed down the accelerator in August 2023 after receiving the final necessary permit to operate a robotaxi service — and charge for rides — in California. It launched a limited service in San Francisco, later expanding to much of the greater Bay Area, Silicon Valley, and more recently to the freeways that connect the dozens of towns",
      "excerpt": "Waymo, the Alphabet-owned autonomous vehicle company, has raised $16 billion as it plans to grow its fleet of driverless taxicabs this year to more than a dozen new cities internationally, including London and Tokyo. Dragoneer Investment Group, DST Global, and Sequoia Capital led the funding round, ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}