{
  "last_updated": "2026-02-20T21:28:48.686952+00:00",
  "articles": [
    {
      "title": "Great news for xAI: Grok is now pretty good at answering questions about Baldur’s Gate",
      "link": "https://techcrunch.com/2026/02/20/great-news-for-xai-grok-is-now-pretty-good-at-answering-questions-about-baldurs-gate/",
      "author": "Russell Brandom",
      "date": "2026-02-20T10:26:54-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-2087343879.jpg?w=1024",
      "category": "AI",
      "content": "Different AI labs have different priorities. OpenAI has traditionally focused on consumer users, for instance, while its rival Anthropic tends to target enterprises. Elon Musk’s xAI, we discovered recently, has been placing particular emphasis on video-game walkthroughs.\n\nOn Friday, Business Insider’s Grace Kay publisheda detailed and far-reaching report about xAI, the AI startup recentlyacquired by SpaceX, with particular emphasis on how Musk is making life difficult for employees. But this particular anecdote stood out:\n\nIn one instance last year, a model release was delayed for several days because Musk was dissatisfied with how the chatbot answered detailed questions about the video game “Baldur’s Gate,” according to people familiar with the matter. High-level engineers were pulled from other projects to improve the responses before launch, they said.\n\nOf course, you can imagine the frustration of any respected and experienced engineer who shows up to work thinking he’ll be tackling fundamental problems of knowledge and machine intelligence, only to be sidetracked into helping a 54-year-old man beat his video game. But the anecdote raises an even more pressing question: Did Musk end up getting the gaming skills he wanted?\n\nTo answer that question, our resident RPG enthusiast Ram Iyer put together a set of five general questions about Baldur’s Gate, which we ran against xAI and the three major models in a kind of quasi-benchmark that I’ve decided to call “BaldurBench.”\n\nIn the interest of journalistic transparency, I’ve made all the chat transcripts public, so you can see them here:Grok,ChatGPT,Claude, andGemini.\n\nFirst, the good news: Grok actually gives pretty good information. Its responses were a bit dense with gamer jargon — “save-scumming” instead of saving and “DPS” instead of damage — but the answers were both useful and well-informed, provided you knew what it was talking about. Grok also really loves tables andtheorycraft, which is about what you would expect.\n\nThere are lots of Baldur’s Gate guides out there and the models were generally drawing from the same ones, so the biggest differences were stylistic. ChatGPT prefers bulleted lists and sentence fragments, while Gemini loves to bold important words.\n\nThe biggest surprise was Claude, which was particularly concerned about giving me information that would spoil my experience of the game. When I asked about good party compositions, it closed the guidance by saying, “Don’t stress too much and just play what sounds fun to you.” Thanks, Claude!\n\nIt’s important to bear in mind, this is a subject area we know (thanks toBusiness Insider’s reporting) that xAI has specifically focused on reaching parity. So we shouldn’t read too much into the fact that, after the reported sprint, Grok’s advice turned out about the same as the other models. Still, it’s nice to know xAI can make it work if it tries.\n\nLoading the player…",
      "excerpt": "Different AI labs have different priorities. OpenAI has traditionally focused on consumer users, for instance, while its rival Anthropic tends to target enterprises. Elon Musk’s xAI, we discovered recently, has been placing particular emphasis on video-game walkthroughs.\n\nOn Friday, Business Insider",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Ukrainian man jailed for identity theft that helped North Koreans get jobs at US companies",
      "link": "https://techcrunch.com/2026/02/20/ukrainian-man-jailed-for-identity-theft-that-helped-north-koreans-get-jobs-at-us-companies/",
      "author": "Zack Whittaker",
      "date": "2026-02-20T09:38:59-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/laptop-farm-upscale.jpeg?resize=1200,802",
      "category": "Security",
      "content": "A U.S. federal court has sentenced a Ukrainian man to five years in prison for his part in a long-running identity theft operation that helped overseas North Korean workers gain fraudulent employment at dozens of U.S. companies.\n\nU.S. prosecutorsbrought charges in 2024against Oleksandr Didenko, 29, a resident of Kyiv, for setting up North Koreans with stolen identities of U.S. citizens to get hired and earn a wage. Under this scheme, the workers’ earnings were funneled back to Pyongyang, which the regime used to fund its internationally sanctioned nuclear weapons program.\n\nThis is thelatest in a string of recent convictionsof individuals involved in facilitating ongoing North Koreanso-called “IT worker” schemes. Security researchers have described North Korean workers as a “triple threat” to U.S. and Western businesses, as they violate U.S. sanctions, all the while enabling North Koreans to steal sensitive company data, and then later extort those victim companies into not publicly releasing corporate secrets.\n\nProsecutors said Didenko ran a website called Upworksell, which allowed people working overseas, including North Koreans, to buy or rent stolen identities for gaining employment with U.S. firms. Didenko handled more than 870 stolen identities, per the Justice Department.\n\nThe FBI seized Upworksell in 2024 and diverted its traffic to its own servers. Polish authorities arrested Didenko, who was then extradited to the U.S. and later pleaded guilty.\n\nIna statement this week, the U.S. Department of Justice said Didenko also paid people to receive and host computers at their homes in California, Tennessee, and Virginia. These “laptop farms” are rooms containing racks of open laptops, allowing North Koreans to remotely perform their work as if they were physically in the United States.\n\nSecurity giant CrowdStrike saidlast yearthat it has seen a sharp rise in the number of North Korean workers infiltrating companies, often as remote developers or other technical software engineering jobs. The scheme is among many that the North Korean regime uses to enrich itself, while unable to use the global financial system, thanks to international sanctions.\n\nNorth Koreans are also known toimpersonate recruiters and VCsin efforts to trick unsuspecting high-profile and high-net-worth victims into granting access to their computers, including crypto.",
      "excerpt": "A U.S. federal court has sentenced a Ukrainian man to five years in prison for his part in a long-running identity theft operation that helped overseas North Korean workers gain fraudulent employment at dozens of U.S. companies.\n\nU.S. prosecutorsbrought charges in 2024against Oleksandr Didenko, 29, ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Lucid Motors slashes 12% of its workforce as it seeks profitability",
      "link": "https://techcrunch.com/2026/02/20/lucid-motors-slashes-12-of-its-workforce-as-it-seeks-profitability/",
      "author": "Sean O'Kane",
      "date": "2026-02-20T07:51:18-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/04/LM250408_GPD-2.jpg?resize=1200,675",
      "category": "Transportation",
      "content": "Lucid Motors is laying off 12% of its workforce in a bid to “improve operational effectiveness and optimize our resources as we continue on our path toward profitability,” according to an internal memo that was obtained by TechCrunch.\n\nHourly workers on the manufacturing, logistics, and quality teams are not affected by the cuts, according to the memo, which was sent to employees being spared by the layoffs. It’s unclear exactly how many workers are being laid off, but it is likely in the hundreds. Lucid Motors reported having 6,800 full-time employees globallyat the end of 2024.\n\n“Saying goodbye to colleagues is never easy,” interim CEO Marc Winterhoff wrote in the memo. “We are grateful for the contributions of those impacted by today’s actions, and we are providing severance, bonus, continued health benefits, and transition support to help them through this period.” The company did not immediately respond to a request for comment.\n\nThe cuts come as the company is in the middle of ramping up production and deliveries of its Gravity SUV. While Lucid Motors struggled with Gravity production and quality issues during the first few months, the company has been able to pick up the pace, and ultimatelydoubled its 2024 outputlast year.\n\nThe company is also preparing to launch a more affordable mid-size EV later this year that is expected to cost around $50,000. It’s collaborating with Uber and autonomous vehicle company Nuro on launching a robotaxi service in the San Francisco area this year, too. The company is scheduled to release its financial results for 2025 next week.\n\n“Importantly, today’s actions do not affect our strategy,” Winterhoff wrote in the memo. “Our core priorities remain unchanged, and we continue to focus on the start of production of our Midsize platform. With disciplined execution, we are also focused on further expansion into the robotaxi market, continued ADAS and software development, and growth in sales of Lucid Gravity and Air across existing and new geographies.”\n\nLucid Motors has now gone almost a full year without a permanent CEO. Peter Rawlinson, who was the company’s chief executive and chief technical officer,abruptly resignedon February 25, 2025. Since then, Lucid Motors has seen asignificant amount of turnover in its executive ranks, including the loss of its chief engineer, whosued the companyin December for wrongful termination and discrimination. (Lucid Motors has called his legal claims “absurd.”)",
      "excerpt": "Lucid Motors is laying off 12% of its workforce in a bid to “improve operational effectiveness and optimize our resources as we continue on our path toward profitability,” according to an internal memo that was obtained by TechCrunch.\n\nHourly workers on the manufacturing, logistics, and quality team",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Why investors are going gaga over solid-state transformers",
      "link": "https://techcrunch.com/2026/02/20/why-investors-are-going-gaga-over-solid-state-transformers/",
      "author": "Tim De Chant",
      "date": "2026-02-20T06:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2020/07/GettyImages-1148091793.jpg?resize=1200,675",
      "category": "Climate",
      "content": "It’s no secret that the electrical grid is aging, but one part stands out from the rest. Transformers haven’t changed much since Thomas Edison made his first light bulb.\n\nNow, a string of startups are working to modernize the transformer, replacing it with modern power electronics that promise to give grid operators more control over how and where electricity flows.\n\n“It becomes a very powerful device, equivalent to your internet router,” Subhashish Bhattacharya, co-founder and CTO ofDG Matrix, told TechCrunch.\n\nThree startups recently raised sizable rounds to scale up production of their solid-state transformer technologies. This week, DG Matrix raised a$60 million Series Aand Heron Power raised$140 million in a Series Bround. In November, Amperesand raised $80 million tochase afterthe burgeoning data center market.\n\nExisting transformers are reliable and efficient, but that’s about it. They’re relatively crude instruments, made largely of copper and iron. They react passively to changes on the grid and are capable of tackling only one task per device.\n\n“An old-school steel, copper, and oil transformer doesn’t have any monitoring, doesn’t have any control,” Drew Baglino, founder and CEO ofHeron Power, told TechCrunch. In instances where electricity surges or a power plant trips offline, that can be a liability.\n\nThe devices can incorporate power from a range of difference sources — including traditional power plants, renewables, and batteries — and transform that electricity into either alternating current (AC) or direct current (DC) at a number of different voltages, allowing them to replace several devices.\n\nFor data centers, solid-state transformers offer an appealing alternative, allowing them to shrink the footprint of their power systems while giving them finer control over where and how electricity is directed.\n\nSolid-state transformers are poised to arrive at a time when existing transformers are aging and demand for new ones is surging — a classic tech supercycle. Most transformers on the grid today are several decades old,accordingto the National Laboratory of the Rockies (NLR; formerly the National Renewable Energy Laboratory). As demand from data centers, EV chargers, and other parts of the grid rises, the NLR expects the amount of power flowing through transformers to double by 2050.\n\nWhile data centers are the the first market those companies are chasing, they also have their sights set on the electrical grid, which in the U.S. alone hostsas many as 80 million transformers.\n\n“All of the distribution transformers are ultimately going to need to be replaced. Over 50% of them are 35 years old. There’s a big need for an upgrade,” Baglino said.\n\nBecause they’re made from silicon-based materials, they’re flexible, controllable, and software-updatable. They’re also immune from price fluctuations that rock the copper market.\n\n“Power semiconductors keep getting cheaper. Steel, copper, and oil, unfortunately, is not in that situation,” Baglino said. “Commodity prices can move all over the place, and they generally move up.”\n\nIn an old-style transformer, power flows into the transformer through copper wires wound around one side of an O-shaped iron core. As the electricity flows, it induces a magnetic field in the core. On the other side of the core, the magnetic field induces electricity in another set of copper windings. If the wires wrap around the core more times on the input side than the output side, the voltage decreases on the output side. If the ratio inverts, the output voltage increases.\n\nSolid-state transformers eschew the copper windings in favor of semiconductors, using materials like silicon carbide or gallium nitride to handle frequency conversion. They can come in a range of configurations, with the most comprehensive setup consisting of three basic parts: a rectifier that converts alternating current to direct current, a converter that changes the voltage of the direct current, and an inverter that changes the direct current back into alternating current.\n\nUnlike iron-core transformers, solid-state transformers can handle power that flows in both directions, making them useful in places that need backup power, like data centers.\n\nIn a data center, a solid-state transformer can replace several different pieces of equipment, not just the transformer that steps voltage down from the grid. Every data center uses backup power, which requires a string of devices to bring power into the facility. Solid-state transformers can handle all of those duties in one box.\n\nThe technology also allows data centers to more easily integrate so-called behind-the-meter power, where generating capacity is connected directly to the data center, not the grid. Those typically require another set of transformers.\n\nAnd when coupled with grid-scale batteries, solid-state transformers can eliminate uninterruptible power supplies (UPS), too, freeing up space inside the data center for more racks.\n\n“If you add up the cost of everything we’ve taken out, we’re 60% to 70% of that cost,” Haroon Inam, co-founder and CEO of DG Matrix, told TechCrunch.\n\nDG Matrix has been focusing on its Interport technology, which can route power from multiple sources to multiple loads of differing voltages, a setup the company holds multiple patents on.\n\nHeron Power, meanwhile, is working on transforming medium-voltage power in data centers, solar farms, and grid-scale battery installations. In a data center, its Heron Link transformers can provide racks with 30 seconds of power while backup sources come online. Altogether, Heron Link occupy 70% less space than existing parts. At a solar farm, Heron Power’s transformers can perform the duties of an inverter and a transformer for the same price.\n\nIn a head-to-head comparison, solid state transformers still command a cost premium over iron-core transformers. For that reason, they’re unlikely to replace the giant humming boxes at grid substations in the very near future.\n\nBut in data centers and at EV charging hubs, where solid-state transformers take the place of several pieces of equipment, they’ll start making inroads.\n\nWhen they finally hit the grid in bigger numbers, they have the potential to cut down on transmission and distribution costs, one of the biggest contributors to utility bill inflation.\n\nBecause today’s transformers are passive, unable to react to fluctuations, distribution networks have been built with a significant amount of spare capacity, Baglino said. Solid-state transformers, though, can respond to changing conditions, allowing grid operators to send more power through the same lines.\n\n“You can actually make the infrastructure more affordable because you’re putting more kilowatt-hours through the same poles and wires,” he said. “That’s where intelligence, in place of passive mechanical objects that were designed 100 years ago, can make a big difference.”",
      "excerpt": "It’s no secret that the electrical grid is aging, but one part stands out from the rest. Transformers haven’t changed much since Thomas Edison made his first light bulb.\n\nNow, a string of startups are working to modernize the transformer, replacing it with modern power electronics that promise to gi",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Meta’s metaverse leaves virtual reality",
      "link": "https://techcrunch.com/2026/02/20/meta-metaverse-leaves-vr-horizon-worlds-mobile/",
      "author": "Aisha Malik",
      "date": "2026-02-20T08:00:53-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2021/12/horizonworlds-copy.jpg?resize=1200,675",
      "category": "Apps",
      "content": "Metaannounceda major update for its immersive virtual world, Horizon Worlds, on Thursday that will see it leave the metaverse behind. The tech giant said it’s shifting focus for Horizon Worlds to be “almost exclusively mobile” and that it’s “explicitly separating” its Quest VR platform from the virtual world.\n\nMeta’s Reality Labs division for VR and smart glasses development has lostnearly $80 billionsince 2020. The update to Horizon Worlds, and other recent moves, signals that Meta is significantly rethinking its VR ambitions.\n\nLast month, the company reportedly laid offroughly 1,500 employeesfrom its Reality Labs division — about 10% of the unit’s staff — andshut downseveral VR game studios. Additionally, it was reported that the VR fitness app Supernatural, whichMeta acquiredin 2023, will no longer produce new content and will move into “maintenance mode.”\n\nHorizon Worlds originally launched in 2021 as a VR platform and laterrolled outto the web and mobile. Meta said Thursday that to “truly change the game and tap into a much larger market, we’re going all-in on mobile.”\n\nBy going mobile-first, Horizon Worlds is positioning itself to compete with popular platforms like Roblox and Fortnite.\n\n“We’re in a strong position to deliver synchronous social games at scale, thanks to our unique ability to connect those games with billions of people on the world’s biggest social networks,” Samantha Ryan, Reality Labs’ VP of content, said in the blog post. “You saw this strategy start to unfold in 2025, and now, it’s our main focus.”\n\nRyan went on to note that Meta is still focused on VR hardware.\n\n“We have a robust roadmap of future VR headsets that will be tailored to different audience segments as the market grows and matures,” Ryan wrote.\n\nMeta’s metaverse ambitions have effectively been abandoned in favor of AI. After shifting its Reality Labs investmentsaway from the metaverse, Meta is now focused on developing AI wearables and advancing its ownAI models.\n\nDuring Meta’s latest earnings call last month, Meta CEO Mark Zuckerbergsaid, “It’s hard to imagine a world in several years where most glasses that people wear aren’t AI glasses.”\n\nThe exec also stated that sales of Meta’s glasses tripled within the last year, calling them “some of the fastest-growing consumer electronics in history.”",
      "excerpt": "Metaannounceda major update for its immersive virtual world, Horizon Worlds, on Thursday that will see it leave the metaverse behind. The tech giant said it’s shifting focus for Horizon Worlds to be “almost exclusively mobile” and that it’s “explicitly separating” its Quest VR platform from the virt",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "OpenAI says 18- to 24-year-olds account for nearly 50% of ChatGPT usage in India",
      "link": "https://techcrunch.com/2026/02/20/openai-says-18-to-24-year-olds-account-for-nearly-50-of-chatgpt-usage-in-india/",
      "author": "Ivan Mehta",
      "date": "2026-02-20T05:57:03-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/10/india-chatgpt.jpg?resize=1200,800",
      "category": "AI",
      "content": "OpenAI seems to have found product-market fit with young Indians. The company said on Friday that users between 18 and 24 years of age accounted for nearly 50% of messages sent to ChatGPT in the country, and users under 30 accounted for 80%.\n\nThe AI lab said Indians use ChatGPT mostly for work, with 35% of all messages relating to professional tasks, compared to 30% globally.\n\nIn particular, the company’s coding assistant, Codex, is seeing strong traction: OpenAI said Indians use Codex three times more than the global median, and weekly usage has increased by four times since the toolgot a Mac apptwo weeks ago. Users in India are also asking three times as many coding-related questions as the median.\n\nThis is in line with findings from Anthropic, which earlier this week said45.2% of Claude’s tasks map to software-related use casesin India.\n\nOpenAI said outside of work tasks, 35% of messages to ChatGPT from Indians requested guidance, 20% concerned questions about general information, and 20% were requests for the bot to produce or help with writing.\n\nIndia is OpenAI’s second-largest market with more than 100 million weekly users, and the company has been actively trying to court Indians for its AI tools and services. The company offersa sub-$5 subscription tierin the country, and last year evenran promotional campaignsto spur adoption.\n\n“AI adoption is moving faster than our ability to measure it – and that’s a challenge for anyone trying to make smart decisions. Signals is our way of putting real-world evidence on the table, so India’s AI debate can be grounded in facts, not hype,” OpenAI’s chief economist Ronnie Chatterji said in a statement.\n\nOpenAI has had a busy few days in India, which is hosting a majorAI Impact Summitin New Delhi this week. The company is opening new offices in Mumbai and Bengaluru this year, and has signed a major partnership with conglomerate Tata Group tosecure 100 megawatts’ worth of AI compute capacityand distribute ChatGPT Enterprise within Tata’s IT services subsidiary, TCS.\n\nThe AI lab has signed agreements withfintech Pine Labs, travel platforms Ixigo and MakeMyTrip, and food and grocery delivery company Eternal. It has also partnered with educational institutes to distribute its toolsto more than 100,000 students over the next six years.",
      "excerpt": "OpenAI seems to have found product-market fit with young Indians. The company said on Friday that users between 18 and 24 years of age accounted for nearly 50% of messages sent to ChatGPT in the country, and users under 30 accounted for 80%.\n\nThe AI lab said Indians use ChatGPT mostly for work, with",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Remember HQ? ‘Quiz Daddy’ Scott Rogowsky is back with TextSavvy, a daily mobile game show",
      "link": "https://techcrunch.com/2026/02/20/remember-hq-quiz-daddy-scott-rogowsky-is-back-with-textsavvy-a-daily-mobile-game-show/",
      "author": "Amanda Silberling",
      "date": "2026-02-20T13:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/text-savvy-scott-rogowsky.jpg?resize=1200,665",
      "category": "Apps",
      "content": "Scott Rogowsky is a comedian – he knows how to make fun of himself. That’s how he ended uproamingNew York City Comic Con with his own photo printed out like a “Wanted” poster, filming himself asking strangers, “Have you seen this man?”\n\nThese passersby showed a flicker of recognition, looking at the tall, bearded man like someone they had known in a past life, but couldn’t quite place.\n\n“You look familiar! Where do I know you from?” someone asks, as though Rogowsky could be a friend of a friend they had met at a party.\n\n“I know your face,” another person says, staring thoughtfully at the 41-one-year-old.\n\nA cosplayer dressed as a Ghostbuster finally figures it out.\n\n“Did you used to do that game show online?” he asks. “Like, every night?”\n\nRogowsky was just poking fun at himself, embracing the persona of a washed-up internet sensation. “I know my place,” he tells TechCrunch. “I’m not walking around like everybody’s supposed to know who I am.”\n\nBut seven years ago, everyone did.\n\nRogowsky was once the face of HQ Trivia, an app that exploded into popular culture, then faded out of the public consciousness almost as fast. Between 2017 and 2019, Rogowsky hosted the live mobile game show twice a day. At its peak, it drew more than 2.4 million daily viewers each night. It garnered 20 million lifetime downloads.\n\nNow thecomedian is back  with an app of his own called Savvy, which shares a lot of the DNA of HQ. Savvy’s first game,TextSavvy,is a daily live game show where players can earn cash — only this time, viewers are competing against Rogowsky in a word puzzle game that’s something like a hybrid of The New York Times’ Wordle and Connections, rather than trivia.\n\n“I believe this is my calling in a weird way,” Rogowsky says. “I get up there in front of that camera, there’s thousands of people watching at home – millions, back in the HQ days – and it just flows.”\n\nHQ Trivia was founded by the creators of Vine — the short-video platform that predated TikTok — and became a genuine cultural sensation.National newschannelsran storiesabout office workers dropping everything in the middle of the day to play HQ at 3 p.m. It wasgroundbreaking– appointment entertainment in a new format for the streaming era – until the company imploded in a barrage of unfortunate circumstances.\n\nOne founder, Colin Kroll, died of a drug overdose; the other founder, Rus Yusupov, was a divisive leader who clashed with his staff. He oncethreatened a journalistthat he would fire Rogowsky if she published an interview with Rogowsky where he mentioned liking Sweetgreen salads (Yusupov apparently didn’t want to give the fast-food chain free publicity). Most of all, HQ Trivia fell victim to the same trap that dooms so many startups. The company had raised a$15 million funding roundat a $100 million valuation, but it was – quite literally – giving away money, and it never developed a meaningful plan to monetize or build a sustainable business model. The company ultimately filed for bankruptcy in February 2020, with its demise later becoming fodder fordramatic documentariesandtrue-crime-adjacent podcastsdissecting how such a promising app failed so spectacularly.\n\nThis was, understandably, a real blow for Rogowsky. But more bad luck followed. A baseball superfan, Rogowsky had left HQ Trivia in 2019 for a job hostinga daily MLB Network show. He felt like he finally made it – he still lights up recalling running into Hall of Fame pitcher Pedro Martinez in the bathroom. But his show was cancelled when the pandemic shut down baseball. He tried a handful of times over the years to recreate a company like HQ, but it was a journey of false starts.\n\n“Crazy s–t happened that I had no control over, and I felt like I was being tossed and turned on this raft in the ocean, just getting battered by things I can’t control, and that was sort of my attitude about life in general,” he says.\n\nHe considered himself retired from show business and opened a vintage store in California. But he missed comedy.\n\n“I went through this very meaningful personal transformation in the last couple of years,” he said. That process culminated in a seven-day mountain retreat called “the Hoffman Process,” a program that he describes as a digital detox combining lessons in psychology and neuroscience that helped him “take control of [his] life again.”\n\n“It gave me a lot of clarity to say, you know what, I have more to do here,” Rogowsky says. “I got out of that retreat and I was like, ‘I have something to say. People find me funny and entertaining. I find myself funny and entertaining.’”\n\nPeople tuned into HQ Trivia for the prospect of winning a cash prize, but the odds of winning were slim. Millions of viewers came back each night because of Rogowsky’s quick wit and charm, which earned him a cult following of fans who still call him “Quiz Daddy.”\n\n“From the psychological, emotional side, I couldn’t really process what was going on,” Rogowsky says, reflecting on his viral fame. “And in the seven humbling years since, I have a vastly new perspective… I have my fanbase, I have my core followers right here. They’re on board with me, and it’s a matter of getting the word out.”\n\nRogowsky received a lot of messages over the years from people who wanted to help him build the next HQ. But last year, a direct message on X from European game designer Johan de Jager grabbed his attention.\n\n“The idea was the host plays against the audience, so it’s like a two-way interaction,” Rogowsky says. “Imagine HQ if I wasn’t just asking the questions but also answering [them]… That adds another layer to it that no one had thought of before.”\n\nBut in the age of AI, where players can easily look up answers, Rogowsky was skeptical that a trivia game could work fairly, so Savvy embraced word puzzles instead.\n\nThe most that Savvy has paid out in a single game is around $400 — small compared to HQ’s occasional six-figure prize pools. That’s because Rogowsky and his co-founders are funding the company themselves.\n\n“Look, I know this isn’t the thousands of dollars that you saw on HQ, the hundreds of thousands that we eventually got to,” Rogowsky said on one recentTextSavvy broadcast.  “But the difference is HQ was funded by venture capital. They had $8 million in the bank to start. They got another $15 million from other venture capitalists. We don’t got that… This is a low-budge operashe because I’m paying for it!”\n\nRogwosky says he has spoken with investors about Savvy and even gotten some enticing offers. But venture backing often comes with pressure on founders to maximize returns as fast as they can, a model that can set a business up to fail, as HQ demonstrated.\n\n“People want to 10x and 100x [their investment]… I’d be very happy to get to a point of profitability, to where we can just keep growing the company, keep hiring more people, keep making more games,” Rogowsky says. “I’m not looking for some type of eight-figure, nine-figure exit. This is what I want to do. I’m going to do this as long as I continue to wake up every morning and say, ‘Goddamn, I’m excited to get up there in front of that camera and have fun.’”\n\nTextSavvy is currently running a “Season 0,” a soft launch that allows the team to work through technical kinks before formally launching on March 1. So far, without much promotion, TextSavvy has peaked at about 4,000 viewers in one night.\n\nThat’s not much compared to the HQ days. Then again, when TechCrunch firstwrote about HQ, the app only had about 3,300 concurrent viewers. Who’s to say Savvy can’t do it again?\n\n“We’re not going anywhere this time,” Rogowsky said. “There’s no one to fire me. There’s no drama, there’s no tension. There’s not going to be a documentary about Savvy the way there was about HQ.”",
      "excerpt": "Scott Rogowsky is a comedian – he knows how to make fun of himself. That’s how he ended uproamingNew York City Comic Con with his own photo printed out like a “Wanted” poster, filming himself asking strangers, “Have you seen this man?”\n\nThese passersby showed a flicker of recognition, looking at the",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Anthropic-funded group backs candidate attacked by rival AI super PAC",
      "link": "https://techcrunch.com/2026/02/20/anthropic-funded-group-backs-candidate-attacked-by-rival-ai-super-pac/",
      "author": "Rebecca Bellan",
      "date": "2026-02-20T12:52:48-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2259873774.jpg?w=1024",
      "category": "",
      "content": "Late last year, New York Assembly member Alex Bores became the target of a campaign by a pro-AI super PAC to thwart his congressional bid. The group,Leading the Future, is armed with more than $100 million from backers including Andreessen Horowitz, OpenAI President Greg Brockman, AI search startup Perplexity, and Palantir co-founder Joe Lonsdale.\n\nBores’ response to was simple:bring it on.Now, he’s got the muscle to back that challenge up.\n\nPublic First Action, a PAC backed by a$20 million donation from Anthropic, is spending $450,000 to boost Bores in the race for New York’s 12th congressional district, reportsBloomberg. Like its rival, the committee is pro-AI, but it’s pitching a different vision, one centered on transparency, safety standards, and public oversight.\n\nMeanwhile, the industry-backed PAC,Leading the Future, has already poured $1.1 million into ads attacking Bores, largely because he sponsoredNew York’s RAISE Act,which requires major AI developers to disclose safety protocols and report serious misuse of their systems.",
      "excerpt": "Late last year, New York Assembly member Alex Bores became the target of a campaign by a pro-AI super PAC to thwart his congressional bid. The group,Leading the Future, is armed with more than $100 million from backers including Andreessen Horowitz, OpenAI President Greg Brockman, AI search startup ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Apple’s iOS 26.4 arrives in public beta with AI music playlists, video podcasts, and more",
      "link": "https://techcrunch.com/2026/02/20/apples-ios-26-4-arrives-in-public-beta-with-ai-music-playlists-video-podcasts-and-more/",
      "author": "Lauren ForristalSarah Perez11:44 AM PST · February 20, 2026",
      "date": "2026-02-20T11:44:22-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/apple-ios-26-beta.jpg?resize=1200,691",
      "category": "Apps",
      "content": "Apple this week released thelatest versionof its mobile operating system,iOS 26.4, which introduces several new features, including an AI-powered playlist-generation feature in Apple Music, support for video content in the Podcasts app, end-to-end encryption (E2EE) for RCS messages, and more.\n\nThe update is currently available in pubic beta, with the public release expected sometime in March or April.\n\nOne of the most noticeable improvements arrives in Apple Music — iOS 26.4 introduces a new AI-powered “Playlist Playground” feature that leverages Apple Intelligence. The feature allows users to generate a custom 25-song playlist from a text prompt, such as “upbeat workout mix” or “calm evening.” Users can then further refine the results and even select matching cover art.\n\nIn addition, Apple Music’s user interface has been refreshed to showcase full-screen artwork for albums and playlists.\n\nPlus, Apple Music is getting a new “Concerts Near You” section that helps users discover live shows from their favorite artists. You can filter this section by Date and Genre, or switch locations if you’re traveling.\n\nFollowing Spotify’s push into video, Apple’s Podcasts app is making it easy toswitch back and forth between audio and video episodeswith this release. Creators can publish video podcasts using HTTP Live Streaming (HLS), and listeners can seamlessly switch between audio and video playback within the same episode, moving to a full horizontal display if they choose.\n\nAt launch, the video episodes will be integrated with other Apple Podcasts features, like personalized recommendations and editorial curation on the New tab and Category pages, just as audio podcasts are.\n\nHLS also brings an automatic quality adjustment feature, which helps videos play better whether listeners are on Wi-Fi or cellular. Plus, users will be able to download video episodes for offline viewing. At launch, HLS is supported by Acast, Amazon’s ART19, Triton’s Omny Studio, and SiriusXM, including SiriusXM Media, AdsWizz, and Simplecast.\n\nCreators will be able to dynamically insert video ads, including host-read spots, into their podcasts, too. Apple doesn’t charge creators to distribute podcasts, but it says that, starting later this year, participating ad networks will have to pay an impression-based fee for the delivery of the dynamic ads in the HLS videos.\n\nMessaging is also receiving an important upgrade with encrypted Rich Communication Services (RCS), which begins testing in iOS 26.4. End-to-end encryption for RCS conversations will one day help ensure messages between iPhone users and Android users are just as secure as iMessage.\n\nCurrently, Apple is only testing this between iPhones in beta. These conversations will be labeled as encrypted and cannot be read while sent between devices. The company notes that the feature will be released publicly in a later software update for iOS, iPadOS, macOS, and watchOS, and the beta is not available for all devices and carriers.\n\nSecurity improvements are another highlight of iOS 26.4. Stolen Device Protection is now enabled by default, adding an extra layer of biometric authentication for sensitive actions such as accessing saved passwords or making certain account changes. By requiring Face ID or Touch ID authentication in more scenarios, Apple reduces the risk of unauthorized access if a device is stolen and the passcode is compromised.\n\nDrivers using Apple CarPlay will also notice changes. CarPlay now supportsin-car video playbackfor select apps — including the Apple TV app —but only when the vehicle is parked to ensure safety. This enhancement introduces new entertainment options for passengers when they’re stopped or while waiting in the car for a period of time. (Hooray for parents in the pickup line at school!)\n\nCarPlay for the first time will offer access to third-party AI services like OpenAI’s ChatGPT, Google’s Gemini, and Anthropic’s Claude.\n\nMeanwhile, the Camera app introduces Audio Zoom. When recording video, the microphone focuses on the subject as you zoom in, reducing background noise and enhancing clarity. This feature makes it easier to capture speeches, performances, or interviews without external audio equipment.\n\nAdditionally, the Ambient Music feature is now accessible through a widget, letting users instantly play soundscapes designed for focus, sleep, or relaxation directly from the Home Screen, instead of just the Control Center as before. The feature, firstintroducedin iOS 18.4, added a variety of ambient sounds to stream across categories like Sleep, Chill, Productivity, and Wellbeing.\n\nThere’s also a new “Urgent” section in the Reminders app that groups high-priority tasks and can trigger more prominent alerts when deadlines approach. Setting a reminder as Urgent will add an alarm so you’re sure not to miss the event.\n\nA few other smaller features include the following:\n\nNotably absent from this release is a next-generation Siri experience. While Apple has signaled deeper AI ambitions for its voice assistant, those larger changesdo not appear in iOS 26.4, reportedly delayed once again.",
      "excerpt": "Apple this week released thelatest versionof its mobile operating system,iOS 26.4, which introduces several new features, including an AI-powered playlist-generation feature in Apple Music, support for video content in the Podcasts app, end-to-end encryption (E2EE) for RCS messages, and more.\n\nThe u",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "InScope nabs $14.5M to solve the pain of financial reporting",
      "link": "https://techcrunch.com/2026/02/20/inscope-nabs-14-5m-to-solve-the-pain-of-financial-reporting/",
      "author": "Marina Temkin",
      "date": "2026-02-20T11:24:57-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/In-scope.jpg?resize=1200,1012",
      "category": "Fintech",
      "content": "Even without a background in accounting, anyone who has ever glanced at a 10-K or 10-Q can tell that preparing financial statements is a complex, tedious process.\n\nWhile legacy platforms like Workiva and Donnelley Financial Solutions aim to streamline financial reporting, longtime accountants Mary Antony (pictured right) and Kelsey Gootnick (pictured center) found themselves exhausted by various manual hurdles within these tools (co-founder and CTO Jared Tibshraeny is pictured left).\n\nThe duo met seven years ago at Flexport, where Gootnick served as the company’s controller and Antony served as assistant controller. They stayed in touch even after Antony moved to Miro and Gootnick to Hopin and later Thrive Global.\n\nNo matter where they worked, Antony and Gootnick kept running into the same manual challenges.\n\n“The way financial statements come together, it’s just patched together in a lot of spreadsheets, moved into a bunch of Word documents, emailed back and forth between people,” Antony told TechCrunch.\n\nSo, in 2023, the pair decided to launchInScope, an AI-powered financial reporting platform that helps companies and accounting firms automate many aspects of the financial statement preparation process. The startup just raised $14.5 million in Series A funding led by Norwest, with participation from Storm Ventures and existing backers Better Tomorrow Ventures and Lightspeed Venture Partners.\n\nWhile InScope isn’t fully automating the generation of income statements and balance sheets yet, it automates a vast amount of the manual busy work, from verifying math to formatting. Simply ensuring that dollar signs and commas are uniform and correctly placed can save accountants up to 20% of their time, according to Antony, InScope’s CEO.\n\nOver the last 12 months, InScope has grown its customer base by 5x, attracting significant accounting firms such as CohnReznick, currently ranked in thetop 15 nationally.\n\nOf course, it may be a while before accountants — a profession Antony describes as risk-averse — feel comfortable letting AI fully automate financial statement preparation. Nonetheless, that remains InScope’s ultimate goal.\n\nNorwest partner Sean Jacobsohn told TechCrunch that he invested in InScope after he heard from multiple clients that the startup’s product saves them a lot of time.\n\nJacobsohn is convinced that InScope stands out because few founders possess the specific expertise required to reinvent financial reporting technology.\n\n“It’s a very complex space, and you need to be able to have been in the shoes of the buyer before,” he said.\n\nAntony agrees that accountants are not typically the type to launch startups. Fortunately, she and Gootnick developed their entrepreneurial instincts through years of operating within the fast-paced cultures of other high-growth startups.",
      "excerpt": "Even without a background in accounting, anyone who has ever glanced at a 10-K or 10-Q can tell that preparing financial statements is a complex, tedious process.\n\nWhile legacy platforms like Workiva and Donnelley Financial Solutions aim to streamline financial reporting, longtime accountants Mary A",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}