{
  "last_updated": "2026-02-04T21:36:46.858197+00:00",
  "articles": [
    {
      "title": "Hackers publish personal information stolen during Harvard, UPenn data breaches",
      "link": "https://techcrunch.com/2026/02/04/hackers-publish-personal-information-stolen-during-harvard-upenn-data-breaches/",
      "author": "Lorenzo Franceschi-Bicchierai",
      "date": "2026-02-04T09:56:37-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/harvard-university-campus-2025.jpg?resize=1200,770",
      "category": "Security",
      "content": "A notorious hacking group has claimed responsibility for last year’s data breaches at Harvard University and the University of Pennsylvania (UPenn) and published the data that they claim to have stolen from the two schools.\n\nOn Wednesday, the group known asShinyHunterspublished what it claims are more than 1 million records from each university on the group’s dedicated leak site, which the gang uses to extort its victims.\n\nIn November,UPenn confirmed a data breachof “a select group of information systems related to Penn’s development and alumni activities.” At the time, the hackers also sent alumni emails announcing the hack fromofficial university addresses.\n\nThe university blamed the breach onsocial engineering, an attack that often relies on hackers impersonating someone and tricking them into doing something they would not normally do. In itsofficial breach disclosure web page, which has since been taken offline, UPenn did not say exactly what type of data the hackers stole, simply saying the cybercriminals accessed “systems related to Penn’s development and alumni activities.”\n\nContact UsDo you have more information about these breaches, or similar attacks? From a non-work device, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram, Keybase and Wire @lorenzofb, oremail.\n\nTechCrunch verified a portion of the dataset by confirming with alumni and public records, such as matching the data against student ID numbers.\n\nLater in November, Harvard University also confirmed a breach on its alumni systems, blaming it on a voicephishingattack, meaning an attack where hackers tricked the targets into clicking on a link or opening an attachment with a voice call.\n\nHarvardsaidthat the stolen data included email addresses, phone numbers, home and business addresses, event attendance, details of donations to the university, and other biographical information relating to the university’s fundraising and alumni engagement activit",
      "excerpt": "A notorious hacking group has claimed responsibility for last year’s data breaches at Harvard University and the University of Pennsylvania (UPenn) and published the data that they claim to have stolen from the two schools.\n\nOn Wednesday, the group known asShinyHunterspublished what it claims are mo",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Tinder looks to AI to help fight ‘swipe fatigue’ and dating app burnout",
      "link": "https://techcrunch.com/2026/02/04/tinder-looks-to-ai-to-help-fight-swipe-fatigue-and-dating-app-burnout/",
      "author": "Sarah Perez",
      "date": "2026-02-04T10:08:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/03/GettyImages-2197117084.jpg?resize=1200,843",
      "category": "Apps",
      "content": "Tinder is turning to a new AI-powered feature, Chemistry, to help it reduce so-called “swipe fatigue,” a growing problem among online dating users who are feeling burned out and are in search of better outcomes.\n\nIntroduced last quarter, the Match-owned dating app said that Chemistry leverages AI to get to know users through questions and, with permission, accesses their Camera Roll on their phone to learn more about their interests and personality.\n\nOn Match’s Q4 2026 earnings call, one analyst from Morgan Stanley asked for an update on the product’s success so far.\n\nMatch CEO Spencer Rascoff noted that Chemistry was still only being tested in Australia for the time being, but said that the feature offered users an “AI way to interact with Tinder.” He explained that users could choose to answer questions to then “get just a single drop or two, rather than swiping through many, many profiles.”\n\nIn addition to Chemistry’s Q&A and Camera Roll features, the company plans to use the AI feature in other ways going forward, the CEO also hinted.\n\nMost importantly, Rascoff said the feature is designed to combat swipe fatigue — a complaint from users who say they have to swipe through too many profiles to find a potential match.\n\nThe company’s turn toward AI comes as Tinder and other dating apps have been experiencing paying subscriber declines, user burnout, and declines in new sign-ups.\n\nIn the fourth quarter, new registrations on Tinder were still down 5% year-over-year, and its monthly active users were down 9%. These numbers show some slight improvements over prior quarters, which Match attributes to AI-driven recommendations that change the order of profiles shown to women, and other product experiments.\n\nMatch said that this year, it aims to address common Gen Z pain points, including better relevance, authenticity, and trust. To do so, the company said it is redesigning discovery to make it less repetitive and is using other features, likeFace Check— a facial recogni",
      "excerpt": "Tinder is turning to a new AI-powered feature, Chemistry, to help it reduce so-called “swipe fatigue,” a growing problem among online dating users who are feeling burned out and are in search of better outcomes.\n\nIntroduced last quarter, the Match-owned dating app said that Chemistry leverages AI to",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "ElevenLabs raises $500M from Sequoia at an $11 billion valuation",
      "link": "https://techcrunch.com/2026/02/04/elevenlabs-raises-500m-from-sequioia-at-a-11-billion-valuation/",
      "author": "Ivan Mehta",
      "date": "2026-02-04T07:33:58-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/01/ElevenLabs-feat.jpg?resize=1200,669",
      "category": "Venture",
      "content": "Voice AI company ElevenLabs said today it raised $500 million in a new funding round led by Sequoia Capital, which was an investor inthe startup’s last secondary round through a tender. Sequoia partner Andrew Reed is joining the company’s board.\n\nThe startup is now valued at $11 billion, more than three times its valuation inits last round in January 2025. Earlier in the year, theFinancial Timesreported that the startup was looking to raise at that valuation.\n\nThe company said that existing investor a16z quadrupled its investment amount, and Iconiq, which led the last round, tripled it. Some prior investors, like BroadLight, NFDG, Valor Capital, AMP Coalition, and Smash Capital, also joined the round. New investors for the funding included Lightspeed Venture Partners, EvanticCapital, and Bond.\n\nElevenLabs said that it will disclose some investors later in February, which might be strategic partners. The company has raised over $781 million to date. It said that it will use the funding for research and product development, along with expansion in international markets like India, Japan, Singapore, Brazil, and Mexico.\n\nThe company’s co-founder, Mati Staniszewski, indicated that ElevenLabs might work on agents beyond voice and incorporate video. In January, the company announceda partnership with LTX to produce audio-to-video content.\n\n“The intersection of models and products is critical – and our team has proven, time and again, how to translate research into real-world experiences. This funding helps us go beyond voice alone to transform how we interact with technology altogether. We plan to expand our Creative offering – helping creators combine our best-in-class audio with video and Agents – enabling businesses to build agents that can talk, type, and take action,” he said in a statement.\n\nThe company has seen good growth momentum as it closed the year at $330 million ARR. In an interview withBloombergearlier this year, Staniszewski said that it took ElevenLabs fiv",
      "excerpt": "Voice AI company ElevenLabs said today it raised $500 million in a new funding round led by Sequoia Capital, which was an investor inthe startup’s last secondary round through a tender. Sequoia partner Andrew Reed is joining the company’s board.\n\nThe startup is now valued at $11 billion, more than t",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Uber appoints new CFO as its AV plans accelerate",
      "link": "https://techcrunch.com/2026/02/04/uber-appoints-new-cfo-as-its-av-plans-accelerate/",
      "author": "Ram Iyer",
      "date": "2026-02-04T06:15:34-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/07/GettyImages-2043993878-e1722276196662.jpg?resize=1200,676",
      "category": "Transportation",
      "content": "Uber is promoting Balaji Krishnamurthy, its VP of strategic finance and investor relations, to be its CFO, replacing its current finance chief Prashanth Mahendra-Rajah.\n\nKrishnamurthy has been at Uber for over six years, spending most of his tenure in the company in its investor relations division. He often posts about the company’s autonomous ride-hailing efforts, and has a board seat at AV company Waabi — so the appointment may be a signal of the company’s plans to expand its driverless investments and operations.\n\nIndeed, on the company’s fourth-quarter earnings call on Wednesday, Krishnamurthysaidthe company would invest capital in its AV software partners, work with AV makers by investing equity or via offtake agreements, and “support our AV infrastructure partners.”\n\n“With large and growing free cash flows, over the coming years we will invest with discipline across a multitude of opportunities, including positioning Uber to win in an AV future,” Krishnamurthy wrote in astatementdetailing the company’s Q4 results.\n\nUber’s CEO Dara Khosrowshahi said on the call that he was convinced autonomous vehicles would “unlock a multitrillion-dollar opportunity,” for the company, adding that autonomy “fundamentally amplifies” the strengths of the company’s platform.\n\n“By the end of 2026, we expect to be facilitating AV trips in as many as 15 cities globally, with a roughly even split of U.S. and international cities. And by 2029, we intend to be the largest facilitator of AV trips in the world,” Khosrowshahi said.\n\nOver the past two years, Uber has amassed partnerships with at least 20 autonomous vehicle companies across a variety of use cases, including sidewalk delivery robots, robotaxis, and trucking. Waymo is perhaps its highest profile partner with shared robotaxi operations in Atlanta and Austin. It has also struck deals withAvride, UK-based Wayve, Chinese companiesWeRide,Momenta, andVolkswagen, among others.\n\nIt has made direct investments in AV startups as well. W",
      "excerpt": "Uber is promoting Balaji Krishnamurthy, its VP of strategic finance and investor relations, to be its CFO, replacing its current finance chief Prashanth Mahendra-Rajah.\n\nKrishnamurthy has been at Uber for over six years, spending most of his tenure in the company in its investor relations division. ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Lunar Energy raises $232M to deploy home batteries that prop up the grid",
      "link": "https://techcrunch.com/2026/02/04/lunar-energy-raises-232m-to-deploy-home-batteries-that-prop-up-the-grid/",
      "author": "Tim De Chant",
      "date": "2026-02-04T09:56:40-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Lunar-System_KM-1.jpg?resize=1200,673",
      "category": "Climate",
      "content": "Forget EVs — stationary batteries aregetting all the buzz, and investment, in the U.S. these days.\n\nStartupLunar Energyis the latest example. The six-year-old company, which builds battery packs for homeowners in California, Georgia, and Washington, said Wednesday it has completed two large funding rounds. The startup shared it raised a previously unannounced $130 million Series C and a $102 million Series D. The Series C was led by Activate Capital, while the Series D was led by B Capital and Prelude Ventures.\n\nThe startup plans to use the funds to scale manufacturing to 20,000 units by the end of this year before ramping up to 100,000 by the end of 2028. In total, Lunar has raised more than $500 million from investors.\n\nStationary storage has become a bright spot for battery manufacturers that have been subject to policy whiplash after the Trump administration and GOP-controlled Congressgutted large parts of the Inflation Reduction Act, which had incentivized companies to build batteries in the U.S. to supply the automotive industry.\n\nAs the grid strains under the weight of an increasingly electrified economy — along with the boom in data center demand — grid-connected batteries have become one of the most versatile ways to boost its resiliency.\n\nLunar can call on its fleet of batteries, which come in 5 kilowatt-hour modules between 15 kilowatt-hours and 30 kilowatt-hours, to deliver juice to the grid when needed. Its virtual power plant (VPP) software can also control EV chargers and appliances, allowing it to both supply electrons while tamping down demand.\n\nSuch VPPs areexpectedto be able to replace costly and polluting peaking power plants in a matter of years.\n\nCompetition in the space has been heating up lately. In October,Base Power raised $1 billion, less than six months after raising a $200 million round for its residential battery-based VPP. Tesla operates its own Powerwall-based VPP, too.\n\nOutside of residential settings, Tesla’s storage business has be",
      "excerpt": "Forget EVs — stationary batteries aregetting all the buzz, and investment, in the U.S. these days.\n\nStartupLunar Energyis the latest example. The six-year-old company, which builds battery packs for homeowners in California, Georgia, and Washington, said Wednesday it has completed two large funding ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Exclusive: Positron raises $230M Series B to take on Nvidia’s AI chips",
      "link": "https://techcrunch.com/2026/02/04/exclusive-positron-raises-230m-series-b-to-take-on-nvidias-ai-chips/",
      "author": "Rebecca Bellan",
      "date": "2026-02-04T00:18:51-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/positron.jpg?w=1200",
      "category": "AI",
      "content": "Semiconductor startupPositronhas secured $230 million in Series B funding, TechCrunch has exclusively learned. The outfit plans to use the capital to speed up deployment of its high-speed memory chips, a critical component for the chips used for AI workloads, sources familiar with the matter told TechCrunch.\n\nThe round, which brought Positron to a $1 billion valuation, was co-led by Arena Private Wealth, Jump Trading, and Unless, with strategic investment from Qatar Investment Authority (QIA), the country’s sovereign wealth fund, which has been increasingly focused on building out AI infrastructure, the sources said.\n\nThe Reno-based startup’s Series B comes as hyperscalers and AI firms push to reduce their reliance on longstanding leader Nvidia. These firms include OpenAI, which, despite being one of Nvidia’s largest and most important customers, isreportedlyunsatisfied with some of the firm’s latest AI chips and has been seeking alternatives since last year.\n\nMeanwhile, Qatar, through QIA, has been accelerating a broader push into so-called “sovereign” AI infrastructure — a priority repeatedly underscored at Web Summit Qatar in Doha this week. Several sources told TechCrunch the country views compute capacity as critical to staying competitive on the global economic stage, and is positioning itself as a leading AI services hub in the Middle East, fueling interest in startups like Positron.\n\nThe strategy is already taking shape through major commitments, including a $20 billion AI infrastructurejoint venture with Brookfield Asset Managementthat was announced in December.\n\nPositron’s fundraise brings the three-year-old startup’s total capital raised to just over $300 million. The startup previously raised $75 million last year from investors including Valor Equity Partners, Atreides Management, DFJ Growth, Flume Ventures, and Resilience Reserve.\n\nThe company claims its first-generation chip, Atlas, manufactured in Arizona, can match the performance of Nvidia’s H100 G",
      "excerpt": "Semiconductor startupPositronhas secured $230 million in Series B funding, TechCrunch has exclusively learned. The outfit plans to use the capital to speed up deployment of its high-speed memory chips, a critical component for the chips used for AI workloads, sources familiar with the matter told Te",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "The Minneapolis tech community holds strong during ‘tense and difficult time’",
      "link": "https://techcrunch.com/2026/02/03/minnesota-tech-community-founders-investors-ice-response/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-03T14:17:45-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2257689472.jpg?w=1024",
      "category": "Startups",
      "content": "The city’s tech scene is reeling as U.S. immigration agents have escalated their crackdown in Minneapolis,killing several people, including at least two U.S. citizens.\n\nEight Minneapolis-based founders and investors told TechCrunch that they have put much of their work on hold and now spend their days focused on their communities, volunteering at churches, and helping buy food. It’s part of a grassroots effort, across race and class, that is seeing people speak out, donate money, protest, and offer emotional support to one another.\n\n“There’s a lot of commonality between how a teacher is reacting right now and how a tech professional is reacting,” Scott Burns, an investor in the area, told TechCrunch. He said people are “very fatigued.” Burns is going to church more often to help pack food to deliver to those too frightened to leave their homes. “It was like what happens after a natural disaster,” he said of the effort.\n\nBurns and other members of the Minneapolis tech industry told TechCrunch that the immigration raids have been very disruptive to their lives, describing a city that has seen itself united in the last several weeks in theface of escalating violencefrom U.S. Immigration and Customs Enforcement.\n\nHow can building a company remain a focal point when ICE agents appear to be everywhere,plainclothedandarmed with military-grade weapons? Federal agents have been seen searching public transportation and prowling around workplaces. They are outside homes andin parking lots. They have beenspotted circling schools.\n\nOne Black founder, who spoke on condition of anonymity to protect members of his staff, said he now carries his passport with him everywhere he goes. He is a U.S. citizen but has seen people of color throughout the city profiled and picked up by ICE and border patrol agents.\n\n“People aren’t exaggerating how hard it has been. It’s hard to focus; it’s been a challenge just navigating even my team through it,” he said.\n\nHe recalled a routine phone meetin",
      "excerpt": "The city’s tech scene is reeling as U.S. immigration agents have escalated their crackdown in Minneapolis,killing several people, including at least two U.S. citizens.\n\nEight Minneapolis-based founders and investors told TechCrunch that they have put much of their work on hold and now spend their da",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "2026 plans: What’s next for Startup Battlefield 200",
      "link": "https://techcrunch.com/2026/02/03/looking-ahead-to-2026-whats-next-for-startup-battlefield-200/",
      "author": "Isabelle Johannessen",
      "date": "2026-02-03T10:57:30-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/11/54889460445_20c033b45a_o-2.jpg?resize=1200,800",
      "category": "Startups",
      "content": "TechCrunch Startup Battlefield 200is the flagship early-stage startup competition held atTechCrunch Disruptin San Francisco, spotlighting the world’s most promising young companies. Each year, thousands of applicants from around the globe vie for one of 200 slots in the cohort, which provides unparalleled visibility, access to top-tier investors, and opportunities to grow.\n\nEarly-stage startups from around the world are joining theStartup Battlefield email listto be the first to know when applications open this month. Don’t miss a beat if you’re ready to join the action.\n\nStartup Battlefield 200is a highly selective startup launch program designed to prepare early-stage startups for visibility, investment, and scale. Each year, TechCrunch hand-selects 200 companies to gain unmatched exposure, credibility, and opportunities to scale faster than they ever imagined:\n\nStartup Battlefield’s track record is among the strongest in the industry — alumni represent1,700+ companiesthat have collectively raised over $32 billion and include well-known names such as:\n\nIn 2026,Startup Battlefield 200will once again bring together a global cohort of high-potential early-stage startups building across AI, climate, health, fintech, and beyond.\n\nApplications will open in the middle of this month and close in mid-June. Selected startups will be notified aroundSeptember 1, when the virtual preparation program begins — designed to help founders refine their story, sharpen their pitch, and get ready for the pitch of a lifetime on the TechCrunch Disrupt stage.\n\nFor founders and investors alike, Startup Battlefield 200 remains one of the most influential global early-stage startup stages — a place where breakout companies get seen, funded, and scaled.\n\nDon’t miss a moment of the action:Join the Startup Battlefield mailing listto be the first to know when applications open next month.",
      "excerpt": "TechCrunch Startup Battlefield 200is the flagship early-stage startup competition held atTechCrunch Disruptin San Francisco, spotlighting the world’s most promising young companies. Each year, thousands of applicants from around the globe vie for one of 200 slots in the cohort, which provides unpara",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Amazon to begin testing AI tools for film and TV production next month",
      "link": "https://techcrunch.com/2026/02/04/amazon-to-begin-testing-ai-tools-for-film-and-tv-production-next-month/",
      "author": "Lauren Forristal",
      "date": "2026-02-04T13:26:43-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Amazon-HouseofDavid.jpg?w=1080",
      "category": "",
      "content": "Last summer, Amazon MGM Studios launched a dedicatedAI Studioto develop proprietary AI tools to streamline TV and film production, with a focus on areas like improving character consistency across shots and supporting pre- and post-production.\n\nAccording to a report fromReuters, those tools are now ready to move beyond internal testing. Amazon will begin a closed beta program in March, inviting industry partners to try out its AI tools.\n\nAmazon said it anticipates sharing initial outcomes from the program by May. The company chose not to provide further details on the developments when approached by TechCrunch for a comment.\n\nThe AI Studio is collaborating with notable producers like Robert Stromberg, known for “Maleficent,” Kunal Nayyar from “The Big Bang Theory,” and former animator Colin Brady from Pixar to learn the best way to implement these tools. Amazon is also tapping Amazon Web Services for support and intends to work with several LLM providers.\n\nAlbert Cheng, who heads the AI Studios initiative, emphasized that the goal is to support creative teams, not to replace them. The focus is on improving efficiency and reducing costs while ensuring that intellectual property is protected and AI-generated content isn’t absorbed into other AI models. One example used is Amazon’s “House of David” series, which featured350 AI-generated shotsin season two.\n\n​However, the rise of adoption of AI in Hollywood has stirred up plenty of debate. Many people in the industry worry about what it means for jobs, creativity, and the future of filmmaking.\n\nThe conversations around AI are only getting louder as more companies experiment with these new tools. For instance, Netflix has also jumped on the AI bandwagon, with Co-CEO Ted Sarandos revealing that its series “The Eternaut”used generative AIto create a building collapse scene.\n\nIn recent years, Amazon has cited its success with AI as a factor in layoffs. The company recently eliminated 16,000 jobsin January, following14,000 l",
      "excerpt": "Last summer, Amazon MGM Studios launched a dedicatedAI Studioto develop proprietary AI tools to streamline TV and film production, with a focus on areas like improving character consistency across shots and supporting pre- and post-production.\n\nAccording to a report fromReuters, those tools are now ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Roblox’s 4D creation feature is now available in open beta",
      "link": "https://techcrunch.com/2026/02/04/robloxs-4d-creation-feature-is-now-available-in-open-beta/",
      "author": "Lauren Forristal",
      "date": "2026-02-04T09:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Roblox4d.png?w=1200",
      "category": "Gaming",
      "content": "Last year, Robloxlaunchedan open source AI model that could generate 3D objects on the platform, helping users quickly design digital items such as furniture, vehicles, and accessories. The company claims the tool, called Cube 3D, has so far helped users generate over 1.8 million 3D objects since it was rolled out last March.\n\nOn Wednesday, the companylaunched the open betafor its anticipated 4D creation feature that lets creators make not just static 3D models, but fully functional and interactive objects. The feature has been inearly accesssince November.\n\nRoblox says 4D creation adds an important new layer: interactivity. With this technology, users can design items that can move and react to players in the game.\n\n​At launch, there are two types of object templates (called schemas) that creators can try out.\n\nThe first is the “Car-5” schema, which is used to create a car made of five separate parts: the main body and four wheels. Previously, cars were a single, solid 3D object that couldn’t move. The new system breaks down objects into parts and assigns behaviors to each so that they function individually within the virtual world. The AI therefore can generate cars with spinning wheels, making them more realistic and interactive. ​\n\nThe second is called “Body-1,” which can generate any object made from a single piece, like a simple box or sculpture.\n\nThe first experience with 4D generation is a game calledWish Master, where players can generate cars they can drive, planes they can fly, and even dragons.\n\n​In the future, Roblox plans to let creators make their own schemas so they’ll have more freedom to define how objects behave. The company says it is also developing new technology that could use a reference image to create a detailed 3D model that matches the image’s style (example below).\n\nThe company says it is developing more ways to help people create games and experiences using AI, including a project it has dubbed “real-time dreaming.” Roblox CEO David Bas",
      "excerpt": "Last year, Robloxlaunchedan open source AI model that could generate 3D objects on the platform, helping users quickly design digital items such as furniture, vehicles, and accessories. The company claims the tool, called Cube 3D, has so far helped users generate over 1.8 million 3D objects since it",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}