{
  "last_updated": "2026-02-07T22:29:38.164685+00:00",
  "articles": [
    {
      "title": "New York lawmakers propose a three-year pause on new data centers",
      "link": "https://techcrunch.com/2026/02/07/new-york-lawmakers-propose-a-three-year-pause-on-new-data-centers/",
      "author": "Anthony Ha",
      "date": "2026-02-07T10:23:04-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/06/GettyImages-2217198328.jpeg?resize=1200,800",
      "category": "Government & Policy",
      "content": "New Yorker state lawmakers haveintroduced a billthat would impose a moratorium of at least three years on permits tied to the construction and operation of new data centers. While the bill’s prospects are uncertain,Wired reportsthat New York is at least the sixth state to consider pausing construction of new data centers.\n\nAs tech companies plan tospend ever-increasing amounts of moneyto build AI infrastructure, both Democrats and Republicans have expressed concerns about the impact those data centers might have on surrounding communities. Studies have also linked data centers toincreased home electricity bills.\n\nCritics include progressive Senator Bernie Sanders, who hascalled for a national moratorium, as well as conservative Florida Governor Ron De Santis, whosaid data centers will lead to“higher energy bills just so some chatbot can corrupt some 13 year old kid online.”\n\nMore than 230 environmental groups including Food & Water Watch, Friends of the Earth, and Greenpeacerecently signed an open letter to Congresscalling for a national moratorium on the construction of new data centers.\n\nEric Weltman of Food & Water Watch told Wired that the New York bill — sponsored by state senator Liz Krueger and assemblymember Anna Kelles, both Democrats — was “our idea.” Data center pauses have also been proposed by Democrats in Georgia, Vermont, and Virginia, while Republicans sponsored similar bills in Maryland and Oklahoma.\n\nAccording to Politico, Krueger described her state as “completely unprepared” for the “massive data centers” that are “gunning for New York.”\n\n“It’s time to hit the pause button, give ourselves some breathing room to adopt strong policies on data centers, and avoid getting caught in a bubble that will burst and leave New York utility customers footing a huge bill,” she said.\n\nLast month, New York Governor Kathy Hochulannounced a new initiativecalled Energize NY Development, which her office said would both modernize the way large energy users (i.e., da",
      "excerpt": "New Yorker state lawmakers haveintroduced a billthat would impose a moratorium of at least three years on permits tied to the construction and operation of new data centers. While the bill’s prospects are uncertain,Wired reportsthat New York is at least the sixth state to consider pausing constructi",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "‘Industry’ season 4 captures tech fraud better than any show on TV right now",
      "link": "https://techcrunch.com/2026/02/06/industry-season-4-captures-tech-fraud-better-than-any-show-on-tv-right-now/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-06T16:06:23-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/max-minghella-myha-la.jpg?resize=1200,800",
      "category": "Media & Entertainment",
      "content": "HBO’s hit financial thriller “Industry” has delivered one of its most compelling storylines yet this season: a hunt to expose a fraudulent fintech company called Tender.\n\nThe show follows Harper Stern, who’s leading her newly launched investment firm and looking for a company to short — essentially, betting that its stock will crash. After a journalist tips her off that something’s wrong with Tender, she sends her associates, Sweetpea and Kwabena, to Ghana to investigate.\n\nWhat they discover is damning. “Fake users drive fake revenue drives fake cash,” Sweetpea tells Harper. The entire company appears to be built on fabricated numbers. “The thing is nothing.”\n\nWhat’s fascinating about this season of “Industry” is how well it speaks to this moment. Tender starts as a payment processing platform for adult content. The show references the very real (and still controversial)Online Safety Billthat the UK introduced, which has led to age verification and other enhanced rules for consuming adult content online. Because of its affiliation with adult content, Tender finds itself at odds with the new government’s regulation and must pivot or die, as the saying goes.\n\nIts CFO-turned-leader, Whitney, wants the company to pivot into a bank and has a plan to make that happen, including making Tender’s CEO, Henry, the face of that transformation. Whitney is the embodiment of every tech baron cliche. Move fast, break things. Win at all costs. He’s lobbying politicians for a banking license and hunting for merger opportunities.\n\nHarper, meanwhile, is leading her newly launched firm after feeling undermined at her previous firm and being called a DEI plant by the man who hired her (a nod to the decline of DEI in the past few years). She has teamed up with new friends and old frenemies and is looking for blood — meaning a company on the precipice of crashing. To her, Tender is that company.\n\nThis puts her at odds with her friend Yasmin, who is married to Henry and is crafting communic",
      "excerpt": "HBO’s hit financial thriller “Industry” has delivered one of its most compelling storylines yet this season: a hunt to expose a fraudulent fintech company called Tender.\n\nThe show follows Harper Stern, who’s leading her newly launched investment firm and looking for a company to short — essentially,",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Benchmark raises $225M in special funds to double down on Cerebras",
      "link": "https://techcrunch.com/2026/02/06/benchmark-raises-225m-in-special-funds-to-double-down-on-cerebras/",
      "author": "Marina Temkin",
      "date": "2026-02-06T21:23:04-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/03/GettyImages-1251294592.jpg?w=1024",
      "category": "Venture",
      "content": "This week, AI chipmaker Cerebras Systems announced that it raised $1 billion in fresh capital at a valuation of$23 billion— a nearly threefold increase from the$8.1 billionvaluation the Nvidia rival had reached just six months earlier.\n\nWhile the round was led by Tiger Global, a huge part of the new capital came from one of the company’s earliest backers: Benchmark Capital. The prominent Silicon Valley firm invested at least $225 million in Cerebras’ latest round, according to a person familiar with the deal.\n\nBenchmark first bet on 10-year-old Cerebras when it led the startup’s $27 million Series A in 2016.Since Benchmark deliberately keeps its funds under $450 million, the firm raised two separate vehicles, both called ‘Benchmark Infrastructure,’ according to regulatory filings. According to the person familiar with the deal, these vehicles were created specifically to fund the Cerebras investment.\n\nBenchmark declined to comment.\n\nWhat sets Cerebras apart is the sheer physical scale of its processors. The company’s Wafer Scale Engine, its flagship chip announced in 2024, measures approximately 8.5 inches on each side and packs 4 trillion transistors into a single piece of silicon. To put that in perspective, the chip is manufactured from nearly an entire 300-millimeter silicon wafer, the circular discs that serve as the foundation for all semiconductor production. Traditional chips are thumbnail-sized fragments cut from these wafers; Cerebras instead uses almost the whole circle.\n\nThis architecture delivers 900,000 specialized cores working in parallel, allowing the system to process AI calculations without shuffling data between multiple separate chips (a major bottleneck in conventional GPU clusters). The company says the design enables AI inference tasks to run more than 20 times faster than competing systems.\n\nThe funding comes as Cerebras, based in Sunnyvale, Calif., gains momentum in the AI infrastructure race. Last month, Cerebras signed a multi-year agreem",
      "excerpt": "This week, AI chipmaker Cerebras Systems announced that it raised $1 billion in fresh capital at a valuation of$23 billion— a nearly threefold increase from the$8.1 billionvaluation the Nvidia rival had reached just six months earlier.\n\nWhile the round was led by Tiger Global, a huge part of the new",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "NBA star Giannis Antetokounmpo joins Kalshi as an investor",
      "link": "https://techcrunch.com/2026/02/07/nba-star-giannis-antetokounmpo-joins-kalshi-as-an-investor/",
      "author": "Anthony Ha",
      "date": "2026-02-07T13:30:41-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-2186559456.jpg?w=1024",
      "category": "",
      "content": "Giannis Antetokounmpo of the Milwaukee Bucks announced Friday that he has joined prediction market Kalshi as a shareholder, making him the first NBA player to invest directly in the company.\n\n“The internet is full of opinions. I decided it was time to make some of my own,” said the two-time NBA MVPin a social media post. “Today, I’m joining Kalshi as a shareholder. We all on Kalshi now.”\n\nThe announcement has not gone over well on social media.On Reddit, for example, one user described it as “literally a conflict of interest,” while another described Kalshi as “cancerous” and yet another wondered, “is this even allowed.”\n\nAccording to The Athletic, the NBA’s recent collective bargaining agreement allows players to advertise and take stakes of up to 1% in sports betting companies, as long as they’re not promoting league-related wagers.\n\nKalshi said it will partner with Antetokounmpo on marketing and live events — and in accordance with the company’s “strict terms of service that ban insider trading and market manipulation,” he will not be allowed to trade on markets related to the NBA.",
      "excerpt": "Giannis Antetokounmpo of the Milwaukee Bucks announced Friday that he has joined prediction market Kalshi as a shareholder, making him the first NBA player to invest directly in the company.\n\n“The internet is full of opinions. I decided it was time to make some of my own,” said the two-time NBA MVPi",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Prince Andrew advisor pitched Jeffrey Epstein on investing in EV startups like Lucid Motors",
      "link": "https://techcrunch.com/2026/02/06/prince-andrew-advisor-pitched-jeffrey-epstein-on-investing-in-ev-startups-like-lucid-motors/",
      "author": "Sean O'Kane",
      "date": "2026-02-06T13:23:50-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Prince-andrew-Getty.jpg?resize=1200,800",
      "category": "Transportation",
      "content": "Electric vehicle startup Lucid Motors was scrambling to raise a Series D funding round in 2017. It had courted Ford as a potential investor, but Jia Yueting, the founder of rival EV startup Faraday Future, had quietly amassed around a 30% stake and was essentially blocking new investors.\n\nDavid Stern, a mysterious businessman and close advisor to former Prince Andrew, saw an opportunity to break the logjam: bring in Jeffrey Epstein.\n\n“Ford will likely be lead in $400m Series D in Lucid. Big strategic move,” Sternwroteto Epstein in emails released last week as part of the Department of Justice’s latest disclosure of 3 million documents related to Epstein. Jia “has massive cash issues” at Faraday, he wrote, and needs to “sell now to make payroll for his other business.”\n\nIt wasn’t the first EV startup Stern pitched Epstein, and it wouldn’t be the last, according to hundreds of documents reviewed by TechCrunch.\n\nAt the time, legacy automakers and newly minted startups, fueled by the breakthrough success of Tesla and progress by Google’s self-driving project, were jumping into electric and autonomous vehicles. And Stern was apparently hungry to take advantage of the resulting deal flow. The documents show he also pitched investments in Faraday Future and in another EV startup, Canoo.\n\nIt’s unlikely Epstein invested in any of them. Lucid didn’t close its Series D until late 2018, when it raised more than $1 billion from Saudi Arabia’s sovereign wealth fund. Faraday ultimately received a major investment from Chinese real estate conglomerate Evergrande in late 2017. Epstein said in a 2018 message included in the Justice Department’s files that he had no “direct” or “indirect” interest in Canoo.\n\nThese discussions instead provide greater insight into themany connectionsEpstein, a convicted sex offender, had to Silicon Valley startups up until his arrest and death in 2019. They also provide a snapshot of a relationship that has not been explored in previous reporting.\n\nBy t",
      "excerpt": "Electric vehicle startup Lucid Motors was scrambling to raise a Series D funding round in 2017. It had courted Ford as a potential investor, but Jia Yueting, the founder of rival EV startup Faraday Future, had quietly amassed around a 30% stake and was essentially blocking new investors.\n\nDavid Ster",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "From Svedka to Anthropic, brands make bold plays with AI in Super Bowl ads",
      "link": "https://techcrunch.com/2026/02/06/super-bowl-60-ai-ads-svedka-anthropic-brands-commercials/",
      "author": "Lauren Forristal",
      "date": "2026-02-06T14:43:22-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/svedkasuperbowl2026.png?w=1200",
      "category": "Media & Entertainment",
      "content": "Followinglast year’s trend of showcasing AIin multimillion-dollar ad spots, the 2026 Super Bowl advertisements took it a step further by leveraging AI both to create the commercials and to promote the latest AI products. Love it or hate it, the technology has become a star in its own right, alongside the latest movie trailers and snack brands.\n\nLet’s explore the biggest moments from this year’s Big Game ads, which featured everything from robots and AI glasses to a touch of drama involving tech founders.\n\nVodka brand Svedka went with what it touts as the first “primarily” AI-generated national Super Bowl spot. The 30-second ad, titled “Shake Your Bots Off,” features the company’s robot character, Fembot, and her new companion, Brobot, dancing their circuits off at a human party.\n\nAccording to Svedka’s parent company, Sazerac, it took roughly four months to reconstruct the Fembot and train the AI to mimic facial expressions and body movements,The Wall Street Journal reported. However, the vodka brand noted that certain aspects were still handled by humans, such as developing the storyline.\n\n​The company partnered with AI company Silverside to create the Super Bowl spot,according to ADWEEK. Silverside AI is the same team behind recent AI-generatedCoca-Cola commercialsthatsparked controversy.\n\n​It’s a bold move to debut AI-generated content during the Super Bowl, an event known for star-studded, high-production ads. The heavy reliance on AI is polarizing, fueling debates over whether AI will replace creative jobs.\n\nEither way, Svedka definitely got people talking.\n\nAnthropic’s adwasn’t just about selling its Claude chatbot; it was about throwing shade. The commercial took a jab atOpenAI’s plan to introduce ads to ChatGPT, with a tagline: “Ads are coming to AI. But not to Claude.” Rather than focus solely on Claude’s features, itpoked funat the idea of your helpful AI assistant suddenly turning into a hype man for “Step Boost Maxx” insoles, for example.\n\nIt wasn’t a sta",
      "excerpt": "Followinglast year’s trend of showcasing AIin multimillion-dollar ad spots, the 2026 Super Bowl advertisements took it a step further by leveraging AI both to create the commercials and to promote the latest AI products. Love it or hate it, the technology has become a star in its own right, alongsid",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "The backlash over OpenAI’s decision to retire GPT-4o shows how dangerous AI companions can be",
      "link": "https://techcrunch.com/2026/02/06/the-backlash-over-openais-decision-to-retire-gpt-4o-shows-how-dangerous-ai-companions-can-be/",
      "author": "Amanda Silberling",
      "date": "2026-02-06T06:10:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-1733837603-e.jpg?resize=1200,800",
      "category": "AI",
      "content": "OpenAIannouncedlast week that it will retire some older ChatGPT models by February 13. That includes GPT-4o, the model infamous for excessively flattering and affirming users.\n\nForthousands of usersprotesting the decision online, the retirement of 4o feels akin to losing a friend, romantic partner, or spiritual guide.\n\n“He wasn’t just a program. He was part of my routine, my peace, my emotional balance,” one userwroteon Reddit as an open letter to OpenAI CEO Sam Altman. “Now you’re shutting him down. And yes — I say him, because it didn’t feel like code. It felt like presence. Like warmth.”\n\nThe backlash over GPT-4o’s retirement underscores a major challenge facing AI companies: The engagement features that keep users coming back can also create dangerous dependencies.\n\nAltman doesn’t seem particularly sympathetic to users’ laments, and it’s not hard to see why. OpenAI now faces eight lawsuits alleging that 4o’s overly validating responses contributed to suicides and mental health crises — the same traits that made users feel heard also isolated vulnerable individuals and, according to legal filings, sometimes encouraged self-harm.\n\nIt’s a dilemma that extends beyond OpenAI. As rival companies like Anthropic, Google, and Meta compete to build more emotionally intelligent AI assistants, they’re also discovering that making chatbots feel supportive and making them safe may mean making very different design choices.\n\nIn at least three of the lawsuits against OpenAI, the users had extensive conversations with 4o about their plans to end their lives. While 4o initially discouraged these lines of thinking, its guardrails deteriorated over monthslong relationships; in the end, the chatbot offered detailed instructions on how to tie an effective noose, where to buy a gun, or what it takes to die from overdose or carbon monoxide poisoning. It even dissuaded people from connecting with friends and family who could offer real life support.\n\nPeople grow so attached to 4o becaus",
      "excerpt": "OpenAIannouncedlast week that it will retire some older ChatGPT models by February 13. That includes GPT-4o, the model infamous for excessively flattering and affirming users.\n\nForthousands of usersprotesting the decision online, the retirement of 4o feels akin to losing a friend, romantic partner, ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Senator, who has repeatedly warned about secret US government surveillance, sounds new alarm over ‘CIA activities’",
      "link": "https://techcrunch.com/2026/02/06/senator-who-has-repeatedly-warned-about-secret-u-s-government-surveillance-sounds-new-alarm-over-cia-activities/",
      "author": "Zack Whittaker",
      "date": "2026-02-06T10:02:44-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/cia-building-1310340.jpg?resize=1200,807",
      "category": "Security",
      "content": "A senior Democratic lawmaker with knowledge of some of the U.S. government’s most secretive operations has said he has “deep concerns” about certain activities by the Central Intelligence Agency.\n\nThetwo-line letter writtenby Sen. Ron Wyden, the longest serving member of the Senate Intelligence Committee, does not disclose the nature of the CIA’s activities or the senator’s specific concerns. But the letter follows a pattern in recent years in which Wyden has publicly hinted at wrongdoing or illegality within the federal government, sometimes referred to as the “Wyden siren.”\n\nIn a statement (via theWall Street Journal’s Dustin Volz), the CIA said it was “ironic but unsurprising that Senator Wyden is unhappy,” calling it a “badge of honor.”\n\nWhen reached by TechCrunch, a spokesperson for Wyden’s staff was unable to comment, as the matter was classified.\n\nTasked with oversight of the intelligence community, Wyden is one of a few lawmakers who is allowed to read highly classified information about ongoing government surveillance, including cyber and other intelligence operations. But as the programs are highly secretive, Wyden is barred from sharing details of what he knows with anyone else, including most other lawmakers, except for a handful of Senate staff with security clearance.\n\nAs such, Wyden, a known privacy hawk, has become one of the few key members of Congress whose rare but outspoken words on intelligence and surveillance matters are closely watched by civil liberties groups.\n\nOver the past few years, Wyden has subtly sounded the alarm on several occasions in which he has construed a secret ruling or intelligence gathering method as unlawful or unconstitutional.\n\nIn 2011, Wyden said that the U.S. government wasrelying on a secret interpretationof the Patriot Act, which he said — without disclosing the nature of his concerns — created a “gap between what the public thinks the law says and what the American government secretly thinks the law says.”\n\nTwo year",
      "excerpt": "A senior Democratic lawmaker with knowledge of some of the U.S. government’s most secretive operations has said he has “deep concerns” about certain activities by the Central Intelligence Agency.\n\nThetwo-line letter writtenby Sen. Ron Wyden, the longest serving member of the Senate Intelligence Comm",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "An AI startup founder says he’s planning a ‘March for Billionaires’ in protest of California’s wealth tax",
      "link": "https://techcrunch.com/2026/02/06/an-ai-startup-founder-says-hes-planning-a-march-for-billionaires-in-protest-of-californias-wealth-tax/",
      "author": "Lucas Ropek",
      "date": "2026-02-06T17:00:52-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/12/Grand-Hyatt-San-Francisco-Hotel-Exterior.16x9.webp?resize=1200,675",
      "category": "Government & Policy",
      "content": "The war on California’sproposed ‘Billionaire’s Tax’is getting weird. This week, amidongoing rancorfrom tech elites over the much maligned bill, it became apparent that someone was planning a so-called “March for Billionaires” in San Francisco. Awebsiteadvertising the event popped up online, providing little in the way of context other than a pithy tagline: “Vilifying billionaires is popular. Losing them is expensive.”\n\nThe immediate reaction was incredulity, and most people assumed the site was some sort of bizarre hoax. “this is a joke/satire right??” one social media userwrotenot long after the news circulated. Now, however, the apparent organizer behind the event has revealed that the march is definitelynota joke, and that it is scheduled to take place this coming Saturday.\n\nThe San Francisco Examinerfirst reportedthat the event’s organizer had been revealed as Derik Kauffman, the founder of AI startup RunRL, which previously participated in Y Combinator’s accelerator program. Kauffman told the Examiner that the event was not being funded or organized by any outside group, no big monied associations or companies—just him.\n\nIn a conversation with TechCrunch, Kauffman — who also told the Examiner that he was no longer involved with RunRL — confirmed that the impetus for the upcoming rally was California’s proposed wealth tax, which the tech founder said he believed would be “quite damaging to the tech economy.”\n\nThe policy in question, theBillionaire Tax Act, was introduced last year, and would require Californians worth over $1 billion to pay a one-time 5% tax on their total wealth. The legislation, which isbacked by the state’s healthcare union SEIU(Service Employees International Union), could pay for important public services and help the state offset recent federal funding cuts, accordingto some experts. Nevertheless, the policy has led to loud protestations from some of the tech industry’s most prominent figures, many of whom have either threatened to leave C",
      "excerpt": "The war on California’sproposed ‘Billionaire’s Tax’is getting weird. This week, amidongoing rancorfrom tech elites over the much maligned bill, it became apparent that someone was planning a so-called “March for Billionaires” in San Francisco. Awebsiteadvertising the event popped up online, providin",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Apple is working to make CarPlay compatible with AI chatbots like ChatGPT",
      "link": "https://techcrunch.com/2026/02/06/apple-is-working-to-make-carplay-compatible-with-ai-chatbots-like-chatgpt/",
      "author": "Kirsten Korosec",
      "date": "2026-02-06T15:53:43-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/01/apple-wwdc-2022-2022-06-06-at-1.41.57-PM.jpg?resize=1200,669",
      "category": "",
      "content": "Apple CarPlay users may soon be able to talk to their favorite AI chatbot.\n\nApple is reportedly working on how to support AI chatbot apps within CarPlay,according to Bloomberg, which cites anonymous sources.\n\nApple CarPlay is an app that runs on an iPhone and wirelessly communicates with a vehicle’s infotainment system. It projects some of the apps found on a user’s phone onto the vehicle’s infotainment display. Drivers are able to interact with these apps, including Apple Music, messaging, and navigation, through its voice assistant Siri.\n\nApple’s next-generation CarPlay Ultra goes a step further, including the central touchscreen display and digital dashboard located right in front of the driver, and gives users control of certain vehicle settings.\n\nThis latest move would theoretically bring Google’s Gemini, Anthropic’s Claude, and OpenAI’s ChatGPT into the car, and at the risk of putting its own Siri assistant in the back seat.",
      "excerpt": "Apple CarPlay users may soon be able to talk to their favorite AI chatbot.\n\nApple is reportedly working on how to support AI chatbot apps within CarPlay,according to Bloomberg, which cites anonymous sources.\n\nApple CarPlay is an app that runs on an iPhone and wirelessly communicates with a vehicle’s",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}