{
  "last_updated": "2026-02-07T04:40:10.887442+00:00",
  "articles": [
    {
      "title": "Prince Andrew advisor pitched Jeffrey Epstein on investing in EV startups like Lucid Motors",
      "link": "https://techcrunch.com/2026/02/06/prince-andrew-advisor-pitched-jeffrey-epstein-on-investing-in-ev-startups-like-lucid-motors/",
      "author": "Sean O'Kane",
      "date": "2026-02-06T13:23:50-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Prince-andrew-Getty.jpg?resize=1200,800",
      "category": "Transportation",
      "content": "Electric vehicle startup Lucid Motors was scrambling to raise a Series D funding round in 2017. It had courted Ford as a potential investor, but Jia Yueting, the founder of rival EV startup Faraday Future, had quietly amassed around a 30% stake and was essentially blocking new investors.\n\nDavid Stern, a mysterious businessman and close advisor to former Prince Andrew, saw an opportunity to break the logjam: bring in Jeffrey Epstein.\n\n“Ford will likely be lead in $400m Series D in Lucid. Big strategic move,” Sternwroteto Epstein in emails released last week as part of the Department of Justice’s latest disclosure of 3 million documents related to Epstein. Jia “has massive cash issues” at Faraday, he wrote, and needs to “sell now to make payroll for his other business.”\n\nIt wasn’t the first EV startup Stern pitched Epstein, and it wouldn’t be the last, according to hundreds of documents reviewed by TechCrunch.\n\nAt the time, legacy automakers and newly minted startups, fueled by the breakthrough success of Tesla and progress by Google’s self-driving project, were jumping into electric and autonomous vehicles. And Stern was apparently hungry to take advantage of the resulting deal flow. The documents show he also pitched investments in Faraday Future and in another EV startup, Canoo.\n\nIt’s unlikely Epstein invested in any of them. Lucid didn’t close its Series D until late 2018, when it raised more than $1 billion from Saudi Arabia’s sovereign wealth fund. Faraday ultimately received a major investment from Chinese real estate conglomerate Evergrande in late 2017. Epstein said in a 2018 message included in the Justice Department’s files that he had no “direct” or “indirect” interest in Canoo.\n\nThese discussions instead provide greater insight into themany connectionsEpstein, a convicted sex offender, had to Silicon Valley startups up until his arrest and death in 2019. They also provide a snapshot of a relationship that has not been explored in previous reporting.\n\nBy t",
      "excerpt": "Electric vehicle startup Lucid Motors was scrambling to raise a Series D funding round in 2017. It had courted Ford as a potential investor, but Jia Yueting, the founder of rival EV startup Faraday Future, had quietly amassed around a 30% stake and was essentially blocking new investors.\n\nDavid Ster",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "From Svedka to Anthropic, brands make bold plays with AI in Super Bowl ads",
      "link": "https://techcrunch.com/2026/02/06/super-bowl-60-ai-ads-svedka-anthropic-brands-commercials/",
      "author": "Lauren Forristal",
      "date": "2026-02-06T14:43:22-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/svedkasuperbowl2026.png?w=1200",
      "category": "Media & Entertainment",
      "content": "Followinglast year’s trend of showcasing AIin multimillion-dollar ad spots, the 2026 Super Bowl advertisements took it a step further by leveraging AI both to create the commercials and to promote the latest AI products. Love it or hate it, the technology has become a star in its own right, alongside the latest movie trailers and snack brands.\n\nLet’s explore the biggest moments from this year’s Big Game ads, which featured everything from robots and AI glasses to a touch of drama involving tech founders.\n\nVodka brand Svedka went with what it touts as the first “primarily” AI-generated national Super Bowl spot. The 30-second ad, titled “Shake Your Bots Off,” features the company’s robot character, Fembot, and her new companion, Brobot, dancing their circuits off at a human party.\n\nAccording to Svedka’s parent company, Sazerac, it took roughly four months to reconstruct the Fembot and train the AI to mimic facial expressions and body movements,The Wall Street Journal reported. However, the vodka brand noted that certain aspects were still handled by humans, such as developing the storyline.\n\n​The company partnered with AI company Silverside to create the Super Bowl spot,according to ADWEEK. Silverside AI is the same team behind recent AI-generatedCoca-Cola commercialsthatsparked controversy.\n\n​It’s a bold move to debut AI-generated content during the Super Bowl, an event known for star-studded, high-production ads. The heavy reliance on AI is polarizing, fueling debates over whether AI will replace creative jobs.\n\nEither way, Svedka definitely got people talking.\n\nAnthropic’s adwasn’t just about selling its Claude chatbot; it was about throwing shade. The commercial took a jab atOpenAI’s plan to introduce ads to ChatGPT, with a tagline: “Ads are coming to AI. But not to Claude.” Rather than focus solely on Claude’s features, itpoked funat the idea of your helpful AI assistant suddenly turning into a hype man for “Step Boost Maxx” insoles, for example.\n\nIt wasn’t a sta",
      "excerpt": "Followinglast year’s trend of showcasing AIin multimillion-dollar ad spots, the 2026 Super Bowl advertisements took it a step further by leveraging AI both to create the commercials and to promote the latest AI products. Love it or hate it, the technology has become a star in its own right, alongsid",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "The backlash over OpenAI’s decision to retire GPT-4o shows how dangerous AI companions can be",
      "link": "https://techcrunch.com/2026/02/06/the-backlash-over-openais-decision-to-retire-gpt-4o-shows-how-dangerous-ai-companions-can-be/",
      "author": "Amanda Silberling",
      "date": "2026-02-06T06:10:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-1733837603-e.jpg?resize=1200,800",
      "category": "AI",
      "content": "OpenAIannouncedlast week that it will retire some older ChatGPT models by February 13. That includes GPT-4o, the model infamous for excessively flattering and affirming users.\n\nForthousands of usersprotesting the decision online, the retirement of 4o feels akin to losing a friend, romantic partner, or spiritual guide.\n\n“He wasn’t just a program. He was part of my routine, my peace, my emotional balance,” one userwroteon Reddit as an open letter to OpenAI CEO Sam Altman. “Now you’re shutting him down. And yes — I say him, because it didn’t feel like code. It felt like presence. Like warmth.”\n\nThe backlash over GPT-4o’s retirement underscores a major challenge facing AI companies: The engagement features that keep users coming back can also create dangerous dependencies.\n\nAltman doesn’t seem particularly sympathetic to users’ laments, and it’s not hard to see why. OpenAI now faces eight lawsuits alleging that 4o’s overly validating responses contributed to suicides and mental health crises — the same traits that made users feel heard also isolated vulnerable individuals and, according to legal filings, sometimes encouraged self-harm.\n\nIt’s a dilemma that extends beyond OpenAI. As rival companies like Anthropic, Google, and Meta compete to build more emotionally intelligent AI assistants, they’re also discovering that making chatbots feel supportive and making them safe may mean making very different design choices.\n\nIn at least three of the lawsuits against OpenAI, the users had extensive conversations with 4o about their plans to end their lives. While 4o initially discouraged these lines of thinking, its guardrails deteriorated over monthslong relationships; in the end, the chatbot offered detailed instructions on how to tie an effective noose, where to buy a gun, or what it takes to die from overdose or carbon monoxide poisoning. It even dissuaded people from connecting with friends and family who could offer real life support.\n\nPeople grow so attached to 4o becaus",
      "excerpt": "OpenAIannouncedlast week that it will retire some older ChatGPT models by February 13. That includes GPT-4o, the model infamous for excessively flattering and affirming users.\n\nForthousands of usersprotesting the decision online, the retirement of 4o feels akin to losing a friend, romantic partner, ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Maybe AI agents can be lawyers after all",
      "link": "https://techcrunch.com/2026/02/06/maybe-ai-agents-can-be-lawyers-after-all/",
      "author": "Russell Brandom",
      "date": "2026-02-06T12:26:23-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/10/54888410931_c37fed4674_k.jpg?resize=1200,800",
      "category": "",
      "content": "Last month, I wrote aboutMercor’s new benchmarkmeasuring AI agents’ capabilities on professional tasks like law and corporate analysis. At the time, the scores were pretty dismal, with every major lab scoring under 25%, so we concluded lawyers were safe from AI displacement, at least for now.\n\nBut AI capabilities can change a lot in a couple of weeks.\n\nThis week’s release of Anthropic’s Opus 4.6shook upthe leaderboards, with Anthropic’s new model scoring just shy of 30% in one-shot trials, and an average of 45% when given a few more cracks at the problem. Notably, the release included a bunch of new agentic features, including “agent swarms,” which may have helped with this kind of multistep problem-solving.\n\nRegardless, the score is a huge jump from the previous state-of-the-art, and a sign that progress on foundation models isn’t slowing down. Mercor CEO Brendan Foody, who was particularly impressed, said, “jumping from 18.4% to 29.8% in a few months is insane.”\n\nThirty percent is still a long way from 100%, so it’s not like lawyers need to be worried about getting replaced by machines next week. But they should be a lot less confident than they were last month!",
      "excerpt": "Last month, I wrote aboutMercor’s new benchmarkmeasuring AI agents’ capabilities on professional tasks like law and corporate analysis. At the time, the scores were pretty dismal, with every major lab scoring under 25%, so we concluded lawyers were safe from AI displacement, at least for now.\n\nBut A",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "How AI is helping solve the labor issue in treating rare diseases",
      "link": "https://techcrunch.com/2026/02/06/how-ai-is-helping-with-the-labor-issue-in-treating-rare-diseases/",
      "author": "Rebecca Bellan",
      "date": "2026-02-06T06:29:15-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/55077920584_2991f8c4d1_k.jpg?resize=1200,752",
      "category": "Biotech & Health",
      "content": "Modern biotech has the tools to edit genes and design drugs, yet thousands of rare diseases remain untreated. According to executives from Insilico Medicine and GenEditBio, the missing ingredient for years has been finding enough smart people to continue the work. AI, they say, is becoming the force multiplier that lets scientists take on problems the industry has long left untouched.\n\nSpeaking this week at Web Summit Qatar, Insilico’s president, Alex Aliper, laid out his company’s aim to develop “pharmaceutical superintelligence.” Insilico recently launched its“MMAI Gym” that aims to train generalist large language models, like ChatGPT and Gemini, to perform as well as specialist models.\n\nThe goal is to build a multimodal, multitask model that, Aliper says, can solve many different drug discovery tasks simultaneously with superhuman accuracy.\n\n“We really need this technology to increase the productivity of our pharmaceutical industry and tackle the shortage of labor and talent in that space, because there are still thousands of diseases without a cure, without any treatment options, and there are thousands of rare disorders which are neglected,” Aliper said in an interview with TechCrunch. “So we need more intelligent systems to tackle that problem.”\n\nInsilico’s platform ingests biological, chemical, and clinical data to generate hypotheses about disease targets and candidate molecules. By automating steps that once required legions of chemists and biologists, Insilico says it can sift through vast design spaces, nominate high-quality therapeutic candidates, and even repurpose existing drugs — all at dramatically reduced cost and time.\n\nFor example, the company recently used its AI models to identify whether existing drugs could be repurposed to treat ALS, a rare neurological disorder.\n\nBut the labor bottleneck doesn’t end at drug discovery. Even when AI can identify promising targets or therapies, many diseases require interventions at a more fundamental biologica",
      "excerpt": "Modern biotech has the tools to edit genes and design drugs, yet thousands of rare diseases remain untreated. According to executives from Insilico Medicine and GenEditBio, the missing ingredient for years has been finding enough smart people to continue the work. AI, they say, is becoming the force",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "EU says TikTok must disable ‘addictive’ features like infinite scroll, fix its recommendation engine",
      "link": "https://techcrunch.com/2026/02/06/eu-tiktok-disable-addictive-features-infinite-scroll-recommendation-engine/",
      "author": "Ram Iyer",
      "date": "2026-02-06T08:24:05-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2023/03/GettyImages-1232166951-e1678278081143.jpg?resize=1200,675",
      "category": "Social",
      "content": "The European Commission on Friday accused TikTok of purposefully designing its app to be “addictive,” calling out features such as infinite scroll, autoplay, and push notifications, as well as its recommendation engine.\n\nIn preliminary findings from an investigation that sought to determine TikTok’s compliance with the European Union’s far-reachingDigital Services Act, the Commission said the short video platform did not “adequately assess” how its design decisions could harm the well-being of its users, particularly minors and vulnerable adults.\n\nThe EU’s executive arm said the company disregarded “important indicators of compulsive use of the app” like the time users spend at night and how often users open it.\n\n“By constantly ‘rewarding’ users with new content, certain design features of TikTok fuel the urge to keep scrolling and shift the brain of users into ‘autopilot mode.’ Scientific research shows that this may lead to compulsive behaviour and reduce users’ self-control,” the Commission wrote in astatement.\n\nThe Commission said TikTok must change the “basic design” of its user interface by disabling features like infinite scroll, implementing screen time breaks, and changing its recommendation system.\n\nTikTok denied the allegations.\n\n“The Commission’s preliminary findings present a categorically false and entirely meritless depiction of our platform, and we will take whatever steps are necessary to challenge these findings through every means available to us,” a TikTok spokesperson said in an emailed statement.\n\nTikTok does offer screen-time management tools and parental controls, but the European Commission said those tools don’t do enough to reduce the risks of its addictive design. “The time management tools do not seem to be effective in enabling users to reduce and control their use of TikTok because they are easy to dismiss and introduce limited friction. Similarly, parental controls may not be effective because they require additional time and skills f",
      "excerpt": "The European Commission on Friday accused TikTok of purposefully designing its app to be “addictive,” calling out features such as infinite scroll, autoplay, and push notifications, as well as its recommendation engine.\n\nIn preliminary findings from an investigation that sought to determine TikTok’s",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "The Kindle Scribe Colorsoft is a pricey but pretty e-ink color tablet with AI features",
      "link": "https://techcrunch.com/2026/02/06/kindle-scribe-colorsoft-review-e-ink-color-tablet/",
      "author": "Sarah Perez",
      "date": "2026-02-06T08:37:07-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/download-2.jpeg?resize=1200,675",
      "category": "Hardware",
      "content": "If you primarily want a tablet device to mark up, highlight, and annotate your e-books and documents, and perhaps sometimes scribble some notes, Amazon’s newKindle Scribe Colorsoftcould be worth the hefty investment. For everyone else, it’s probably going to be hard to justify the cost of the 11-inch, $630+ e-ink tablet with a writeable color display.\n\nHowever, if you were already leaning toward the 11-inch $549.99Kindle Scribe— which also has a paper-like display but no color — you may as well throw in the extra cash at that point and get theColorsoft version, which starts at $629.99.\n\nAt these price points, both the Scribe and Scribe Colorsoft are what we’d dub unnecessary luxuries for most, especially compared with the more affordable traditional Kindle ($110) or Kindle Paperwhite ($160).\n\nAnnounced in December, theFig color versionjust began shipping on January 28, 2026, and is available for $679.99 with 64GB.\n\nClearly, Amazon hopes to carve out a niche in the tablet market with these upgraded Kindle devices, which compete more with e-ink tablets likereMarkablethan with other Kindles. But high-end e-ink readers with pens aren’t going to deliver Amazon a large audience. Meanwhile, nearly everyone can potentially justify the cost of an iPad because of its numerous capabilities, including streaming video, drawing, writing, using productivity tools, and the thousands of supported native apps and games.\n\nThe Scribe Colorsoft, meanwhile, is designed to cater to a very specific type of e-book reader or worker. This type of device could be a good fit for students and researchers, as well as anyone else who regularly needs to mark up files or documents.\n\nSomeone particularly interested in making to-do lists or keeping a personal journal might also appreciate the device, but it would have to get daily use to justify this price.\n\nThe device is easy enough to use, with a Home screen design similar to other Kindles, offering quick access to your notes and library, and even s",
      "excerpt": "If you primarily want a tablet device to mark up, highlight, and annotate your e-books and documents, and perhaps sometimes scribble some notes, Amazon’s newKindle Scribe Colorsoftcould be worth the hefty investment. For everyone else, it’s probably going to be hard to justify the cost of the 11-inc",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Senator, who has repeatedly warned about secret US government surveillance, sounds new alarm over ‘CIA activities’",
      "link": "https://techcrunch.com/2026/02/06/senator-who-has-repeatedly-warned-about-secret-u-s-government-surveillance-sounds-new-alarm-over-cia-activities/",
      "author": "Zack Whittaker",
      "date": "2026-02-06T10:02:44-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/cia-building-1310340.jpg?resize=1200,807",
      "category": "Security",
      "content": "A senior Democratic lawmaker with knowledge of some of the U.S. government’s most secretive operations has said he has “deep concerns” about certain activities by the Central Intelligence Agency.\n\nThetwo-line letter writtenby Sen. Ron Wyden, the longest serving member of the Senate Intelligence Committee, does not disclose the nature of the CIA’s activities or the senator’s specific concerns. But the letter follows a pattern in recent years in which Wyden has publicly hinted at wrongdoing or illegality within the federal government, sometimes referred to as the “Wyden siren.”\n\nIn a statement (via theWall Street Journal’s Dustin Volz), the CIA said it was “ironic but unsurprising that Senator Wyden is unhappy,” calling it a “badge of honor.”\n\nWhen reached by TechCrunch, a spokesperson for Wyden’s staff was unable to comment, as the matter was classified.\n\nTasked with oversight of the intelligence community, Wyden is one of a few lawmakers who is allowed to read highly classified information about ongoing government surveillance, including cyber and other intelligence operations. But as the programs are highly secretive, Wyden is barred from sharing details of what he knows with anyone else, including most other lawmakers, except for a handful of Senate staff with security clearance.\n\nAs such, Wyden, a known privacy hawk, has become one of the few key members of Congress whose rare but outspoken words on intelligence and surveillance matters are closely watched by civil liberties groups.\n\nOver the past few years, Wyden has subtly sounded the alarm on several occasions in which he has construed a secret ruling or intelligence gathering method as unlawful or unconstitutional.\n\nIn 2011, Wyden said that the U.S. government wasrelying on a secret interpretationof the Patriot Act, which he said — without disclosing the nature of his concerns — created a “gap between what the public thinks the law says and what the American government secretly thinks the law says.”\n\nTwo year",
      "excerpt": "A senior Democratic lawmaker with knowledge of some of the U.S. government’s most secretive operations has said he has “deep concerns” about certain activities by the Central Intelligence Agency.\n\nThetwo-line letter writtenby Sen. Ron Wyden, the longest serving member of the Senate Intelligence Comm",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "An AI startup founder says he’s planning a ‘March for Billionaires’ in protest of California’s wealth tax",
      "link": "https://techcrunch.com/2026/02/06/an-ai-startup-founder-says-hes-planning-a-march-for-billionaires-in-protest-of-californias-wealth-tax/",
      "author": "Lucas Ropek",
      "date": "2026-02-06T17:00:52-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/12/Grand-Hyatt-San-Francisco-Hotel-Exterior.16x9.webp?resize=1200,675",
      "category": "Government & Policy",
      "content": "The war on California’sproposed ‘Billionaire’s Tax’is getting weird. This week, amidongoing rancorfrom tech elites over the much maligned bill, it became apparent that someone was planning a so-called “March for Billionaires” in San Francisco. Awebsiteadvertising the event popped up online, providing little in the way of context other than a pithy tagline: “Vilifying billionaires is popular. Losing them is expensive.”\n\nThe immediate reaction was incredulity, and most people assumed the site was some sort of bizarre hoax. “this is a joke/satire right??” one social media userwrotenot long after the news circulated. Now, however, the apparent organizer behind the event has revealed that the march is definitelynota joke, and that it is scheduled to take place this coming Saturday.\n\nThe San Francisco Examinerfirst reportedthat the event’s organizer had been revealed as Derik Kaufmann, the founder of AI startup RunRL, which previously participated in Y Combinator’s accelerator program. Kaufmann told the Examiner that the event was not being funded or organized by any outside group, no big monied associations or companies—just him.\n\nIn a conversation with TechCrunch, Kaufmann — who also told the Examiner that he was no longer involved with RunRL — confirmed that the impetus for the upcoming rally was California’s proposed wealth tax, which the tech founder said he believed would be “quite damaging to the tech economy.”\n\nThe policy in question, theBillionaire Tax Act, was introduced last year, and would require Californians worth over $1 billion to pay a one-time 5% tax on their total wealth. The legislation, which isbacked by the state’s healthcare union SEIU(Service Employees International Union), could pay for important public services and help the state offset recent federal funding cuts, accordingto some experts. Nevertheless, the policy has led to loud protestations from some of the tech industry’s most prominent figures, many of whom have either threatened to leave C",
      "excerpt": "The war on California’sproposed ‘Billionaire’s Tax’is getting weird. This week, amidongoing rancorfrom tech elites over the much maligned bill, it became apparent that someone was planning a so-called “March for Billionaires” in San Francisco. Awebsiteadvertising the event popped up online, providin",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "‘Industry’ season 4 captures tech fraud better than any show on TV right now",
      "link": "https://techcrunch.com/2026/02/06/industry-season-4-captures-tech-fraud-better-than-any-show-on-tv-right-now/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-06T16:06:23-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/max-minghella-myha-la.jpg?resize=1200,800",
      "category": "Media & Entertainment",
      "content": "HBO’s hit financial thriller “Industry” has delivered one of its most compelling storylines yet this season: a hunt to expose a fraudulent fintech company called Tender.\n\nThe show follows Harper Stern, who’s leading her newly launched investment firm and looking for a company to short — essentially, betting that its stock will crash. After a journalist tips her off that something’s wrong with Tender, she sends her associates, Sweetpea and Kwabena, to Ghana to investigate.\n\nWhat they discover is damning. “Fake users drive fake revenue drives fake cash,” Sweetpea tells Harper. The entire company appears to be built on fabricated numbers. “The thing is nothing.”\n\nWhat’s fascinating about this season of “Industry” is how well it speaks to this moment. Tender starts as a payment processing platform for adult content. The show references the very real (and still controversial)Online Safety Billthat the UK introduced, which has led to age verification and other enhanced rules for consuming adult content online. Because of its affiliation with adult content, Tender finds itself at odds with the new government’s regulation and must pivot or die, as the saying goes.\n\nIts CFO-turned-leader, Whitney, wants the company to pivot into a bank and has a plan to make that happen, including making Tender’s CEO, Henry, the face of that transformation. Whitney is the embodiment of every tech baron cliche. Move fast, break things. Win at all costs. He’s lobbying politicians for a banking license and hunting for merger opportunities.\n\nHarper, meanwhile, is leading her newly launched firm after feeling undermined at her previous firm and being called a DEI plant by the man who hired her (a nod to the decline of DEI in the past few years). She has teamed up with new friends and old frenemies and is looking for blood — meaning a company on the precipice of crashing. To her, Tender is that company.\n\nThis puts her at odds with her friend Yasmin, who is married to Henry and is crafting communic",
      "excerpt": "HBO’s hit financial thriller “Industry” has delivered one of its most compelling storylines yet this season: a hunt to expose a fraudulent fintech company called Tender.\n\nThe show follows Harper Stern, who’s leading her newly launched investment firm and looking for a company to short — essentially,",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}