{
  "last_updated": "2026-02-10T17:13:52.967985+00:00",
  "articles": [
    {
      "title": "Former GitHub CEO raises record $60M dev tool seed round at $300M valuation",
      "link": "https://techcrunch.com/2026/02/10/former-github-ceo-raises-record-60m-dev-tool-seed-round-at-300m-valuation/",
      "author": "Julie Bort",
      "date": "2026-02-10T06:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Github-Thomas.jpeg?resize=1200,800",
      "category": "Startups",
      "content": "Former GitHub CEO Thomas Dohmke has raised the largest-ever seed round for a dev tool startup, according to its lead backer, Felicis. The startup,Entire, has raised $60 million at a $300 million valuation.\n\nEntire offers an open source tool to help developers better manage code written by AI agents.\n\nEntire’s tech has three components. One is a git-compatible database to unify the AI-produced code. Git is a distributed version control system popular with enterprises and used by open source sites like GitHub and GitLab.\n\nAnother component is what it calls “a universal semantic reasoning layer” intended to allow multiple AI agents to work together. The final piece is an AI-native user interface designed with agent-to-human collaboration in mind.\n\nThe first product Entire is releasing is an open-source tool it calls Checkpoints that automatically pairs every bit of software the agent submits for use in a software project with the context that created it, including prompts and transcripts. The idea is to allow the human developer to review, search, and perhaps even learn from why the AI did what it did.\n\nEntire hopes to help developers better deal with the large volumes of software created by AI coding agents. Popular open-source projects areparticularly overwhelmed these days with suggested code contributionsthat may or may not be AI slop — meaning poorly designed and possibly unusable code.\n\nDohmke explains in the press release: “We are living through an agent boom, and now massive volumes of code are being generated faster than any human could reasonably understand. The truth is, our manual system of software production — from issues, to git repositories, to pull requests, to deployment — was never designed for the era of AI in the first place.”\n\nDohmke was CEO of Microsoft’s GitHub for four years, leaving in August 2025 to found a startup, he said in aposton X at the time. During his time there, he oversaw the rise of the popular coding agent GitHub Copilot.\n\nOther ",
      "excerpt": "Former GitHub CEO Thomas Dohmke has raised the largest-ever seed round for a dev tool startup, according to its lead backer, Felicis. The startup,Entire, has raised $60 million at a $300 million valuation.\n\nEntire offers an open source tool to help developers better manage code written by AI agents.",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Google expands tools to let users remove sensitive data about themselves from Search",
      "link": "https://techcrunch.com/2026/02/10/google-remove-sensitive-personal-data-from-search/",
      "author": "Aisha Malik",
      "date": "2026-02-10T07:54:48-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2198713751.jpg?w=1024",
      "category": "Apps",
      "content": "As part of Safer Internet Day, Googleunveiled updatesto its “Results about you” and non-consensual explicit image removal tools.\n\nThe “Results about you” tool already allows users to remove Search results containing their phone number, email address, or home address, and it can now also be used to request the removal of results that include information such as a driver’s license, passport, or Social Security number, the company said in the update Tuesday.\n\nYou can access the tool in the Google app by tapping your Google account photo and selecting “Results about you.” If it’s your first time using the tool, you need to click “Get started” and then add the personal contact information you want to monitor. You’ll then be prompted to add your government ID numbers. Existing users can add their ID numbers and select which ones they want to monitor.\n\nOnce you’ve confirmed your details, Google will automatically monitor Search results and notify you if it finds results that contain your information. Google notes that removing this information from Search doesn’t remove it from the web entirely, but that doing so can help keep your information private.\n\nThe update is rolling out in the U.S. over the coming days. Google plans to bring it to additional regions in the future.\n\nThe tech giant also announced that it’s making it easier to request the removal of non-consensual explicit images on Search. Now, users just have to click on the three dots on an image, select “remove result,” then tap “It shows a sexual image of me.” Additionally, you no longer need to report images one by one, as you can now select and submit requests for multiple images from Search results using a single form. Users can also track the status of all requests in one place within the “Results about you” hub.\n\n“We understand that removing existing content is only part of the solution,” Google wrote in itsblog post. “For added protection, the new process allows you to opt-in to safeguards that will proact",
      "excerpt": "As part of Safer Internet Day, Googleunveiled updatesto its “Results about you” and non-consensual explicit image removal tools.\n\nThe “Results about you” tool already allows users to remove Search results containing their phone number, email address, or home address, and it can now also be used to r",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "The first signs of burnout are coming from the people who embrace AI the most",
      "link": "https://techcrunch.com/2026/02/09/the-first-signs-of-burnout-are-coming-from-the-people-who-embrace-ai-the-most/",
      "author": "Connie Loizos",
      "date": "2026-02-09T22:46:55-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2022/10/GettyImages-1158287360-e1665956231123.jpg?resize=1200,676",
      "category": "AI",
      "content": "The most seductive narrative in American work culture right now isn’t that AI will take your job. It’s that AI will save you from it.\n\nThat’s the version the industry has spent the last three years selling to millions of nervous people who are eager to buy it. Yes, some white-collar jobs will disappear. But for most other roles, the argument goes, AI is a force multiplier. You become a more capable, more indispensable lawyer, consultant, writer, coder, financial analyst — and so on. The tools work for you, you work less hard, everybody wins.\n\nBut anew studypublished in Harvard Business Review follows that premise to its actual conclusion, and what it finds there isn’t a productivity revolution. It finds companies are at risk of becoming burnout machines.\n\nAs part of what they describe as “in-progress research,” UC Berkeley researchers spent eight months inside a 200-person tech company watching what happened when workers genuinely embraced AI. What they found across more than 40 “in-depth” interviews was that nobody was pressured at this company. Nobody was told to hit new targets. People just started doing more because the tools made more feel doable. But because they could do these things, work began bleeding into lunch breaks and late evenings. The employees’ to-do lists expanded to fill every hour that AI freed up, and then kept going.\n\nAs one engineer told them, “You had thought that maybe, oh, because you could be more productive with AI, then you save some time, you can work less. But then really, you don’t work less. You just work the same amount or even more.”\n\nOver on the tech industry forum Hacker News, one commenter had thesame reaction, writing, “I feel this. Since my team has jumped into an AI everything working style, expectations have tripled, stress has tripled and actual productivity has only gone up by maybe 10%. It feels like leadership is putting immense pressure on everyone to prove their investment in AI is worth it and we all feel the pressur",
      "excerpt": "The most seductive narrative in American work culture right now isn’t that AI will take your job. It’s that AI will save you from it.\n\nThat’s the version the industry has spent the last three years selling to millions of nervous people who are eager to buy it. Yes, some white-collar jobs will disapp",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "India orders social media platforms to take down deepfakes faster",
      "link": "https://techcrunch.com/2026/02/10/india-orders-social-media-platforms-to-take-down-deepfakes-faster/",
      "author": "Jagmeet Singh",
      "date": "2026-02-10T06:51:13-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2023/12/india-parliament-getty.jpg?w=1200",
      "category": "Government & Policy",
      "content": "India has ordered social media platforms to step up policing of deepfakes and other AI-generated impersonations, while sharply shortening the time they have to comply with takedown orders. It’s a move that could reshape how global tech firms moderate content in one of the world’s largest and fastest growing market for internet services.\n\nThe changes,published(PDF) on Tuesday as amendments toIndia’s 2021 IT Rules, bring deepfakes under a formal regulatory framework, mandating the labelling and traceability of synthetic audio and visual content, while also slashing compliance timelines for platforms, including a three-hour deadline for official takedown orders and a two-hour window for certain urgent user complaints.\n\nIndia’s importance as a digital market amplifies the impact of the new rules. With over a billion internet users and a predominantly young population, the South Asian nation is a critical market for platforms like Meta and YouTube, making it likely that compliance measures adopted in India will influence global product and moderation practices.\n\nUnder the amended rules, social media platforms that allow users to upload or share audio-visual content must require disclosures on whether material is synthetically generated, deploy tools to verify those claims, and ensure that deepfakes are clearly labelled and embedded with traceable provenance data.\n\nCertain categories of synthetic content — including deceptive impersonations, non-consensual intimate imagery, and material linked to serious crimes — are barred outright in the rules. Non-compliance, particularly in cases flagged by authorities or users, can expose companies to greater legal liability by jeopardising their safe-harbour protections under Indian law.\n\nThe rules lean heavily on automated systems to meet those obligations. Platforms are expected to deploy technical tools to verify user disclosures, identify, and label deepfakes, and prevent the creation or sharing of prohibited synthetic content i",
      "excerpt": "India has ordered social media platforms to step up policing of deepfakes and other AI-generated impersonations, while sharply shortening the time they have to comply with takedown orders. It’s a move that could reshape how global tech firms moderate content in one of the world’s largest and fastest",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Trump EPA reportedly seeks to revoke landmark air pollution rule",
      "link": "https://techcrunch.com/2026/02/10/trump-epa-reportedly-seeks-to-revoke-landmark-air-pollution-rule/",
      "author": "Tim De Chant",
      "date": "2026-02-10T07:47:13-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/03/GettyImages-2201520437.jpeg?resize=1200,800",
      "category": "Climate",
      "content": "The Trump administration’s EPA administrator, Lee Zeldin, is looking to repeal the 2009 “endangerment finding” that found greenhouse gases pose a threat to human health and welfare, possibly as early as this week, the Wall Street Journalreports.\n\nThe EPA finding had set the legal basis for federal regulation of six greenhouse gases, including carbon dioxide and methane, and it has been unsuccessfully challenged since it was first instituted.\n\nThe move is almost certain to attract a number of lawsuits, and it could be years before the matter is settled. The EPA’s move will only affect tailpipe emissions for cars and trucks, though it’s expected that the Trump administration will use it to unwind regulations in other sectors like power plants and industrial facilities.\n\nLegacy automakers, whichpushed Trump to weaken fuel efficiency rules, notably did not push for the EPA to repeal the endangerment finding. Tesla went further,asking the EPA to maintain the finding, saying it was “based on a robust factual and scientific record.”\n\nIf the Trump administration is successful, the U.S. will be increasingly out of step with regulations in other advanced economies. Companies that do business across borders will need to develop different approaches for each market, increasing costs.\n\nAutomakers, in particular, are facing a future in which they’ll be forced to serve bifurcated markets, at least in the near term. Regulatory whiplash in the U.S. coupled with increasing competition from China has cost automakerstens of billions of dollars.\n\nAmerican automakers’ reliance on fossil fuel-powered trucks, in particular, has painted the domestic industry into a corner, providing addictive profits that distract from future-proofing their fleets in advance ofseemingly inevitablecompetition from Chinese marques.\n\nThe Trump administration told the WSJ it expects the policy change to save more than $1 trillion, though it didn’t provide any evidence to back that figure up.\n\nClimate change is ",
      "excerpt": "The Trump administration’s EPA administrator, Lee Zeldin, is looking to repeal the 2009 “endangerment finding” that found greenhouse gases pose a threat to human health and welfare, possibly as early as this week, the Wall Street Journalreports.\n\nThe EPA finding had set the legal basis for federal r",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Databricks CEO says SaaS isn’t dead, but AI will soon make it irrelevant",
      "link": "https://techcrunch.com/2026/02/09/databricks-ceo-says-saas-isnt-dead-but-ai-will-soon-make-it-irrelevant/",
      "author": "Julie Bort",
      "date": "2026-02-09T13:14:50-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/01/Databricks_042221_Ali_Ghodsi_236.jpg?resize=1200,800",
      "category": "Startups",
      "content": "On Monday, Databricksannouncedit reached a $5.4 billion revenue run rate, growing 65% year-over-year, of which more than $1.4 billion was from its AI products.\n\nCo-founder and CEO Ali Ghodsi wanted to share these growth numbers because there’s so much talk about how AI is going to kill the SaaS business, he told TechCrunch.\n\n“Everybody’s like, ‘Oh, it’s SaaS. What’s going to happen to all these companies? What’s AI going to do with all these companies?’ For us, it’s just increasing the usage,” he said.\n\nTo be sure, he also wants to distance Databricks from the SaaS label, given that private markets value it as an AI company. Databricks on Monday also officially closed on its massive, previously announced $5 billion raiseat a $134 billion valuation, and nabbed a $2 billion loan facility as well.\n\nBut the company is straddling both worlds. Databricks is still best known as a cloud data warehouse provider. A data warehouse is where enterprises store massive amounts of data to analyze for business insights.\n\nGhodsi called out, in particular, one AI product that’s driving usage of its data warehouse: its LLM user interface named Genie.\n\nGenie is an example of how a SaaS business canreplace its user interfacewith natural language. For instance, he uses it to ask why warehouse usage and revenue spike on particular days.\n\nJust a few years ago, such a request required writing queries in a specific technical language, or having a special report programmed. Today, any product with an LLM interface can be used by anyone, Ghodsi noted. Genie is one reason for the company’s usage growth numbers, he said.\n\nThe threat of AI to SaaS isn’t, asone AI VC jokingly tweeted, that enterprises will rip out their SaaS “systems of record” to replace them with vibe-coded homegrown versions. Systems of record store critical business data, whether it’s on sales, customer support, or finance.\n\n“Why would you move your system of record? You know, it’s hard to move it,” Ghodsi said.\n\nThe model make",
      "excerpt": "On Monday, Databricksannouncedit reached a $5.4 billion revenue run rate, growing 65% year-over-year, of which more than $1.4 billion was from its AI products.\n\nCo-founder and CEO Ali Ghodsi wanted to share these growth numbers because there’s so much talk about how AI is going to kill the SaaS busi",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Tem raises $75M to remake electricity markets using AI",
      "link": "https://techcrunch.com/2026/02/09/tem-raises-75m-to-remake-electricity-markets-using-ai/",
      "author": "Tim De Chant",
      "date": "2026-02-09T19:01:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2014/04/shutterstock_103274513.jpg?resize=1200,800",
      "category": "Climate",
      "content": "As AIdata centers drive up electricity prices, London-based startupTemthinks AI might be able to help solve it, too.\n\nTem has built an energy transaction engine that relies on AI to cut prices relative to other energy traders. The company has signed up more than 2,600 business customers throughout the U.K. on the promise that buying energy from its utility division can save them up to 30% on their energy bills.\n\nThe startup recently closed an oversubscribed $75 million Series B led by Lightspeed Venture Partners with participation from AlbionVC, Allianz, Atomico, Hitachi Ventures, Revent, Schroders Capital, and Voyager Ventures, TechCrunch has exclusively learned.\n\nThe round values Tem at more than $300 million, a source familiar with the deal told TechCrunch. The startup plans to use the funding to help expand to Australia and the U.S., starting with Texas.\n\n“We’re in a nice position where we kind of have control over our own profitability. So I could have chosen not to raise at all and had a lovely, nice bootstrap business in some ways,” Joe McDonald, co-founder and CEO of Tem, told TechCrunch. “Well, we’re not that kind of business. We know what we want to achieve as someone who wants to go public over the years.”\n\nTem is a classic marketplace play, matching electricity generators with consumers. The company intentionally started by focusing almost exclusively on renewable energy generators and small businesses to fill both sides of the ledger. “The more decentralized and the more distributed, the better it is for the algorithms,” McDonald said. “But this works all the way up to enterprise.”\n\nThe company’s customers include fast-fashion retailer Boohoo Group, soft drink company Fever-Tree, and Newcastle United FC.\n\nCurrently, Tem is running what amounts to two different businesses. One, called Rosso, is the transaction engine that matches suppliers with buyers. Here, machine learning algorithms and LLMs help predict supply and demand.\n\nThe goal with Rosso, McDona",
      "excerpt": "As AIdata centers drive up electricity prices, London-based startupTemthinks AI might be able to help solve it, too.\n\nTem has built an energy transaction engine that relies on AI to cut prices relative to other energy traders. The company has signed up more than 2,600 business customers throughout t",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Former Tesla product manager wants to make luxury goods impossible to fake, starting with a chip",
      "link": "https://techcrunch.com/2026/02/10/former-tesla-product-manager-wants-to-make-luxury-goods-impossible-to-fake-starting-with-a-chip/",
      "author": "Ivan Mehta",
      "date": "2026-02-10T08:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Veritas-feat-photo.jpg?w=1200",
      "category": "Commerce",
      "content": "The fake goods crisis cuts two ways. Luxury brands lose more than$30 billion a yearto counterfeits, while buyers in the booming$210 billion second-hand markethave no reliable way to verify that what they’re purchasing is genuine.Veritaswants to solve both problems with a solution that combines custom hardware and software.\n\nThe startup claims that it has developed a “hack-proof” chip that can’t be bypassed by devices like Flipper Zero, a widely available hacking tool that can be used to tamper with wireless systems. These chips are linked with digital certificates to verify the authenticity of the products.\n\nVertitas founder Luci Holland has experienced life as both a technologist and an artist. She has worked in different artistic mediums, including mixed media painting and metal sculpture. She has also worked at Tesla as a technical product manager and has held several business development, community growth, and product management roles at tech companies and venture funds.\n\nHolland noted that traditionally, luxury goods makers use various symbols or physical marks to authenticate their products. However, with the growing demand for these goods, counterfeiters have learned to create convincing copies of these marks along with high-quality fake certificates. These goods are often called “superfakes.”\n\nHolland mentioned that she spoke with maisons — established luxury fashion houses — that said that some of their locations had to stop authenticating goods because fakes were becoming too convincing to reliably detect. She said that drawing on her experience in both the tech and art worlds, she wanted to solve the problem.\n\n“For me, as someone who has a background in being a designer and then also has experience in tech, I saw this problem and thought about the different ways we could solve it. I think what’s truly innovative is we’ve used and combined elements from both hardware and software to create this solution that helps protect brands in this way to convey the i",
      "excerpt": "The fake goods crisis cuts two ways. Luxury brands lose more than$30 billion a yearto counterfeits, while buyers in the booming$210 billion second-hand markethave no reliable way to verify that what they’re purchasing is genuine.Veritaswants to solve both problems with a solution that combines custo",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Singapore says China-backed hackers targeted its four largest phone companies",
      "link": "https://techcrunch.com/2026/02/10/singapore-china-backed-hackers-targeted-largest-phone-companies-salt-typhoon/",
      "author": "Zack Whittaker",
      "date": "2026-02-10T08:19:39-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/singapore-2152482714.jpg?resize=1200,800",
      "category": "Security",
      "content": "Singapore’s government has blamed a known Chinese cyber-espionage group for targeting four of its top telecommunication companies as part of a months-long attack.\n\nIna statement Monday, Singapore confirmed for the first time that the hackers, known as UNC3886, targeted the country’s telecoms infrastructure, including its largest companies: Singtel, StarHub, M1, and Simba Telecom. The government previously said that it was responding to an unspecified attack on its critical infrastructure.\n\nWhile the intruders were able to breach and access some systems, they did not disrupt services or access personal information, said K. Shanmugam, the country’s coordinating minister for national security.\n\nGoogle-owned cybersecurity unit Mandiantpreviously linkedUNC3886 as an espionage group likely working on behalf of China. The Chinese government is known to conduct regular cyber-espionage operations, as well asprepositioning for disruptive attacksahead of an anticipated invasion of Taiwan, which Beijing has routinely denied,per Reuters.\n\nUNC3886 is known for exploitingzero-day vulnerabilitiesin routers, firewalls, and virtualized environments, where cybersecurity tools that are designed to spot malware cannot typically reach. The hacking group hastargeted the defense, technology, and telecom industriesacross the U.S. and the Asia-Pacific region.\n\nIn the case of the attack on Singapore’s top telcos, Shanmugam said the hackers used advanced tools, like rootkits, to gain long-term persistence to their systems.\n\n“In one instance, they were able to gain limited access to critical systems but did not get far enough to have been able to disrupt services,” according to the government’s statement.\n\nPer Reuters, the telcos said in a joint statement that the companies regularly face distributed denial-of-service and other malware attacks. “We adopt defence-in-depth mechanisms to protect our networks and conduct prompt remediation when any issues are detected,” the statement read.\n\nThe att",
      "excerpt": "Singapore’s government has blamed a known Chinese cyber-espionage group for targeting four of its top telecommunication companies as part of a months-long attack.\n\nIna statement Monday, Singapore confirmed for the first time that the hackers, known as UNC3886, targeted the country’s telecoms infrast",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Vega raises $120M Series B to rethink how enterprises detect cyber threats",
      "link": "https://techcrunch.com/2026/02/10/vega-raises-120m-series-b-to-rethink-how-enterprises-detect-cyber-threats/",
      "author": "Rebecca Bellan",
      "date": "2026-02-10T08:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Shay-Sandler-Eli-Rosen.-Credit-Ohad-Kab.jpeg?resize=1200,802",
      "category": "AI",
      "content": "Modern enterprises generate enormous amounts of security data, but legacy tools like Splunk still require companies to store all of it in one place before they can detect threats — a slow and costly process that’s increasingly breaking down in cloud environments where volumes are exploding and data lives everywhere.\n\nAI cybersecurity startupVega Securitywants to flip that approach by running security where the data already lives, implementing in cloud services, data lakes, and existing storage systems. And the two-year-old firm just raised a $120 million Series B round to scale that vision, TechCrunch has exclusively learned.\n\nLed by Accel with participation from Cyberstarts, Redpoint, and CRV, the new round nearly doubles Vega’s valuation to $700 million, and brings its total funding to $185 million, money the startup will use to further develop its AI-native security operations suite, beef up its go-to-market team, and expand globally.\n\nShay Sandler, co-founder and CEO of Vega, told TechCrunch that the current operating model of the SIEM (security information and event management) — the dominant technology in this domain for the last two decades — is not only “crazy expensive,” but is also increasingly causing AI-native security operations to fail. In complex cloud environments, he says, the current model often increases exposure to threat actors.\n\n“Vega has defined a new operating model that enables organizations to leverage the full potential of their enterprise data to achieve incident response readiness, without all the complexity, the cost, the drama,” Sandler told TechCrunch. “We want to simply enable them to reach AI-native detection response capability anywhere the data is, at scale.”\n\nLike so many cybersecurity founders, Sandler did his time in the Israeli military’s cybersecurity unit before being one of the founding employees behind Granulate, whichIntel acquired for $650 millionin 2022. After a year at Intel, Sandler decided to “do it big time in the c",
      "excerpt": "Modern enterprises generate enormous amounts of security data, but legacy tools like Splunk still require companies to store all of it in one place before they can detect threats — a slow and costly process that’s increasingly breaking down in cloud environments where volumes are exploding and data ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}