{
  "last_updated": "2026-02-15T21:28:17.119302+00:00",
  "articles": [
    {
      "title": "The enterprise AI land grab is on. Glean is building the layer beneath the interface.",
      "link": "https://techcrunch.com/2026/02/15/the-enterprise-ai-land-grab-is-on-glean-is-building-the-layer-beneath-the-interface/",
      "author": "Rebecca Bellan",
      "date": "2026-02-15T09:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2259183688.jpg?w=1024",
      "category": "AI",
      "content": "The battle for enterprise AI is heating up. Microsoft is bundling Copilot into Office. Google is pushing Gemini into Workspace. OpenAI and Anthropic are selling directly to enterprises. Every SaaS vendor now ships an AI assistant.\n\nIn the scramble for the interface, Glean is betting on something less visible: becoming the intelligence layer beneath it.\n\nSeven years ago, Glean set out to be the Google for enterprise — an AI-powered search tool designed to index and search across a company’s SaaS tool library, from Slack to Jira, Google Drive to Salesforce. Today, the company’s strategy has shifted from building a better enterprise chatbot to becoming the connective tissue between models and enterprise systems.\n\n“The layer we built initially – a good search product – required us to deeply understand people and how they work and what their preferences are,” Jain told TechCrunch on last week’sepisode of Equity, which we recorded at Web Summit Qatar. “All of that is now becoming foundational in terms of building high quality agents.”\n\nHe says that while large language models are powerful, they’re also generic.\n\n“The AI models themselves don’t really understand anything about your business,” Jain said. “They don’t know who the different people are, they don’t know what kind of work you do, what kind of products you build. So you have to connect the reasoning and generative power of the models with the context inside your company.”\n\nGlean’s pitch is that it already maps that context and can sit between the model and the enterprise data.\n\nThe Glean Assistant is often the entry point for customers — a familiar chat interface powered by a mix of leading proprietary (ie, ChatGPT, Gemini, Claude) and open-source models, grounded in the company’s internal data. But what keeps customers, Jain argues, is everything underneath it.\n\nFirst is model access. Rather than forcing companies to commit to a single LLM provider, Glean acts as the abstraction layer, allowing enterprises to sw",
      "excerpt": "The battle for enterprise AI is heating up. Microsoft is bundling Copilot into Office. Google is pushing Gemini into Workspace. OpenAI and Anthropic are selling directly to enterprises. Every SaaS vendor now ships an AI assistant.\n\nIn the scramble for the interface, Glean is betting on something les",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "The great computer science exodus (and where students are going instead)",
      "link": "https://techcrunch.com/2026/02/15/the-great-computer-science-exodus-and-where-students-are-going-instead/",
      "author": "Connie Loizos",
      "date": "2026-02-15T00:40:27-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2019/10/GettyImages-827810708.jpg?resize=1200,801",
      "category": "AI",
      "content": "Something strange happened at University of California campuses this fall. For the first time since the dot-com crash, computer science enrollment dropped. System-wide, it fell6% last yearafter declining 3% in 2024, according to reporting this past week by the San Francisco Chronicle. Even as overall college enrollmentclimbed 2% nationally— according to January data from the National Student Clearinghouse Research Center — students are bailing on traditional CS degrees.\n\nThe one exception is UC San Diego  — the only UC campus that added adedicated AI major this fall.\n\nThis all might look like a temporary blip tied to news about fewer CS gradsfinding work out of college. But it’s more likely an indicator of the future, one that China is much more enthusiastically embracing. As MIT Technology Reviewreported last July, Chinese universities have leaned hard into AI literacy, treating AI not as a threat but instead as essential infrastructure. Nearly 60% of Chinese students and faculty now use AI tools multiple times daily, and schools like Zhejiang University have made AI coursework mandatory, while top institutions like Tsinghua have created entirely new interdisciplinary AI colleges. In China, fluency with AI isn’t optional anymore; it’s table stakes.\n\nU.S. universities are scrambling to catch up. Over the last two years, dozens have launched AI-specific programs. MIT’s “AI and decision-making” major is now thesecond-largest majoron campus, says the school. Asreportedby the New York Times in December, the University of South Florida enrolled more than3,000 studentsin anew AI and cybersecurity collegeduring its fall semester. The University at Buffalolast summerlaunched a new “AI and Society” department that offers seven new, specialized undergraduate degree programs, and it receivedmore than 200 applicantsbefore it swung open its doors.\n\nThe transition hasn’t been smooth everywhere. When I spoke withUNC Chapel Hill Chancellor Lee Robertsin October, he described a spec",
      "excerpt": "Something strange happened at University of California campuses this fall. For the first time since the dot-com crash, computer science enrollment dropped. System-wide, it fell6% last yearafter declining 3% in 2024, according to reporting this past week by the San Francisco Chronicle. Even as overal",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "How to get into a16z’s super-competitive Speedrun startup accelerator program",
      "link": "https://techcrunch.com/2026/02/15/how-to-get-into-a16zs-super-competitive-speedrun-startup-accelerator-program/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-15T07:53:53-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/speedrun.webp?resize=1200,800",
      "category": "Venture",
      "content": "Without a doubt, one of the hottest new startup accelerators in tech right now is Andreessen Horowitz’s Speedrun program. Launched in 2023, the accelerator has an acceptance rate of less than 1%. In aJanuary blog post,the program said that over 19,000 startups pitched and fewer than 0.4% were accepted into the latest cohort.\n\nThe program used to focus on gaming startups, then expanded into entertainment and media, and is now a “horizontal program,” Joshua Lu, the program’s general manager and a partner at a16z, told TechCrunch. Today, founders of any type of startup can apply, and the program runs for about 12 weeks in San Francisco. It once had a program in Los Angeles, but Lu said the focus will be on SF from now on.\n\nThere are two cohorts a year, and around 50 to 70 startups are accepted into each. The programinvests up to $1 millioninto each company, though the downside is that it’s a bit pricey. It typically invests $500,000 up front in exchange for 10% of the startup’s company via a SAFE note, and another $500,000 if the next round is raised within 18 months, at whatever terms agreed to by the other investors.\n\nIn comparison, Y Combinatortypically takes a fixed 7%of the company for $125,000, with another $375,000 “invested on an uncapped MFN safe.”\n\nSpeedrun said its program is more “equity expensive” because of what it offers founders. It provides them with access to a16z’s advisory and business networks that assist with tasks like go-to-market, brand development, media strategy, and talent sourcing. Plus it offers the startups perks like $5 million in credits to vendors such as AWS, OpenAI, Nvidia, and Deel.\n\nGiven the high interest, and low acceptance rate, TechCrunch spoke to Lu for some tips on how startups can best stand out. The latest cohort began in January and will end in April with a Demo Day. Applications forthe next cohort open in April,though it looks at off-season applications year-round, Lu said.\n\nSpeedrun focuses on early-stage startups. Becau",
      "excerpt": "Without a doubt, one of the hottest new startup accelerators in tech right now is Andreessen Horowitz’s Speedrun program. Launched in 2023, the accelerator has an acceptance rate of less than 1%. In aJanuary blog post,the program said that over 19,000 startups pitched and fewer than 0.4% were accept",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Hollywood isn’t happy about the new Seedance 2.0 video generator",
      "link": "https://techcrunch.com/2026/02/15/hollywood-isnt-happy-about-the-new-seedance-2-0-video-generator/",
      "author": "Anthony Ha",
      "date": "2026-02-15T07:41:16-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2020/08/GettyImages-1263876301.jpeg?w=1024",
      "category": "Media & Entertainment",
      "content": "Hollywood organizations are pushing back against a new AI video model calledSeedance 2.0, which they say has quickly become a tool for “blatant” copyright infringement.\n\nByteDance, the Chinese company that recently finalized a deal to sell TikTok’s U.S. operations (itretains a stake in the new joint venture), launched Seedance 2.0 earlier this week.According to the Wall Street Journal, the updated model is currently available to Chinese users of ByteDance’s Jianying app, and the company says it will soon be available to global users of its CapCut app.\n\nSimilar to tools such asOpenAI’s Sora, Seedance allows users to create videos (currently limited to 15 seconds in length) by just entering a text prompt. And like Sora, Seedance quickly drew criticism for an apparent lack of guardrails around the ability to create videos using the likeness of real people, as well as studios’ intellectual property.\n\nAfter one X userposted a brief videoshowing Tom Cruise fighting Brad Pitt, which they said was created by “a 2 line prompt in seedance 2,” “Deadpool” screenwriterRhett Reese responded, “I hate to say it. It’s likely over for us.”\n\nThe Motion Picture Association soon issueda statementfrom CEO Charles Rivkin demanding that ByteDance “immediately cease its infringing activity.”\n\n“In a single day, the Chinese AI service Seedance 2.0 has engaged in unauthorized use of U.S. copyrighted works on a massive scale,” Rivkin said. “By launching a service that operates without meaningful safeguards against infringement, ByteDance is disregarding well-established copyright law that protects the rights of creators and underpins millions of American jobs.”\n\nThe Human Artistry Campaign — an initiative backed by Hollywood unions and trade groups —condemned Seedance 2.0as “an attack one very creator around the world,” whilethe actors’ union SAG-AFTRA saidit “stands with the studios in condemning the blatant infringement enabled by Bytedance’s new AI video model Seedance 2.0.”\n\nSeedance videos",
      "excerpt": "Hollywood organizations are pushing back against a new AI video model calledSeedance 2.0, which they say has quickly become a tool for “blatant” copyright infringement.\n\nByteDance, the Chinese company that recently finalized a deal to sell TikTok’s U.S. operations (itretains a stake in the new joint",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "In a changed VC landscape, this exec is doubling down on overlooked founders",
      "link": "https://techcrunch.com/2026/02/14/stacy-brown-philpot-cherryrock-capital-vc/",
      "author": "Connie Loizos",
      "date": "2026-02-14T12:37:42-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Screenshot-2026-02-12-at-8.42.46-AM.png?resize=1200,1008",
      "category": "Venture",
      "content": "Much of Silicon Valley has spent years chasing mega-rounds and buzzy AI deals. Meanwhile, Stacy Brown-Philpot is running Cherryrock Capital like a throwback to venture capital’s earlier days, writing smaller Series A and B checks to founders that larger firms routinely overlook.\n\nThe former TaskRabbit CEO and decade-long Google veteran launched Cherryrock a year ago after seeing what she calls a persistent gap: access to capital for “underinvested entrepreneurs” building software companies at the crucial growth stage.\n\n“When I left TaskRabbit, I took some time off to figure out what was next and saw this gap in the market, which was access to capital, particularly for underinvested entrepreneurs,” Brown-Philpot told TechCrunch. She’d originally come to the Bay Area 25 years ago, planning to become a VC and even writing her Stanford Business School essay about it. After spending a decade at Google and leading TaskRabbit to a successful exit to IKEA, she’s finally back to that original plan.\n\nShe circled back to it for a reason. Before launching Cherryrock, Brown-Philpot was a member of the investment committee for the SoftBank Opportunity Fund, a $100 million vehicle started in 2020 to back underserved entrepreneurs. That experience proved there was no shortage of overlooked founders.\n\nSoftBank itself sold the Opportunity Fund to its leadership team in late 2023, divesting from the diversity-focused initiative. Brown-Philpot, meanwhile, doubled down, and launched her own fund. By the time she closed Cherryrock’s debut fund in February 2025, she already had more than 2,000 companies in her pipeline.\n\nCherryrock is targeting 12 to 15 investments from its first fund — a concentrated approach and stark contrast to the seed funds that make dozens of bets, or massive funds that write nine-figure checks. Brown-Philpot’s also taking her time; a year after announcing the fund, she and her team, including cofounder Saydeah Howard, who spent nine years at the venture firm IVP, ",
      "excerpt": "Much of Silicon Valley has spent years chasing mega-rounds and buzzy AI deals. Meanwhile, Stacy Brown-Philpot is running Cherryrock Capital like a throwback to venture capital’s earlier days, writing smaller Series A and B checks to founders that larger firms routinely overlook.\n\nThe former TaskRabb",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Designer Kate Barton teams up with IBM and Fiducia AI for a NYFW presentation",
      "link": "https://techcrunch.com/2026/02/14/designer-kate-barton-teams-up-with-ibm-and-fiducia-ai-for-a-nyfw-presentation/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-14T09:43:46-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Kate-Barton-IBM.jpg?resize=1200,675",
      "category": "Media & Entertainment",
      "content": "On Saturday, designerKate Bartonwill unveil her latest collection at New York Fashion Week — with a twist, of course. Barton teamed up withFiducia AIto create a multilingual AI agent (built with IBM watsonx on IBM Cloud) to help guests identify pieces of the collection and try them on virtually.\n\nTechCrunch caught up with Barton and Ganesh Harinath, the founder and CEO of Fiducia AI, before the show to learn more about the presentation.\n\nFor one, Barton said technology is baked into how she thinks. She likes playing with the real and the unreal, and found the idea of using AI-like set design, “a portal into the collection’s world, rather than ‘AI for AI’s sake,” she said.\n\n“Today, tech is a tool for expanding the world around the clothes, how they are presented, and how people enter the story, and how we create that moment when your eyes do a double-take,” she told TechCrunch, adding that the goal for this collection was to create a sense of curiosity.\n\nHarinath said his company used IBM watsonx, IBM Cloud, and IBM Cloud Object Storage to help pull off Barton’s presentation. It was a production-grade activation with a Visual AI lens (built with IBM watsonx) that detects pieces from Barton’s new collection. It can answer questions in any language via voice and text and offers photorealistic virtual reality try-ons.\n\n“The hardest work wasn’t model tuning; it was orchestration,” he told TechCrunch. This isn’t the first time Barton has put a technological spin on her fashion — last season, sheexperimented with AI models, also in collaboration with Fiduicia AI.\n\nAt fashion week, there was some chatter about whether brands — and, if so, which ones — would be using technology and artificial intelligence. Barton thinks many brands are using AI, though quietly, mainly in operations. “Maybe fewer are using it publicly because of the potential reputational risk,” she said.\n\nIt rhymes a bit with the early days when many big fashion names were nervous about starting websites. “T",
      "excerpt": "On Saturday, designerKate Bartonwill unveil her latest collection at New York Fashion Week — with a twist, of course. Barton teamed up withFiducia AIto create a multilingual AI agent (built with IBM watsonx on IBM Cloud) to help guests identify pieces of the collection and try them on virtually.\n\nTe",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "India doubles down on state-backed venture capital, approving $1.1B fund",
      "link": "https://techcrunch.com/2026/02/14/india-doubles-down-on-state-backed-venture-capital-approving-1-1b-fund/",
      "author": "Jagmeet Singh",
      "date": "2026-02-14T08:23:22-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/09/india-flag.jpg?resize=1200,800",
      "category": "Startups",
      "content": "India has cleared a $1.1 billion state-backed venture capital program that will channel government money into startups through private investors, doubling down on its effort to finance high-risk areas such as artificial intelligence, advanced manufacturing and other sectors broadly referred to by the industry as deep tech.\n\nFirst outlinedin the January 2025 budget speech by India’s finance minister, the ₹100 billion fund won cabinet approval this week (more than a year after the speech), allowing the government to move ahead with deployment. A previous iteration of the program, launched in 2016, committed ₹100 billion to 145 private funds that have invested more than ₹255 billion (about $2.8 billion) in over 1,370 startups, according to official datareleasedon Saturday.\n\nThe program is structured as a fund of funds, a common venture capital model in which governments back startups indirectly by committing capital to private investment firms. It is designed to take a more targeted approach than its 2016 counterpart, focusing on deep-tech and manufacturing startups that typically require longer time horizons and larger amounts of capital, while also backing early-stage founders, expanding investment beyond major cities and strengthening India’s domestic venture capital industry, particularly smaller funds, per the Indian government.\n\nAt the announcement on Saturday, IT minister Ashwini Vaishnaw highlighted the scale of India’s startup expansion, pointing to figures shown on a presentation slide indicating the number of startups has grown from fewer than 500 in 2016 to more than 200,000 today. The slide said more than 49,000 startups were registered in 2025 alone, the highest annual total on record.\n\nThe cabinet approval follows recent changes to India’s startup rules aimed ateasing pressure on deep-tech companies. New Delhi doubled the period for which such firms are classified as startups to 20 years and raised the revenue threshold for startup-specific tax, grant an",
      "excerpt": "India has cleared a $1.1 billion state-backed venture capital program that will channel government money into startups through private investors, doubling down on its effort to finance high-risk areas such as artificial intelligence, advanced manufacturing and other sectors broadly referred to by th",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "A Stanford grad student created an algorithm to help his classmates find love; now, Date Drop is the basis of his new startup",
      "link": "https://techcrunch.com/2026/02/13/a-stanford-grad-student-created-an-algorithm-to-help-his-classmates-find-love-now-date-drop-is-the-basis-of-his-new-startup/",
      "author": "Amanda Silberling",
      "date": "2026-02-13T08:24:53-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/headshot.jpg?resize=898,1200",
      "category": "Apps",
      "content": "As Valentine’s Day approaches at Stanford, some students may be gearing up for first dates — not with people they met on Tinder or Hinge, but with matches from a service calledDate Drop, designed by Stanford graduate student Henry Weng. Date Drop pairs students with potential dates once per week based on their responses to a questionnaire.\n\nA Stanford whiz kid is trying to disrupt an established industry from his Palo Alto dorm?Stop meifyou’ve heard thisonebefore! But young adults are deeplydisillusionedwith the frustrating, demoralizingstate of online dating. Why not try something different?\n\nOver 5,000 students at Stanford have given Date Drop a try since its launch in the fall. It has also rolled out at 10 more schools, including MIT, Princeton, and the University of Pennsylvania, and Weng says he wants to roll out Date Drop more broadly in some cities this summer.\n\n“Our matches convert to actual dates at about 10x the rate of Tinder,” Weng told TechCrunch. “Instead of swiping, we get to know each person deeply and send them one compatible match per week.”\n\nAt first, Weng didn’t intend to turn Date Drop into the foundation of a startup. Then, a close friend of his met their partner via Date Drop. “That was when I got the sense that this was less of a project,” he said.\n\nNow, Weng thinks of Date Drop as just the first service from his startup, TheRelationship Company, which is a public benefit corporation — a type of company legally required to consider social impact alongside profits.\n\n“This started as something I just wanted to exist on campus, and it became a company because people kept on asking for it in their schools and I needed resources to do that,” he said.\n\nAlready, Weng has raised “a few million” from some angel investors, including Zynga founder and early Facebook backer Mark Pincus, who has taught business courses at Stanford (including to Weng). Andy Chen, a former partner at Coatue, and Elad Gil, an early backer of Airbnb, Stripe, and Pinterest, al",
      "excerpt": "As Valentine’s Day approaches at Stanford, some students may be gearing up for first dates — not with people they met on Tinder or Hinge, but with matches from a service calledDate Drop, designed by Stanford graduate student Henry Weng. Date Drop pairs students with potential dates once per week bas",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Anthropic and the Pentagon are reportedly arguing over Claude usage",
      "link": "https://techcrunch.com/2026/02/15/anthropic-and-the-pentagon-are-reportedly-arguing-over-claude-usage/",
      "author": "Anthony Ha",
      "date": "2026-02-15T13:11:28-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2023/07/GettyImages-1252170580.jpg?resize=1200,800",
      "category": "",
      "content": "The Pentagon is pushing AI companies to allow the U.S. military to use their technology for “all lawful purposes,” but Anthropic is pushing back, according toa new report in Axios.\n\nThe government is reportedly making the same demand to OpenAI, Google, and xAI. An anonymous Trump administration official told Axios that one of those companies has agreed, while the other two have supposedly shown some flexibility.\n\nAnthropic, meanwhile, has reportedly been the most resistant. In response, the Pentagon is apparently threatening to pull the plug on its $200 million contract with the AI company.\n\nIn January,the Wall Street Journal reportedthat there was significant disagreement between Anthropic and Defense Department officials over how its Claude models could be used. The WSJ subsequently said thatClaude was used in the U.S. military’s operationto capture then-Venezuelan President Nicolás Maduro.\n\nAnthropic did not immediately respond to TechCrunch’s request for comment.\n\nA company spokesperson told Axios that the company has “not discussed the use of Claude for specific operations with the Department of War” but is instead “focused on a specific set of Usage Policy questions — namely, our hard limits around fully autonomous weapons and mass domestic surveillance.”",
      "excerpt": "The Pentagon is pushing AI companies to allow the U.S. military to use their technology for “all lawful purposes,” but Anthropic is pushing back, according toa new report in Axios.\n\nThe government is reportedly making the same demand to OpenAI, Google, and xAI. An anonymous Trump administration offi",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "India has 100M weekly active ChatGPT users, Sam Altman says",
      "link": "https://techcrunch.com/2026/02/15/india-has-100m-weekly-active-chatgpt-users-sam-altman-says/",
      "author": "Jagmeet Singh",
      "date": "2026-02-15T10:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/04/chatgpt-india.jpg?resize=1200,800",
      "category": "AI",
      "content": "India has 100 million weekly active ChatGPT users, making the country one of OpenAI’s largest markets globally, CEO Sam Altman said ahead of a government-hosted AI summit.\n\nOn Sunday, Altman outlined ChatGPT’s growing adoption in India in an articlepublishedin the Indian English daily Times of India, as OpenAI prepares to formally participate in the five-day India AI Impact Summit in New Delhi, beginning Monday. Altman isattending the eventalongside senior executives from several of the world’s leading AI companies.\n\nThe growth comes as OpenAI,like other leading AI firms, looks to India’s young population and its more than a billion internet users to fuel global expansion. The ChatGPT makeropened a New Delhi officein August 2025 after months of groundwork in the country, and has adjusted its approach for India’s price-sensitive market, including rolling out asub-$5 ChatGPT Go tierthat waslater made free for a yearfor Indian users.\n\nIn the article, Altman said India is ChatGPT’s second-largest user base after the United States, highlighting the South Asian nation’s growing weight in OpenAI’s global strategy. The disclosure comes as ChatGPT’s overall usage has surged worldwide, with the platformreaching 800 million weekly active usersas of October 2025 and reported to beapproaching 900 million.\n\nAltman also highlighted the role of students in driving adoption, saying India has the largest number of student users of ChatGPT globally.\n\nIndian students have become a key growth segment for leading AI companies more broadly, as rivals race to embed their tools in classrooms and learning workflows. Google has similarly targeted the market, offering Indian students afree one-year subscription to its AI Pro planin September 2025. Separately, India accounts for thehighest global usage of Gemini for learning, Chris Phillips, Google’s vice president and general manager for education, said last month.\n\n“With its focus on access, practical Al literacy, and the infrastructure that ",
      "excerpt": "India has 100 million weekly active ChatGPT users, making the country one of OpenAI’s largest markets globally, CEO Sam Altman said ahead of a government-hosted AI summit.\n\nOn Sunday, Altman outlined ChatGPT’s growing adoption in India in an articlepublishedin the Indian English daily Times of India",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}