{
  "last_updated": "2026-02-13T07:51:34.891115+00:00",
  "articles": [
    {
      "title": "Musk needed a new vision for SpaceX and xAI. He landed on Moonbase Alpha.",
      "link": "https://techcrunch.com/2026/02/12/musk-needed-a-new-vision-for-spacex-and-xai-he-landed-on-moonbase-alpha/",
      "author": "Tim Fernholz",
      "date": "2026-02-12T14:10:55-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Screenshot-2026-02-12-at-10.37.51-AM.png?resize=1200,666",
      "category": "AI",
      "content": "“Join xAI if the idea of mass drivers on the Moon appeals to you,” CEO Elon Muskproclaimedyesterday following a restructuring that saw a stream of former executivesexit the AI lab.\n\nThis is an interesting recruitment strategy after the company’s merger with Musk’s rocket maker, SpaceX, and the combined company’s anticipated IPO. You might think that xAI employees ought to be fascinated with achieving AGI, using deep learning models to disrupt traditional software companies, or simply bad wordplay like “Macrohard.” But instead, Elon is going to the moon.\n\nAfter outlining plans tobuild AI data centers in orbit, the primary synergy between the two companies, Musk took the idea further. “What if you want to go beyond a mere terawatt per year?” Musk asked. “To do that, you have to go to the moon…I really want to see a mass driver on the moon that is shooting AI satellites into deep space.”\n\nIn Musk’s telling, the step beyond data centers orbiting Earth is even larger computers in deep space. And furthermore, Musk says the best way to achieve that is to build a city on the moon to manufacture space computers and hurl them into the solar system using a big maglev train.\n\nIf that all feels a bit much, veteran Musk watchers know there’s a clue about where the discussion appears in a video of anall-hands meetingxAI shared with the public. The slide describing the moon base comes at the end of the presentation deck, where, during SpaceX pep talks, Musk typically shares renderings of SpaceX rockets landing on Mars and waxes rhapsodic about the future of multi-planetary humanity.\n\nNotably, the moon base comes just after SpaceX has publicly backed away from its long-held goal of colonizing Mars. Now, with xAI in the corporate fold, Musk needs a new science fiction metaphor for the future: In this case, theKardashev Scale, a theoretical measure of galactic civilizations coined by the eponymous Soviet astronomer in the 1960s. The idea is climbing the scale of energy usage — early c",
      "excerpt": "“Join xAI if the idea of mass drivers on the Moon appeals to you,” CEO Elon Muskproclaimedyesterday following a restructuring that saw a stream of former executivesexit the AI lab.\n\nThis is an interesting recruitment strategy after the company’s merger with Musk’s rocket maker, SpaceX, and the combi",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Amid disappointing earnings, Pinterest claims it sees more searches than ChatGPT",
      "link": "https://techcrunch.com/2026/02/12/amid-disappointing-earnings-pinterest-claims-it-sees-more-searches-than-chatgpt/",
      "author": "Sarah Perez",
      "date": "2026-02-12T15:26:56-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/pinterest-header.jpg?resize=1200,800",
      "category": "Social",
      "content": "After a particularlypoor performanceon its fourth-quarter earnings, Pinterest CEO Bill Ready attempted to favorably compare the digital pinboarding site to the popular AI chatbot ChatGPT.\n\nTrying to highlight its potential as a unique search destination, Ready asserted that the site sees larger search volume than ChatGPT. According to third-party data, ChatGPT sees 75 billion searches per month, while Pinterest sees 80 billion searches and generates 1.7 billion monthly clicks, he said.\n\n“That makes us one of the largest search destinations in the world. And importantly, more than half of those searches are commercial in nature, compared to, I think . . . approximately 2% [of ChatGPT searches],” Ready added.\n\nPinterest in the fourth quarter missed expectations on both revenue and earnings per share, reporting $1.32 billion in revenue versus $1.33 billion expected, and earnings per share of 67 cents, compared to the 69 cents projected. It also forecast that first-quarter 2026 sales will come in between $951 million to $971 million, below the $980 million expected.\n\nThe company blamed its shortfall on larger advertisers pulling back on spend, particularly in Europe, and a new furniture tariff implemented in October that caused issues within the home category. It said those trends could worsen in the first quarter.\n\nSurprisingly, Pinterest missed on earnings despite a user base that’s growing faster than expected. The company reported monthly active users were up 12% year-over-year to 619 million, when Wall Street had forecast 613 million users.\n\nSharesdropped20% in after-hours trading.\n\nPinterest has long struggled to translate the high usage of its platform into ad dollars, as its users often go to Pinterest to plan and dream, not shop and buy. That challenge could become even more acute in the AI era, especially if advertisers shift their dollars to platforms where intent to buy is clearer — such as chatbot requests that ask for product recommendations.\n\nWhen asked a",
      "excerpt": "After a particularlypoor performanceon its fourth-quarter earnings, Pinterest CEO Bill Ready attempted to favorably compare the digital pinboarding site to the popular AI chatbot ChatGPT.\n\nTrying to highlight its potential as a unique search destination, Ready asserted that the site sees larger sear",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Rivian was saved by software in 2025",
      "link": "https://techcrunch.com/2026/02/12/rivian-was-saved-by-software-in-2025/",
      "author": "Kirsten Korosec",
      "date": "2026-02-12T15:17:32-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/07/250522-ANASTASIA-BENSON-GOOGLE-MAPS-AEB08056-FINAL.jpg?resize=1200,790",
      "category": "Transportation",
      "content": "Rivian is, by every measure, a maker and seller of EVs. But in 2025, it was the company’s software and services that helped its annual revenue grow by 8%.\n\nRivian reported Thursday $5.38 billion in total revenue in 2025, up from $4.97 billion from the prior year. That rosy picture dulls a bit when looking just at its automotive revenue, which fell 15% to $3.8 billion in 2025. The fall was fueled by a $134 million drop in regulatory credit sales and lower vehicle deliveries, which were partially offset by higher average selling prices, according to Rivian.\n\nMeanwhile, software and services revenue grew more than threefold to $1.55 billion for the year. And the joint venture with Volkswagen Group was behind most of that growth, according to Rivian. The “services” component of this line item, which Rivian doesn’t break out, includes a variety of items, including vehicle repair, vehicle trade-ins, and maintenance services. The remainder, and the bulk of the revenue, is from software, and specifically due to the joint venture with VW Group.\n\nVW and Rivian formed atechnology joint venturein 2024 that is worth up to $5.8 billion. The joint venture is milestone-based and in 2025 Rivian hit the mark, which meant a $1 billion payout in the form of a share sale. Under the terms of the JV, Rivian will supply VW Group with its existing electrical architecture and software technology stack.\n\nRivian received an initial $1 billion convertible note in 2024 and another$1 billion paymentin July 2025.\n\nRivian is expected to continue to receive payments from VW Group through 2027. Rivian is expected to receive an additional $2 billion of capital as part of the joint venture in 2026, CFO Claire McDonough said Thursday on the company earnings call. About $1 billion of that is subject to the successful completion of winter testing, which is underway. The remaining $1 billion is nonrecourse debt, which is expected to be received in October.\n\nAnd while the funds provide a hefty stopgap, Rivi",
      "excerpt": "Rivian is, by every measure, a maker and seller of EVs. But in 2025, it was the company’s software and services that helped its annual revenue grow by 8%.\n\nRivian reported Thursday $5.38 billion in total revenue in 2025, up from $4.97 billion from the prior year. That rosy picture dulls a bit when l",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Didero lands $30M to put manufacturing procurement on ‘agentic’ autopilot",
      "link": "https://techcrunch.com/2026/02/12/didero-lands-30m-to-put-manufacturing-procurement-on-agentic-autopilot/",
      "author": "Marina Temkin",
      "date": "2026-02-12T12:31:47-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Founders_Exterior_Mid-3.jpg?resize=1200,800",
      "category": "Startups",
      "content": "Tim Spencer realized just how complicated manufacturing procurement can be while runningMarkai, an e-commerce startupin Asia, during the pandemic.\n\n“We had thousands of suppliers, and we were distributing products into dozens of countries around the world,” Spencer (pictured left) told TechCrunch. His staff was overwhelmed by the manual complexity of sourcing suppliers, negotiating pricing, tracking orders, and managing payments.\n\n“I found myself running this big team that was not really set up for success,” he said. He sold Markai in 2023, just as it was becoming clear that generative AI could streamline the most time-consuming procurement hurdles for manufacturers and distributors.\n\nLater that year, Spencer launchedDiderowith Lorenz Pallhuber (pictured center), a veteran of McKinsey’s procurement practice, and Tom Petit, the former technical co-founder ofLandis.\n\nDidero, whose mission is to automate many of the complexities of global procurement, just raised a $30 million Series A co-led by Chemistry and Headline, with participation from Microsoft’s venture fund M12.\n\n“Global trade runs on natural language communication,” Spencer said. “It’s emails, WeChat, phone calls, purchase orders, and packing lists.”\n\nUntil the advent of generative AI, these fragmented pieces had to be tracked by humans who spent their days chasing suppliers and manually updating systems of record. Didero claims its platform can ingest that communication, putting a significant portion of the procurement workflow on autopilot.\n\nDidero functions as an agentic AI layer that sits on top of a company’s existing ERP, acting as a coordinator that reads incoming communications and automatically executes the necessary updates and tasks.\n\n“The goal is to go from ‘I need a good’ to payment without having to lift a finger,” Spencer said.\n\nUnlike Levelpath, Zip, or Oro Labs, which use AI to streamline corporate purchasing, Didero focuses on the supply chain. Its platform is designed for manufacturers and",
      "excerpt": "Tim Spencer realized just how complicated manufacturing procurement can be while runningMarkai, an e-commerce startupin Asia, during the pandemic.\n\n“We had thousands of suppliers, and we were distributing products into dozens of countries around the world,” Spencer (pictured left) told TechCrunch. H",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Automattic planned to target 10 competitors with royalty fees, WP Engine claims in new filing",
      "link": "https://techcrunch.com/2026/02/12/automattic-planned-to-target-10-competitors-with-royalty-fees-wp-engine-claims-in-new-filing/",
      "author": "Sarah Perez",
      "date": "2026-02-12T11:02:07-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/11/wordpress-automattic-v1.jpg?resize=1200,800",
      "category": "Commerce",
      "content": "Web hosting company WP Engine has filed an amended complaint with brow-raising new allegations in itsongoing legal battlewith WordPress co-founder Matt Mullenweg and his company Automattic (WordPress.com’s parent company). The company now claims that Mullenweg intended to target 10 different hosting companies with royalty payments for their use of the WordPress trademark and tried to get payment processor Stripe to cancel its contract with WP Engine.\n\nAt the heart of the dispute, Mullenweg believes WP Engine isprofitingfrom the open source WordPress project without contributing back to the community, and demanded the hosting company pay 8% of its monthly gross revenues as a royalty fee for using the WordPress brand.\n\nThe suit,originally filedby WP Engine inOctober 2024, accused Automattic and Mullenweg ofdefamation and abuse of power. Automattic filed itscounterclaimslast year, alleging that the hosting company has been abusing the WordPress trademark and engaging in deceptive marketing practices.\n\nIn this latest filing, WP Engine has amended its complaint for the third time after gaining access to information that was uncovered during the discovery process. The information, now unredacted, had been previously sealed at Automattic’s request.\n\nNotably, one of the new claims accuses Automattic of allegedly planning to target 10 other competitors with royalty claims similar to those aimed at WP Engine.\n\nThe complaint also states that Newfold, a company whose portfolio includes hosting providers like Bluehost and HostGator, among others, is already paying Automattic for use of its trademarks and that Automattic is in conversations with others. (Names of the other hosts were redacted in the complaint, which referenced email conversations between those companies and Mullenweg.)\n\nWP Engine is also alleging that Mullenweg reached out to a Stripe executive via email to pressure the company to cancel WP Engine’s contract. This occurred after WP Engine had filed its lawsuit ag",
      "excerpt": "Web hosting company WP Engine has filed an amended complaint with brow-raising new allegations in itsongoing legal battlewith WordPress co-founder Matt Mullenweg and his company Automattic (WordPress.com’s parent company). The company now claims that Mullenweg intended to target 10 different hosting",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Aurora’s driverless trucks can now travel farther distances faster than human drivers",
      "link": "https://techcrunch.com/2026/02/12/auroras-driverless-trucks-can-now-travel-farther-distances-faster-than-human-drivers/",
      "author": "Kirsten Korosec",
      "date": "2026-02-12T09:58:30-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/05/Aurora-Launch-6-e1746107306339.jpg?resize=1200,886",
      "category": "Transportation",
      "content": "Aurora’s self-driving trucks can now travel nonstop on a 1,000-mile route between Fort Worth and Phoenix — exceeding what a human driver can legally accomplish.\n\nThe distance, and the time it takes to travel it, offers up positive financial implications for Aurora — and any other company hoping to commercialize self-driving semitrucks.\n\nIt takes Aurora about 15 hours to carry freight in its driverless trucks on the 1,000-mile journey, according to the company. Human truck drivers take much longer to complete the same distance due to federal regulations that limit how long they can be behind the wheel. For instance, truck drivers must stop for a 30-minute break after eight hours and can operate a semitruck for a maximum of 11 hours at a time, according to federal regulations. Once drivers hit that threshold, they cannot get behind the wheel for another 10 hours.\n\n“This represents more than a technological achievement,” Aurora co-founder and CEO Chris Urmson said during the company’s earnings call Wednesday afternoon. “It is the dawn of a superhuman future for freight.”\n\nIt also offers compelling economics to its customers, which includes Uber Freight, Werner, FedEx, and Schneider. The company said that eventually it can cut transit times nearly in half, a stat that has won over companies like Hirschbach, an early customer on the Fort Worth-to-Phoenix route.\n\nAurora said in aletter to shareholdersthat it is poised to expand across the Sun Belt of the United States. Today, the company operates driverless trucks — some with a human observer still in the cab — on routes between Dallas and Houston, Fort Worth and El Paso, El Paso and Phoenix, Fort Worth and Phoenix, and Laredo and Dallas.\n\nThe expansion has helped Aurora transition from a developer of autonomous trucks to a commercial operator who is earning money on its driverless routes.\n\nAurora has brought in revenue since April 2025 when it firstdeployed driverless, heavy-duty trucks for commercial useon public roads.",
      "excerpt": "Aurora’s self-driving trucks can now travel nonstop on a 1,000-mile route between Fort Worth and Phoenix — exceeding what a human driver can legally accomplish.\n\nThe distance, and the time it takes to travel it, offers up positive financial implications for Aurora — and any other company hoping to c",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Hacker linked to Epstein removed from Black Hat cyber conference website",
      "link": "https://techcrunch.com/2026/02/12/hacker-linked-to-epstein-removed-from-black-hat-cyber-conference-website/",
      "author": "Lorenzo Franceschi-Bicchierai",
      "date": "2026-02-12T11:15:04-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/jeffrey-epstein_8ef3e8.jpg?resize=1200,800",
      "category": "Security",
      "content": "Vincenzo Iozzo, a renowned hacker linked to convicted sex offender Jeffrey Epstein, is no longer listed on the website of Black Hat, one of the largest cybersecurity conferences in the world, nor on the Japanese security conference Code Blue.\n\nAs of Thursday, Iozzo does not appear on the official review board pages ofBlack HatorCode Blue. He was still listed on both pages as of last week. Iozzo had been on the Black Hat review board since 2011, according to his LinkedIn profile.\n\nIn a statement shared with TechCrunch through a spokesperson, Iozzo said he told Black Hat that he “will not willingly resign” and welcomed “a full investigation.”\n\nSpokespeople for Black Hat did not respond to requests for comment.\n\nIozzo, currently the founder and chief executive of cybersecurity startup SlashID, has had a long career in the industry. Iozzo authored one of the first manuals for hackers researching Apple’s mobile software, and in 2015, founded cybersecurity startup IperLane, which was later bought by CrowdStrike, leading him to serve as a senior director at the company for almost four years.\n\nIozzo’s name appears in more than 2,300 documents, some of which containseveral emails, released on January 30 as part of the Department of Justice’s legally required effort to publish materials from its investigation into the late financier and sex trafficker.\n\nIozzo’s interactions with Epstein span from October 2014 until December 2018. In late 2018, the Miami Heraldpublished news storiesdetailing allegationsthat Epsteinabused more than 60 women, some of them teenage girls.\n\nAfter these stories were published, newly releasedemails showIozzo was trying to meet with Epstein at his New York town house.\n\nContact UsDo you have more information about Epstein’s connections in the cybersecurity world?? From a non-work device, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram, Keybase and Wire @lorenzofb, orby email.\n\nAmong the new material ",
      "excerpt": "Vincenzo Iozzo, a renowned hacker linked to convicted sex offender Jeffrey Epstein, is no longer listed on the website of Black Hat, one of the largest cybersecurity conferences in the world, nor on the Japanese security conference Code Blue.\n\nAs of Thursday, Iozzo does not appear on the official re",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "US FTC airs concerns over allegations that Apple News suppresses right-wing content",
      "link": "https://techcrunch.com/2026/02/12/us-ftc-airs-concerns-over-allegations-that-apple-suppresses-right-wing-content-on-apple-news/",
      "author": "Ram Iyer",
      "date": "2026-02-12T06:40:03-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-2193735641.jpg?w=1024",
      "category": "Government & Policy",
      "content": "The U.S. Federal Trade Commission (FTC) has raised concerns over allegations that Apple is censoring conservative content on the Apple News app.\n\nIn aletterto Apple CEO Tim Cook, FTC chair Andrew Ferguson citedreportsfrom Media Research Center, a right-leaning think tank, which accused Apple of excluding right-leaning outlets from the top 20 articles in the Apple News feed.\n\n“These reports raise serious questions about whether Apple News is acting in accordance with its terms of service and its representations to consumers […] I abhor and condemn any attempt to censor content for ideological reasons,” Ferguson’s letter reads.\n\nFerguson, a Big Tech critic who Trump appointed to lead the competition regulator, noted the FTC doesn’t have any powers to require Apple to take ideological or political positions when curating news, but he said that if the company’s practices are “inconsistent” its terms of service or “reasonable expectations of consumers,” they may be in violation of the FTC Act.\n\nBrendan Carr, the chairman of the Federal Communications Commission (another Trump appointee critical of Big Tech),supportedFerguson’s stance, writing, “Apple has no right to suppress conservative viewpoints in violation of the FTC Act.”\n\nFerguson has urged Apple to conduct a “comprehensive review” of its terms of service and ensure that the content curated on Apple News is consistent with its policies, and “take corrective action swiftly” if the curation isn’t in line.\n\nThe letter comes a day after President Donald Trumpsharedthe report by Media Research Center on his social media platform, Truth Social. Trump has repeatedly accused Big Tech companies of censoring right-leaning content, though many major platforms have rolled back several measures to curb fake news and disinformation they had imposed in the years prior to his second stint at the White House.\n\nApple’s relationship with the Trump administration has oscillated between warm and cold over the past year. Trump has crit",
      "excerpt": "The U.S. Federal Trade Commission (FTC) has raised concerns over allegations that Apple is censoring conservative content on the Apple News app.\n\nIn aletterto Apple CEO Tim Cook, FTC chair Andrew Ferguson citedreportsfrom Media Research Center, a right-leaning think tank, which accused Apple of excl",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Waymo is asking DoorDash drivers to shut the doors of its self-driving cars",
      "link": "https://techcrunch.com/2026/02/12/waymo-is-asking-doordash-drivers-to-shut-the-doors-of-its-self-driving-cars/",
      "author": "Amanda Silberling",
      "date": "2026-02-12T20:41:41-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/waymo-getty-streets.jpg?resize=1200,800",
      "category": "Transportation",
      "content": "It still feels like a technological marvel: Waymo’s autonomous cars are now transporting passengers across six cities. Alas, this driverless future comes with its own set of problems. These vehicles can be rendered inert if a passenger accidentally leaves the door open.\n\nAccording toa Reddit post, one DoorDash driver discovered this issue when an odd request appeared in their queue. Instead of making a delivery, the driver was offered $6.25 to drive less than one mile to a Waymo vehicle and close its door. After “verified completion,” they would get an extra $5.\n\n“You actually ‘door’ dashed,” one commenter noted.\n\nIt seems too ironic to be real. Waymo vehicles represent technological breakthroughs that once seemed unfathomable. The Alphabet-owned company just raised$16 billionto take its driverless cars international!\n\nBut Waymo and DoorDash confirmed to TechCrunch that this Reddit post is legitimate. This is, in fact, a real problem.\n\n“Waymo is currently running a pilot program in Atlanta to enhance its AV fleet efficiency. In the rare event a vehicle door is left ajar, preventing the car from departing, nearby Dashers are notified, allowing Waymo to get its vehicles back on the road quickly,” Waymo and DoorDash said in a joint response. (The door-closing partnership, which beganearlier this year, is just one facet of Waymo and DoorDash’s broader relationship. In October, the companies launched an autonomous delivery service in Phoenix, where Waymo vehicles deliver food and groceries to DoorDash customers.)\n\nIf a Waymo door is left open, it’s worth it to the company to pay someone to close it — the car cannot complete any more rides if it’s left immobile. Not to mention, an unmoving car could block the flow of traffic.\n\nThis isn’t the first time Waymo has enlisted help with its door troubles. In Los Angeles, Waymo works withHonk, an app that’s like Uber for towing services. According to reports, Honk users in L.A. have been offeredup to $24to close a Waymo door — m",
      "excerpt": "It still feels like a technological marvel: Waymo’s autonomous cars are now transporting passengers across six cities. Alas, this driverless future comes with its own set of problems. These vehicles can be rendered inert if a passenger accidentally leaves the door open.\n\nAccording toa Reddit post, o",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "For $1M, you can pay Bryan Johnson (or BryanAI?) to teach you how to live longer",
      "link": "https://techcrunch.com/2026/02/12/for-1-million-you-can-pay-bryan-johnson-or-bryanai-to-teach-you-how-to-live-longer/",
      "author": "Amanda Silberling",
      "date": "2026-02-12T15:43:47-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/03/Screenshot-2025-03-13-at-6.23.04PM.png?resize=1200,670",
      "category": "Biotech & Health",
      "content": "It’s the middle of February, and the air is dry. There are fine lines emerging on my forehead, maybe because I don’t moisturize enough, but maybe as a harbinger of something greater: Each day I grow closer to my own death. Soon, I will be 30. I will never be younger than I am right now.\n\nFintech-founder-turned-longevity-guru Bryan Johnson has an offer that has caught my attention. For the low, low price of $1 million per year, I can pay him to show me the ropes of the “exact protocol” he’s followed for the last five years. He calls the program “Immortals.”\n\nYes, a guy who has receivedbotox injectionsin his genitals will teach me how to supposedly reverse the process of aging. Why shouldn’t I believe that Bryan Johnson has uncovered the secrets to living longer than any other human? No, he has not yet proven his capacity to outlive all other humans. He was born in 1977, a year in which many current humans were born.\n\nBut why would I doubt the judgment of a guy who fortified his constitution withblood from his teenage son? When have the tech elite ever misled us? Should I also question when Elon Musk says thatsaving for retirement is irrelevantbecause AGI will create an economic abundance so great that no one will ever know poverty again?\n\nToday, we are launching Immortals.+ $1,000,000 per year+ Three spots availableImmortals is the world’s best health program. It is the exact protocol I have followed for the last 5 years. It is your Autonomous Health.Includes a dedicated concierge team, BryanAI…pic.twitter.com/o2DGRtn7IH\n\nAccording to Johnson’s post on X, this exclusive service — only three spots are available! — will include “a dedicated concierge team, BryanAI 24/7, extensive testing, millions of biological data points, continuous tracking, best skin and hair protocols, and access to the best therapies on market.”\n\nI can talk to the AI version of a guywho livestreams himself doing shroomsfor “science”? Sign me up!\n\nExcept I can’t. Because I do not have $1 million. ",
      "excerpt": "It’s the middle of February, and the air is dry. There are fine lines emerging on my forehead, maybe because I don’t moisturize enough, but maybe as a harbinger of something greater: Each day I grow closer to my own death. Soon, I will be 30. I will never be younger than I am right now.\n\nFintech-fou",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}