{
  "last_updated": "2026-02-03T20:41:04.651273+00:00",
  "articles": [
    {
      "title": "Fitbit founders launch AI platform to help families monitor their health",
      "link": "https://techcrunch.com/2026/02/03/fitbit-founders-launch-ai-platform-to-help-families-monitor-their-health/",
      "author": "Aisha Malik",
      "date": "2026-02-03T07:53:36-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Luffu_Family_Morning_Land.jpg?resize=1200,675",
      "category": "Apps",
      "content": "Fitbit founders James Park and Eric Friedman haveannouncedthe launch of a new AI startup called Luffu that aims to help families proactively monitor their health. The duo are developing an “intelligent family care system” that will start with an app experience and then expand into hardware devices. Two years after their exit from Google, Park and Friedman are betting on AI to help lighten the mental burden of caregiving. According to arecent report, 63 million, or nearly 1 in 4, U.S. adults are family caregivers, up 45% from 10 years ago. Luffu uses AI in the background to gather and organize family information, learn day-to-day patterns, and flag notable changes so families can stay aligned and address potential well-being issues. “At Fitbit, we focused on personal health—but after Fitbit, health for me became bigger than just thinking about myself,” Park said in apress release. “I was caring for my parents from across the country, trying to piece together my mom’s health care across various portals and providers, with a language barrier that made it hard to get complete, timely context from her about doctor visits. I didn’t want to constantly check in, and she didn’t want to feel monitored. Luffu is the product we wished existed—to stay on top of our family’s health, know what changed and when to step in—without hovering.” The pair note that today’s consumer health market is filled with tools for individuals, but that real life health is shared across partners, kids, parents, pets, and caregivers. Family information is scattered across devices, portals, calendars, attachments, spreadsheets, and paper documents. With Luffu, people will be able to track the whole family’s details, including health stats, diet, medications, symptoms, lab tests, doctor visits, and more. Users can log health information using voice, text, or photos. Luffu proactively watches for changes, and surfaces insights and alerts, such as unusual vitals or changes in sleep. The pairtold Axiostha",
      "excerpt": "Fitbit founders James Park and Eric Friedman haveannouncedthe launch of a new AI startup called Luffu that aims to help families proactively monitor their health. The duo are developing an “intelligent family care system” that will start with an app experience and then expand into hardware devices. ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Vema predicts cheap hydrogen could change where data centers are built",
      "link": "https://techcrunch.com/2026/02/03/vema-predicts-cheap-hydrogen-could-change-where-data-centers-are-built/",
      "author": "Tim De Chant",
      "date": "2026-02-03T04:15:49-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2166404383.jpeg?resize=1200,800",
      "category": "Climate",
      "content": "The automotive industry has struggled to adopt hydrogen at scale, but industrial users and data centers might have better luck. Vema Hydrogeninked a deal in December to supply California data centers, and now it has completed a pilot project in Quebec to power industry with hydrogen that it produces deep underground. The startup drills wells in regions with specific types of iron-rich rock that release hydrogen gas when treated with water, heat, pressure, and some catalysts. Vema then draws the hydrogen to the surface and sells it to industrial users. “To supply the Quebec local market, which is about 100,000 tons per year, you would need 3 square kilometers, which is nothing,” Pierre Levin, CEO of Vema, told TechCrunch. Vema’s first pilot well will produce several tons of hydrogen per day, and next year, it plans to drill its first commercial well, which will reach 800 meters into the earth. Vema expects to produce hydrogen from the first wells for less than $1 per kilogram, a widely used benchmark for clean hydrogen. Most hydrogen today is made by a process known as steam reforming of methane (SMR), in which steam is used to break hydrogen molecules off methane from natural gas. It’s energy intensive, and both the process to make steam and the chemical reaction itself release carbon dioxide. Less polluting sources of hydrogen exist, but they tend to cost more. Hydrogen from SMR costs between 70 cents and $1.60 per kilogram,accordingto the IEA. Capturing carbon from SMR can add around 50% to those prices, while the cleanest process, which uses zero carbon electricity to power an electrolyzer, drives costs up several fold. Stimulated geologic hydrogen, or “engineered mineral hydrogen,” as Vema calls it, promises to be one of the cleanest sources of hydrogen,accordingto the Oxford Institute for Energy Studies. Once Vema has refined its techniques, Levin expects it to produce hydrogen for less than 50 cents per kilogram. At that price, Vema’s hydrogen would be cheaper",
      "excerpt": "The automotive industry has struggled to adopt hydrogen at scale, but industrial users and data centers might have better luck. Vema Hydrogeninked a deal in December to supply California data centers, and now it has completed a pilot project in Quebec to power industry with hydrogen that it produces",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Peak XV says internal disagreement led to partner exits as it doubles down on AI",
      "link": "https://techcrunch.com/2026/02/03/peak-xv-says-internal-disagreement-led-to-partner-exits-as-it-doubles-down-on-ai/",
      "author": "Jagmeet Singh",
      "date": "2026-02-03T06:14:33-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/peak-xv-partners-ashish-agrawal-tejeshwi-sharma-ishaan-mittal.jpg?resize=1200,800",
      "category": "Venture",
      "content": "Peak XV Partners, a leading venture capital firm in India and Southeast Asia, has seen a fresh round of senior departures. These follow other leadership exits over the past year as it pushes ahead with plans to deepen its focus on AI investing and expand its footprint in the U.S., while keeping India as its largest market. The latest departures stem from an internal disagreement with senior partner Ashish Agrawal (pictured above, left) that led to a mutual decision to part ways, Managing Director Shailendra Singh told TechCrunch. He added that two other partners, Ishaan Mittal (pictured above, right) and Tejeshwi Sharma (pictured above, center), chose to leave alongside him. Singh said Peak XV did not want to go into the specifics of the disagreement and was focused on moving forward. “Just out of privacy, and out of, like, trying to be classy about it,” he said. Singh added that such departures were not uncommon at large, multi-stage venture firms and that Peak XV wanted to move on quickly after several years of working together. All board seats held by the departing partners would be transitioned “imminently,” Singh said, noting that the firm already had overlapping representation across several portfolio companies. He said Peak XV was not concerned about continuity, noting that multiple general partners and operating partners were already involved across many of those boards. The departures mark the exit of long-tenured investors from the firm. Agrawal had been with Peak XV for more than 13 years, while Mittal spent over nine years at the firm and Sharma more than seven years, per their LinkedIn profiles. Agrawalwrotein a LinkedIn post that he had decided to “take the entrepreneurial plunge” and was teaming up with Mittal and Sharma to start a new venture capital firm. He described the move as an opportunity to build a new institution with longtime partners and thanked Peak XV’s leadership for what he called a “truly wonderful partnership.” During his time at Pea",
      "excerpt": "Peak XV Partners, a leading venture capital firm in India and Southeast Asia, has seen a fresh round of senior departures. These follow other leadership exits over the past year as it pushes ahead with plans to deepen its focus on AI investing and expand its footprint in the U.S., while keeping Indi",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Elon Musk’s SpaceX officially acquires Elon Musk’s xAI, with plan to build data centers in space",
      "link": "https://techcrunch.com/2026/02/02/elon-musk-spacex-acquires-xai-data-centers-space-merger/",
      "author": "Sean O'Kane",
      "date": "2026-02-02T14:21:57-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/10/OLM_Full_Pressure_Water_Deluge_Test_202307280728232180_1_8ac578ec57.jpeg?resize=1200,675",
      "category": "Space",
      "content": "SpaceX has acquired Elon Musk’s artificial intelligence startup, xAI, creating the world’s most valuable private company, the spaceflight company announced Monday. Musk, who is also the CEO of SpaceX, wrote in amemoposted to the rocket company’s website that the merger is largely about creating space-based data centers — an idea he has become fixated on over the last few months. “Current advances in AI are dependent on large terrestrial data centers, which require immense amounts of power and cooling. Global electricity demand for AI simply cannot be met with terrestrial solutions, even in the near term, without imposing hardship on communities and the environment,” he wrote. (xAI has been accused ofimposing some of that hardshipon the communities near its data centers in Memphis, Tennessee.) The tie-up values the combined company at $1.25 trillion, according to Bloomberg News, which was first toreport the completed deal. SpaceX has beenreportedlypreparing an IPO for as early as June of this year. It’s unclear whether the merger will affect that timeline. Musk did not address the IPO in his public memo. The merger brings together two of Musk’s companies, each with its own financial challenges. xAI is currently burning around $1 billion per month, according to Bloomberg. SpaceX, meanwhile, generates as much as 80% of its revenue from launching its own Starlink satellites,according to Reuters. Last year,xAI acquired X, the social media company also owned by Musk, with Musk claiming a combined company valuation of $113 billion. Musk wrote in his memo that it will take a constant stream of many — although he did not specify how many — satellites to create these space-based data centers, ensuring that SpaceX will have an even-larger constant stream of revenue for the foreseeable future. (That revenue loop likely looks even more attractive when you consider that satellites are required to be de-orbited every five years by the Federal Communications Commission.) While spac",
      "excerpt": "SpaceX has acquired Elon Musk’s artificial intelligence startup, xAI, creating the world’s most valuable private company, the spaceflight company announced Monday. Musk, who is also the CEO of SpaceX, wrote in amemoposted to the rocket company’s website that the merger is largely about creating spac",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Fintech CEO and Forbes 30 Under 30 alum has been charged for alleged fraud",
      "link": "https://techcrunch.com/2026/02/02/fintech-ceo-and-forbes-30-under-30-alum-has-been-charged-for-alleged-fraud/",
      "author": "Lucas Ropek",
      "date": "2026-02-02T16:16:14-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2019/10/GettyImages-1131974626.jpg?resize=1200,800",
      "category": "Fintech",
      "content": "By now, theForbes 30 Under 30 listhas become more than a little notorious for the amount of entrants who go on to be charged with fraud. Notable alumni includeFTX founder Sam Bankman-Fried, Frank CEO Charlie Javice,Joanna Smith-Griffin, founder of the AI startup AllHere Education, and “pharma bro” Martin Shkreli, among others. Now, another member of the list has been hit with federal charges. Gökçe Güven, a 26-year-old Turkish national and the founder and CEO of fintech startupKalder, wascharged last weekwith alleged securities fraud, wire fraud, visa fraud, and aggravated identity theft. The New York-based fintech startup — which uses the “Turn Your Rewards into [a] Revenue Engine” tagline — says it can help companies create and monetize individual rewards programs. The company was founded in 2022, and offers participating firms the opportunity to earn ongoing revenue streams via partner affiliate sales, Axiospreviously reported. Güven was featured in last year’s Forbes 30 Under 30 list. The magazinenotes in the writeup thatGüven’s clients included major chocolatier Godiva and the International Air Transport Association, the trade organization that represents a majority of the world’s airlines. Kalder also claims to have enjoyed the backing ofa number of prominent VC firms. The U.S. Department of Justice alleges that, during Kalder’sseed roundin April of 2024, Güven managed to raise $7 million from more than a dozen investors after presenting a pitch deck that was rife with false information. According to the government, Kalder’s pitch deck claimed that there were 26 brands “using Kalder” and another 53 brands in “live freemium.” However, officials say that, in reality, Kalder had, in many cases, only been offering heavily discounted pilot programs to many of those companies. Other brands “had no agreement with Kalder whatsoever—not even for free services,” officials said in a press release announcing the indictment. The pitch deck also “falsely reported that Kalde",
      "excerpt": "By now, theForbes 30 Under 30 listhas become more than a little notorious for the amount of entrants who go on to be charged with fraud. Notable alumni includeFTX founder Sam Bankman-Fried, Frank CEO Charlie Javice,Joanna Smith-Griffin, founder of the AI startup AllHere Education, and “pharma bro” M",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "China is leading the fight against hidden car door handles",
      "link": "https://techcrunch.com/2026/02/02/china-is-leading-the-fight-against-hidden-car-door-handles/",
      "author": "Kirsten Korosec",
      "date": "2026-02-02T13:55:38-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/tesla-door-Getty.jpg?resize=1200,900",
      "category": "Transportation",
      "content": "One of the design features that became synonymous with Tesla has been banned in China. Under new safety rulespublished Mondayby China’s Ministry of Industry and Information Technology, cars sold in the country must have mechanical releases on their door handles. The new rules, which go in effect January 1, 2027, will prohibit the hidden, electronically actuated door handles popularized by Tesla — and now found on numerous other electric vehicles in China. The new rule dictates that each door (excluding the tailgate) should be equipped with a mechanically released external door handle. Vehicles must also have a mechanical release on the interior of the vehicle. Bloombergpreviously reportedon the new safety policy. Numerous high-profile fatal incidents, in which occupants have become trapped in their vehicles, have raised concerns among safety regulators and advocates globally. China is the first country to issue a ban. Aninvestigation by Bloomberglast September uncovered problems with the concealed door handles on Tesla vehicles, citing several crashes in which first responders or occupants were unable to open the doors because the electronic door locks weren’t getting enough power from the vehicle’s battery system to work properly. The U.S. National Highway Traffic Safety Administration then opened adefect investigationinto certain Tesla Model Y andModel 3door handles. While Tesla does have manual releases inside its vehicles, federal investigators noted that the releases can be hard for children to access, and many owners are unaware of their existence. Some U.S. lawmakers haveproposed regulationrequiring manual door releases in all new vehicles. Fatal incidents in China, including a crash involving a Xiaomi SU7 electric sedan, prompted regulators there to propose changes to EV door handles last year. The Chinese government began the process in May 2025 with more than 40 domestic vehicle manufacturers, parts suppliers, and testing institutions participating in the ",
      "excerpt": "One of the design features that became synonymous with Tesla has been banned in China. Under new safety rulespublished Mondayby China’s Ministry of Industry and Information Technology, cars sold in the country must have mechanical releases on their door handles. The new rules, which go in effect Jan",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "What Snowflake’s deal with OpenAI tells us about the enterprise AI race",
      "link": "https://techcrunch.com/2026/02/02/what-snowflakes-deal-with-openai-tells-us-about-the-enterprise-ai-race/",
      "author": "Rebecca Szkutak",
      "date": "2026-02-02T11:09:44-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/06/GettyImages-2215876044.jpg?w=1024",
      "category": "Enterprise",
      "content": "Cloud data company Snowflake entered into a$200 million multi-year AI dealwith OpenAI on Monday, the latest signal that enterprise AI competition continues to heat up. Under the deal, Snowflake’s 12,600 customers will have access to OpenAI models across all three major cloud providers. Snowflake employees have access to OpenAI’s ChatGPT Enterprise as well. The two companies are also partnering to build new AI agents and other AI products. “By bringing OpenAI models to enterprise data, Snowflake enables organizations to build and deploy AI on top of their most valuable asset using the secure, governed platform they already trust,” Snowflake CEO Sridhar Ramaswamy said in a press release. “Customers can now harness all their enterprise knowledge in Snowflake together with the world-class intelligence of OpenAI models, enabling them to build AI agents that are powerful, responsible, and trustworthy. Together, we’re setting a new standard for AI innovation, helping businesses transform with confidence, while maintaining strong security and compliance standards.” OpenAI declined to share information on the deal beyond the press release. If this deal feels familiar, it should. Snowflake announced a$200 million enterprise deal with AI research lab Anthropicat the beginning of December. At the time, Ramaswamy was quoted making very similar comments about how the partnership with Anthropic would give its customers access to powerful AI models on top of their existing data. “Our partnership with OpenAI is a multi-year commercial commitment focused on reliability, performance, and real customer usage. At the same time, we remain intentionally model-agnostic. Enterprises need choice, and we do not believe in locking customers into a single provider,” Baris Gultekin, vice president of AI at Snowflake, told TechCrunch over email. “OpenAI is an important partner, and it is one of several frontier model providers available on Snowflake today, alongside Anthropic, Google, Meta, and o",
      "excerpt": "Cloud data company Snowflake entered into a$200 million multi-year AI dealwith OpenAI on Monday, the latest signal that enterprise AI competition continues to heat up. Under the deal, Snowflake’s 12,600 customers will have access to OpenAI models across all three major cloud providers. Snowflake emp",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Adobe Animate is shutting down as company focuses on AI",
      "link": "https://techcrunch.com/2026/02/02/adobe-animate-is-shutting-down-as-company-focuses-on-ai/",
      "author": "Sarah Perez",
      "date": "2026-02-02T13:15:03-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2019/07/GettyImages-95799630.jpg?resize=1200,800",
      "category": "Apps",
      "content": "As AdoberampsupitsinvestmentsinAI, the company has decided to shut down its 2D animation software,Adobe Animate. On Monday, Adobe issued anupdateto the company’s support site and sent emails to existing customers announcing Adobe Animate will be discontinued on March 1, 2026. Enterprise customers can continue to receive technical support through March 1, 2029, to ease the transition. Other customers will have support through March of next year, the company said. The decision has beenmetwithincredulity, disappointment, and anger among Adobe Animate users, who are concerned about the lack of alternatives that mirror Animate’s functionality. One customer,posting on X, pleaded with Adobe to at least open source the software rather than abandon it. Commenters on the thread responded with angst, saying thingslike“this is legit gonna ruin my life,”and“literally what the hell are they doing? animate is the reason a good chunk of adobe users even subscribe in the first place. Adobe explained its decision to discontinue the program in anFAQ, saying, “Animate has been a product that has existed for over 25 years and has served its purpose well for creating, nurturing, and developing the animation ecosystem. As technologies evolve, new platforms and paradigms emerge that better serve the needs of the users. Acknowledging this change, we are planning to discontinue supporting Animate.” Hey@Adobeopen source this instead of ending itpic.twitter.com/ZZNn5cZYS4 we literally had a whole semester of adobe animate class and now they're discontinuing it 😭https://t.co/Xsn9t05qpV I’m sorry: Adobe Animate is getting WHAT and H U H???pic.twitter.com/JfVrJIBYUl Adobe Animate will be discontinued.@adobehas been legendary at destroying great products.pic.twitter.com/ABOUIJkQqS Reading between the lines, it sounds as if Adobe is saying that Animate no longer represents the current direction of the company, which is now more focused on products that incorporate AI technologies. What’s surprising",
      "excerpt": "As AdoberampsupitsinvestmentsinAI, the company has decided to shut down its 2D animation software,Adobe Animate. On Monday, Adobe issued anupdateto the company’s support site and sent emails to existing customers announcing Adobe Animate will be discontinued on March 1, 2026. Enterprise customers ca",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "YC startups can now receive investment in stablecoin",
      "link": "https://techcrunch.com/2026/02/03/yc-startups-can-now-recieve-investment-in-stablecoin/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-03T11:54:12-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/06/shrinking-yc.jpg?resize=1200,675",
      "category": "",
      "content": "All startups accepted into YC will soon have the option to receive their seed checks via stablecoins, crypto YC partner Nemil Dalaltold The Block. YC’s famous“standard deal”is that it invests $500,000 into startups accepted into its program in exchange for 7% of their companies. Now that deal is hitting the blockchain (Base, Solana, and Ethereum, to be exact), starting with the upcoming spring batch. Dalal said that stablecoin transfers are often more effective, specifically for founders working in emerging markets. But also, YC is putting its money where its mouth is, so to speak.Last fall, YCpartnered withBase and Coinbase Ventures to encourage founders to build more blockchain-related companies. Interest in blockchain tech is on the rise again in Silicon Valley as the U.S.has taken steps towardmore formal, crypto-friendly regulation of the industry.",
      "excerpt": "All startups accepted into YC will soon have the option to receive their seed checks via stablecoins, crypto YC partner Nemil Dalaltold The Block. YC’s famous“standard deal”is that it invests $500,000 into startups accepted into its program in exchange for 7% of their companies. Now that deal is hit",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "2026 plans: What’s next for Startup Battlefield 200",
      "link": "https://techcrunch.com/2026/02/03/looking-ahead-to-2026-whats-next-for-startup-battlefield-200/",
      "author": "Isabelle Johannessen",
      "date": "2026-02-03T10:57:30-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/11/54889460445_20c033b45a_o-2.jpg?resize=1200,800",
      "category": "Startups",
      "content": "TechCrunch Startup Battlefield 200is the flagship early-stage startup competition held atTechCrunch Disruptin San Francisco, spotlighting the world’s most promising young companies. Each year, thousands of applicants from around the globe vie for one of 200 slots in the cohort, which provides unparalleled visibility, access to top-tier investors, and opportunities to grow. Early-stage startups from around the world are joining theStartup Battlefield email listto be the first to know when applications open this month. Don’t miss a beat if you’re ready to join the action. Startup Battlefield 200is a highly selective startup launch program designed to prepare early-stage startups for visibility, investment, and scale. Each year, TechCrunch hand-selects 200 companies to gain unmatched exposure, credibility, and opportunities to scale faster than they ever imagined: Startup Battlefield’s track record is among the strongest in the industry — alumni represent1,700+ companiesthat have collectively raised over $32 billion and include well-known names such as: In 2026,Startup Battlefield 200will once again bring together a global cohort of high-potential early-stage startups building across AI, climate, health, fintech, and beyond. Applications will open in the middle of this month and close in mid-June. Selected startups will be notified aroundSeptember 1, when the virtual preparation program begins — designed to help founders refine their story, sharpen their pitch, and get ready for the pitch of a lifetime on the TechCrunch Disrupt stage. For founders and investors alike, Startup Battlefield 200 remains one of the most influential global early-stage startup stages — a place where breakout companies get seen, funded, and scaled. Don’t miss a moment of the action:Join the Startup Battlefield mailing listto be the first to know when applications open next month.",
      "excerpt": "TechCrunch Startup Battlefield 200is the flagship early-stage startup competition held atTechCrunch Disruptin San Francisco, spotlighting the world’s most promising young companies. Each year, thousands of applicants from around the globe vie for one of 200 slots in the cohort, which provides unpara",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}