{
  "last_updated": "2026-02-14T19:26:45.104537+00:00",
  "articles": [
    {
      "title": "Designer Kate Barton teams up with IBM and Fiducia AI for a NYFW presentation",
      "link": "https://techcrunch.com/2026/02/14/designer-kate-barton-teams-up-with-ibm-and-fiducia-ai-for-a-nyfw-presentation/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-14T09:43:46-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Kate-Barton-IBM.jpg?resize=1200,675",
      "category": "Media & Entertainment",
      "content": "On Saturday, designerKate Bartonwill unveil her latest collection at New York Fashion Week — with a twist, of course. Barton teamed up withFiducia AIto create a multilingual AI agent (built with IBM Watsonx on IBM Cloud) to help guests identify pieces of the collection and try them on virtually.\n\nTechCrunch caught up with Barton and Ganesh Harinath, the founder and CEO of Fiducia AI, before the show to learn more about the presentation.\n\nFor one, Barton said technology is baked into how she thinks. She likes playing with the real and the unreal, and found the idea of using AI-like set design, “a portal into the collection’s world, rather than ‘AI for AI’s sake,” she said.\n\n“Today, tech is a tool for expanding the world around the clothes, how they are presented, and how people enter the story, and how we create that moment when your eyes do a double-take,” she told TechCrunch, adding that the goal for this collection was to create a sense of curiosity.\n\nHarinath said his company used IBM watsonx, IBM Cloud, and IBM Cloud Object Storage to help pull off Barton’s presentation. It was a production-grade activation with a Visual AI lens (built with IBM watsonx) that detects pieces from Barton’s new collection. It can answer questions in any language via voice and text and offers photorealistic virtual reality try-ons.\n\n“The hardest work wasn’t model tuning; it was orchestration,” he told TechCrunch. This isn’t the first time Barton has put a technological spin on her fashion — last season, sheexperimented with AI models, also in collaboration with Fiduicia AI.\n\nAt fashion week, there was some chatter about whether brands — and, if so, which ones — would be using technology and artificial intelligence. Barton thinks many brands are using AI, though quietly, mainly in operations. “Maybe fewer are using it publicly because of the potential reputational risk,” she said.\n\nIt rhymes a bit with the early days when many big fashion names were nervous about starting websites. “T",
      "excerpt": "On Saturday, designerKate Bartonwill unveil her latest collection at New York Fashion Week — with a twist, of course. Barton teamed up withFiducia AIto create a multilingual AI agent (built with IBM Watsonx on IBM Cloud) to help guests identify pieces of the collection and try them on virtually.\n\nTe",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Hollywood isn’t happy about the new Seedance 2.0 video generator",
      "link": "https://techcrunch.com/2026/02/14/hollywood-isnt-happy-about-the-new-seedance-2-0-video-generator/",
      "author": "Anthony Ha",
      "date": "2026-02-14T10:26:52-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2020/08/GettyImages-1263876301.jpeg?w=1024",
      "category": "Media & Entertainment",
      "content": "Hollywood organizations are pushing back against a new AI video model calledSeedance 2.0, which they say has quickly become a tool for “blatant” copyright infringement.\n\nByteDance, the Chinese company that recently finalized a deal to sell TikTok’s U.S. operations (itretains a stake in the new joint venture), launched Seedance 2.0 earlier this week.According to the Wall Street Journal, the updated model is currently available to Chinese users of ByteDance’s Jianying app, and the company says it will soon be available to global users of its CapCut app.\n\nSimilar to tools such asOpenAI’s Sora, Seedance allows users to create videos (currently limited to 15 seconds in length) by just entering a text prompt. And like Sora, Seedance quickly drew criticism for an apparent lack of guardrails around the ability to create videos using the likeness of real people, as well as studios’ intellectual property.\n\nAfter one X userposted a brief videoshowing Tom Cruise fighting Brad Pitt, which they said was created by “a 2 line prompt in seedance 2,” “Deadpool” screenwriterRhett Reese responded, “I hate to say it. It’s likely over for us.”\n\nThe Motion Picture Association soon issueda statementfrom CEO Charles Rivkin demanding that ByteDance “immediately cease its infringing activity.”\n\n“In a single day, the Chinese AI service Seedance 2.0 has engaged in unauthorized use of U.S. copyrighted works on a massive scale,” Rivkin said. “By launching a service that operates without meaningful safeguards against infringement, ByteDance is disregarding well-established copyright law that protects the rights of creators and underpins millions of American jobs.”\n\nThe Human Artistry Campaign — an initiative backed by Hollywood unions and trade groups —condemned Seedance 2.0as “an attack one very creator around the world,” whilethe actors’ union SAG-AFTRA saidit “stands with the studios in condemning the blatant infringement enabled by Bytedance’s new AI video model Seedance 2.0.”\n\nSeedance videos",
      "excerpt": "Hollywood organizations are pushing back against a new AI video model calledSeedance 2.0, which they say has quickly become a tool for “blatant” copyright infringement.\n\nByteDance, the Chinese company that recently finalized a deal to sell TikTok’s U.S. operations (itretains a stake in the new joint",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Airbnb says a third of its customer support is now handled by AI in the US and Canada",
      "link": "https://techcrunch.com/2026/02/13/airbnb-says-a-third-of-its-customer-support-is-now-handled-by-ai-in-the-u-s-and-canada/",
      "author": "Sarah Perez",
      "date": "2026-02-13T14:12:26-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/05/Airbnb-Summer-feat.jpg?resize=1200,675",
      "category": "AI",
      "content": "Airbnb says itscustom-built AI agentis now handling roughly a third of its customer support issues in North America, and it’s preparing to roll out the feature globally. If successful, the company believes that in a year’s time, more than 30% of its total customer support tickets will be handled by AI voice and chat in all the languages where it also employs a human customer service agent.\n\n“We think this is going to be massive because not only does this reduce the cost base of Airbnb customer service, but the quality of service is going to be a huge step change,” CEO Brian Chesky said during the company’sfourth-quarter earningscall this week. This seems to suggest he believes the AI would do a better job than its human counterparts in resolving some issues.\n\nThe company also touted its recent hire of CTO Ahmad Al-Dahle,poached from Metafor his AI expertise, and its plans to create an AI-native experience.\n\nWith his guidance, Chesky said that Airbnb was poised to introduce an app that doesn’t just search for you, but one that “knows you.”\n\n“It will help guests plan their entire trip, help hosts better run their businesses, and help the company operate more efficiently at scale,” Chesky explained, adding that’s why Airbnb brought Al-Dahle on board.\n\n“Ahmad is one of the world’s leading AI experts. He spent 16 years at Apple, and most recently led the generative AI team at Meta that built the Llama models. He’s an expert at pairing massive technical scale with world-class design, which is exactly how we’re going to transform the Airbnb experience,” Chesky noted.\n\nLike other businesses poised for disruption by AI, Airbnb’s leadership is pushing the idea that it has a unique database and product that other AI chatbots can’t replicate.\n\n“A chatbot doesn’t have our 200 million verified identities or our 500 million proprietary reviews, and it can’t message the hosts, which 90% of our guests do,” Chesky told analysts during the earnings call. Instead, he pitched the idea o",
      "excerpt": "Airbnb says itscustom-built AI agentis now handling roughly a third of its customer support issues in North America, and it’s preparing to roll out the feature globally. If successful, the company believes that in a year’s time, more than 30% of its total customer support tickets will be handled by ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "India doubles down on state-backed venture capital, approving $1.1B fund",
      "link": "https://techcrunch.com/2026/02/14/india-doubles-down-on-state-backed-venture-capital-approving-1-1b-fund/",
      "author": "Jagmeet Singh",
      "date": "2026-02-14T08:23:22-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/09/india-flag.jpg?resize=1200,800",
      "category": "Startups",
      "content": "India has cleared a $1.1 billion state-backed venture capital program that will channel government money into startups through private investors, doubling down on its effort to finance high-risk areas such as artificial intelligence, advanced manufacturing and other sectors broadly referred to by the industry as deep tech.\n\nFirst outlinedin the January 2025 budget speech by India’s finance minister, the ₹100 billion fund won cabinet approval this week (more than a year after the speech), allowing the government to move ahead with deployment. A previous iteration of the program, launched in 2016, committed ₹100 billion to 145 private funds that have invested more than ₹255 billion (about $2.8 billion) in over 1,370 startups, according to official datareleasedon Saturday.\n\nThe program is structured as a fund of funds, a common venture capital model in which governments back startups indirectly by committing capital to private investment firms. It is designed to take a more targeted approach than its 2016 counterpart, focusing on deep-tech and manufacturing startups that typically require longer time horizons and larger amounts of capital, while also backing early-stage founders, expanding investment beyond major cities and strengthening India’s domestic venture capital industry, particularly smaller funds, per the Indian government.\n\nAt the announcement on Saturday, IT minister Ashwini Vaishnaw highlighted the scale of India’s startup expansion, pointing to figures shown on a presentation slide indicating the number of startups has grown from fewer than 500 in 2016 to more than 200,000 today. The slide said more than 49,000 startups were registered in 2025 alone, the highest annual total on record.\n\nThe cabinet approval follows recent changes to India’s startup rules aimed ateasing pressure on deep-tech companies. New Delhi doubled the period for which such firms are classified as startups to 20 years and raised the revenue threshold for startup-specific tax, grant an",
      "excerpt": "India has cleared a $1.1 billion state-backed venture capital program that will channel government money into startups through private investors, doubling down on its effort to finance high-risk areas such as artificial intelligence, advanced manufacturing and other sectors broadly referred to by th",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "A Stanford grad student created an algorithm to help his classmates find love; now, Date Drop is the basis of his new startup",
      "link": "https://techcrunch.com/2026/02/13/a-stanford-grad-student-created-an-algorithm-to-help-his-classmates-find-love-now-date-drop-is-the-basis-of-his-new-startup/",
      "author": "Amanda Silberling",
      "date": "2026-02-13T08:24:53-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/headshot.jpg?resize=898,1200",
      "category": "Apps",
      "content": "As Valentine’s Day approaches at Stanford, some students may be gearing up for first dates — not with people they met on Tinder or Hinge, but with matches from a service calledDate Drop, designed by Stanford graduate student Henry Weng. Date Drop pairs students with potential dates once per week based on their responses to a questionnaire.\n\nA Stanford whiz kid is trying to disrupt an established industry from his Palo Alto dorm?Stop meifyou’ve heard thisonebefore! But young adults are deeplydisillusionedwith the frustrating, demoralizingstate of online dating. Why not try something different?\n\nOver 5,000 students at Stanford have given Date Drop a try since its launch in the fall. It has also rolled out at 10 more schools, including MIT, Princeton, and the University of Pennsylvania, and Weng says he wants to roll out Date Drop more broadly in some cities this summer.\n\n“Our matches convert to actual dates at about 10x the rate of Tinder,” Weng told TechCrunch. “Instead of swiping, we get to know each person deeply and send them one compatible match per week.”\n\nAt first, Weng didn’t intend to turn Date Drop into the foundation of a startup. Then, a close friend of his met their partner via Date Drop. “That was when I got the sense that this was less of a project,” he said.\n\nNow, Weng thinks of Date Drop as just the first service from his startup, TheRelationship Company, which is a public benefit corporation — a type of company legally required to consider social impact alongside profits.\n\n“This started as something I just wanted to exist on campus, and it became a company because people kept on asking for it in their schools and I needed resources to do that,” he said.\n\nAlready, Weng has raised “a few million” from some angel investors, including Zynga founder and early Facebook backer Mark Pincus, who has taught business courses at Stanford (including to Weng). Andy Chen, a former partner at Coatue, and Elad Gil, an early backer of Airbnb, Stripe, and Pinterest, al",
      "excerpt": "As Valentine’s Day approaches at Stanford, some students may be gearing up for first dates — not with people they met on Tinder or Hinge, but with matches from a service calledDate Drop, designed by Stanford graduate student Henry Weng. Date Drop pairs students with potential dates once per week bas",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Indian pharmacy chain giant exposed customer data and internal systems",
      "link": "https://techcrunch.com/2026/02/13/indias-major-pharmacy-chain-exposed-customer-data-and-internal-systems/",
      "author": "Jagmeet Singh",
      "date": "2026-02-13T19:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/medications-drugs-2237708773.jpg?resize=1200,795",
      "category": "Security",
      "content": "A security lapse by one of India’s largest pharmacy chains allowed outsiders to gain full administrative control of its platform, exposing customer order data and sensitive drug-control functions, TechCrunch has exclusively learned.\n\nThe issue affected DavaIndia Pharmacy, the pharmacy arm of Zota Healthcare, which operates a large network of retail outlets across India. Security researcher Eaton Zveare told TechCrunch that he discovered the flaw after identifying insecure “super admin” application programming interfaces on DavaIndia’s website and privately shared details with Indian cybersecurity authorities.\n\nThe bug is now fixed, and Zvearedisclosed his findings.\n\nThe exposure comes as Zota Healthcare rapidly scales DavaIndia Pharmacy’s retail business. The Gujarat-headquartered company operates more than 2,300 DavaIndia stores across India, including276 new outletsannounced in January, and plans toadd another 1,200 to 1,500over the next two years.\n\nZveare told TechCrunch that the flaw stemmed from insecure admin interfaces, which allowed unauthenticated users to create “super admin” accounts with high privileges.\n\nWith that level of access, an attacker could view thousands of online orders containing customer information, modify product listings and prices, create discount coupons, and change settings governing whether certain medicines required a prescription, the researcher said.\n\nBased on system timestamps, Zveare said the vulnerable administrative interfaces appeared to have been live since late 2024. The access exposed nearly 17,000 online orders and administrative controls spanning 883 stores, he said, allowing changes to product pricing, prescription requirements, and promotional discounts. Zveare said the access allowed edits to website content that could have been used for defacement or disruption.\n\nPharmacy order data can be particularly sensitive, as it may reveal information about a person’s health conditions, medications or other private purchases. E",
      "excerpt": "A security lapse by one of India’s largest pharmacy chains allowed outsiders to gain full administrative control of its platform, exposing customer order data and sensitive drug-control functions, TechCrunch has exclusively learned.\n\nThe issue affected DavaIndia Pharmacy, the pharmacy arm of Zota He",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "The SEC closed its investigation into Fisker",
      "link": "https://techcrunch.com/2026/02/13/the-sec-closed-its-investigation-into-fisker/",
      "author": "Sean O'Kane",
      "date": "2026-02-13T09:48:43-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2024/07/fisker-ocean-black.jpg?resize=1200,763",
      "category": "Transportation",
      "content": "The Securities and Exchange Commission closed its investigation into bankrupt electric vehicle startup Fisker  last September, roughlyone year after the probe was opened.\n\nTechCrunch learned the investigation was closed when the financial regulator responded to a Freedom of Information Act (FOIA) request in January. The SEC’s FOIA department said it had identified “approximately 21.7 gigabytes of electronically maintained records” related to the investigation. The agency doesn’t typically make records available if investigations are still open, and it explained in a follow-up email that it “was closed in September 2025.”\n\nIt’s not clear how far the investigation progressed. The SECrevealed the existence of the probein an October 2024 filing in Fisker’s bankruptcy case. The agency wrote at the time that it had sent subpoenas to the company and that it may need to “request or subpoena additional documents in the future relating to its ongoing investigation.”\n\nA spokesperson for the agency declined to comment. Founder and former CEO Henrik Fisker did not respond to a message seeking comment.\n\nThe closure of the Fisker investigation comes amid a significant drop in enforcement actions and settlements during President Trump’s second term. The SEC initiated 313 enforcement actions in 2025 — the lowest in a decade and down 27% from the the final year of President Biden’s term, according toan analysis by law firm Paul, Weiss. Only four of those enforcement actions were against public companies. Total monetary settlements fell 45% from 2024.\n\nFisker was one of the last remaining electric vehicle startups under investigation by the SEC. Over the last few years, the agency settled fraud or other charges brought againstNikola,Lordstown Motors,Canoo,Hyzon Motors, and others. In 2023, itclosed an investigationinto Lucid Motors without a lawsuit.\n\nThe only known active investigation remaining into an electric vehicle startup is the one related to Faraday Future, which is now nearl",
      "excerpt": "The Securities and Exchange Commission closed its investigation into bankrupt electric vehicle startup Fisker  last September, roughlyone year after the probe was opened.\n\nTechCrunch learned the investigation was closed when the financial regulator responded to a Freedom of Information Act (FOIA) re",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "India partners with Alibaba.com for export push despite past China tech bans",
      "link": "https://techcrunch.com/2026/02/13/india-partners-with-alibaba-com-for-export-push-despite-past-china-tech-bans/",
      "author": "Jagmeet Singh",
      "date": "2026-02-13T09:32:59-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/alibaba-com-jagmeet-singh-techcrunch.jpg?resize=1200,800",
      "category": "Government & Policy",
      "content": "India’s government has partnered with China’s Alibaba.com on an export-focused program aimed at helping startups and small businesses reach overseas buyers. The move highlights New Delhi’s selective engagement with Chinese-linked tech platforms years after itimposed sweeping banson consumer apps and games.\n\nThis week, the Indian government’s Startup India initiativeannouncedthe collaboration with Alibaba.com to identify and support Indian startups that can help onboard and scale Indian exporters on the group’s global B2B platform. The program offers commissions and technical support to those startups to assist small manufacturers and traders in reaching overseas markets.\n\nThe new partnership arrives after years of strained India–China relations. New Delhibanned dozens of Chinese-linked appsin 2020 following a deadly border clash, including major platforms such as TikTok, PUBG Mobile, and AliExpress, an e-commerce app operated by Alibaba Group. Those restrictions remain in place, making the Indian government’s public collaboration with Alibaba’s export-focused platform a carefully circumscribed form of engagement rather than a broader policy reset.\n\nIndia’s export ambitions are closely tied to its small businesses and the platforms they use to reach overseas markets. Micro, small, and medium enterprises account fornearly half of the country’s exportsand about 31% of GDP, according to the Indian government’s latest Economic Survey, underlining why New Delhi has focused on expanding digital market access for smaller firms through global B2B channels, including Alibaba.com.\n\nAlibaba.com’s B2B platform connects more than 50 million active buyers across over 200 countries and regions, said Rocky Lu, head of India business at the company.\n\n“Alibaba.com has been active in India for over two decades, and we remain dedicated to our core mission of empowering MSMEs to scale their businesses globally,” Lu told TechCrunch. “Our focus continues to be on leveraging our digital inf",
      "excerpt": "India’s government has partnered with China’s Alibaba.com on an export-focused program aimed at helping startups and small businesses reach overseas buyers. The move highlights New Delhi’s selective engagement with Chinese-linked tech platforms years after itimposed sweeping banson consumer apps and",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "‘Clueless’ -inspired app Alta partners with brand Public School to start integrating styling tools into websites",
      "link": "https://techcrunch.com/2026/02/14/clueless-inspired-app-alta-partners-with-brand-public-school-to-start-integrating-styling-tools-into-websites/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-14T11:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Alta.png?resize=1200,916",
      "category": "Startups",
      "content": "Much has changed for Jenny Wang, the founder who’s bringing “Clueless” fashion tech to life.\n\nLast year, her company, Alta,raised $11 million in a roundled by Menlo Ventures to let users create digital closets and try on their clothes with their own virtual avatars. It’s a tech once seen only in movies, most notably in “Clueless,” where Cher styles and plans her outfits using computer technology. Alta is similar to that, allowing users to plan and style outfits using the latest AI innovations.\n\nA slew of big names participated in Atla’s round last year, including models Jasmine Tookes and Karlie Kloss, Anthropic’s VC arm Anthology Fund, and Rent the Runway cofounder Jenny Fleiss.\n\nTechCrunch caught up with Wang during New York Fashion Week to talk abouthow the companyhas expanded since that round.\n\nFor starters, the product is officially in the app store;TimeandVoguenamed it one of the best innovations of last year, and Wang said more than 100 million outfits have been generated on the platform since its launch in 2023.  It has partnerships with Poshmark and the Council of Fashion Designers of America, with more partnerships to be announced soon.\n\n“Alta’s own app also features thousands of brands that users can shop from,” Wang said.\n\nRight now, the company is focused on building app and website integration experiences for brands, she said, where customers can try on a designer’s clothing using a personalized Alta Avatar. This week, the company unveiled its first integration collaboration,teaming up with Public School, a storied New York City brand.\n\n“Shoppers can style looks from the new collection on their own Alta avatar,” Wang said.\n\nShe met the Public School team — Dao-Yi Chow and Maxwell Osborne — through the founder of Poshmak, who is also an angel investor in both companies.\n\n“Public School designers Dao-Yi Chow and Maxwell Osborne had been looking for an AI partner and virtual try-on avatar solution, and Dao-Yi has been an Alta app user himself,” Wang said.",
      "excerpt": "Much has changed for Jenny Wang, the founder who’s bringing “Clueless” fashion tech to life.\n\nLast year, her company, Alta,raised $11 million in a roundled by Menlo Ventures to let users create digital closets and try on their clothes with their own virtual avatars. It’s a tech once seen only in mov",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Nothing opens its first retail store in India",
      "link": "https://techcrunch.com/2026/02/13/nothing-opens-its-first-retail-store-in-india/",
      "author": "Ivan Mehta",
      "date": "2026-02-13T22:30:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Nothing-India-store.jpg?resize=1200,675",
      "category": "Gadgets",
      "content": "Nothing, the hardware company backed by Tiger Global, is opening its first retail store in India, its biggest market. The store is located in Bengaluru, where the company says a large chunk of its user base is concentrated.\n\nThe new, two-story location will showcase Nothing’s products and other projects. Customers will also be able to buy hardware products and other merchandise from the store and have select items customized.\n\n“We wanted to create a fun space,” the company’s co-founder and CEO Carl Pei said. “It’s kind of inspired by all the parts that are related to the brand. For instance, the factory: if you buy a product, there’s like a production line where the product comes out. We also show machines where phones go through testing, like USB port testing or water resistance testing. So we just wanted to bring that world together.”\n\nThe store will feature products from both Nothing and CMF, its budget brand,which it spun off last year. Notably, CMF is headquartered in India and has a joint venture with local Indian ODM (original design manufacturer), Optiemus.\n\nPei mentioned that both brands are differentiated in terms of the products they offer, which fall into different price ranges, as well as the audiences they target.\n\n“Nothing is more niche with a higher price. CMF is more [targeted toward] mass [market]. You know it’s mass, but it’s not just off-the-shelf rebrand products that usually [appear] in this price point. They are also products that we put a lot of care into,” he said.\n\nIndia has been Nothing’s strongest market, with over 2% of the smartphone market share, the research firm IDC told TechCrunch last year. It also noted that Nothing was the fastest-growing brand in the country in Q2 2025, with 85% growth in shipments year-over-year.\n\nOther hardware makers are building aspirational retail stores in India, too. For instance, Apple is set toopen its sixth store in the country this month, situated in Borivali, a suburb of Mumbai.\n\nThis is the first No",
      "excerpt": "Nothing, the hardware company backed by Tiger Global, is opening its first retail store in India, its biggest market. The store is located in Bengaluru, where the company says a large chunk of its user base is concentrated.\n\nThe new, two-story location will showcase Nothing’s products and other proj",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}