{
  "last_updated": "2026-02-18T02:30:47.404132+00:00",
  "articles": [
    {
      "title": "Meta’s own research found parental supervision doesn’t really help curb teens’ compulsive social media use",
      "link": "https://techcrunch.com/2026/02/17/metas-own-research-found-parental-supervision-doesnt-really-help-curb-teens-compulsive-social-media-use/",
      "author": "Sarah Perez",
      "date": "2026-02-17T12:45:33-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2021/12/GettyImages-1237098710.jpeg?resize=1200,800",
      "category": "Social",
      "content": "An internal research study at Meta dubbed “Project MYST” created in partnership with theUniversity of Chicago, found that parental supervision and controls — such as time limits and restricted access — had little impact on kids’ compulsive use of social media. The study also found that kids who experienced stressful life events were more likely to lack the ability to moderate their social media use appropriately.\n\nThis was one of the notable claims revealed during testimony at the social media addiction trial that began last week in Los Angeles County Superior Court. The plaintiff in the lawsuit is identified by her initials “KGM” or her first name, “Kaley.” She, along with her mother and others joining the case, is accusing social media companies of creating “addictive and dangerous” products that led the young users to suffer anxiety, depression, body dysmorphia, eating disorders, self-harm, suicidal ideation, and more.\n\nThe case is now one of several landmark trials that will take place this year, which accuse social media companies of harming children. The results of these lawsuits will impact these companies’ approach to their younger users and could prompt regulators to take further action.\n\nIn this case, the plaintiff sued Meta, YouTube, ByteDance (TikTok), and Snap, but the latter two companieshadsettledtheir claims before the trial’s start.\n\nIn the jury trial now underway in LA, Kaley’s lawyer, Mark Lanier, brought up an internal study at Meta, which he said found evidence that Meta knew of, yet didn’t publicize, these specific harms.\n\nIn Project MYST, which stands for the Meta and Youth Social Emotional Trends survey, Meta’s research concluded that “parental and household factors have little association with teens’ reported levels of attentiveness to their social media use.”\n\nOr, in other words, even when parents try to control their children’s social media use, either by using parental controls or even just household rules and supervision, it doesn’t impa",
      "excerpt": "An internal research study at Meta dubbed “Project MYST” created in partnership with theUniversity of Chicago, found that parental supervision and controls — such as time limits and restricted access — had little impact on kids’ compulsive use of social media. The study also found that kids who expe",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Climactic launches hybrid fund to get startups through the ‘valley of death’",
      "link": "https://techcrunch.com/2026/02/17/climactic-launches-hybrid-fund-to-get-startups-through-the-valley-of-death/",
      "author": "Tim De Chant",
      "date": "2026-02-17T10:57:57-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/03/GettyImages-2174124655.jpg?resize=1200,675",
      "category": "Climate",
      "content": "It’s a challenge every startup faces: They’ve made a prototype and proven the thing works, but now have to sell the product and produce enough to get past the “valley of death” that kills so many companies.\n\n“They are chicken and egg stuck,” Josh Felser, co-founder and managing partner of early-stage venture firmClimactic, told TechCrunch.\n\nThe hurdle is particularly high for companies making physical goods. Felser noticed it was a common occurrence among startups producing novel materials. Felser, who previously founded and invested in software startups, said the problem they faced seemed a bit unfair.\n\n“Software companies sell at a negative margin all the time in the beginning, you know, Uber, Lyft, you can look at lots of different examples,” he said. “But for materials companies, they’re not allowed to do that. One of the questions I had is, ‘Why is that?’”\n\nFelser found that unlike software companies, which can quickly add more capacity from cloud service providers, materials startups face a market skeptical of their ability to scale up production without a guaranteed customer.\n\nFelser decided to give them one.\n\nHe doesn’t run a company with a big budget for clever materials, but he knows a few. And as a climate tech investor, he knows more than a few startups that could benefit from a well-known customer.\n\nFelser has been quietly working on a new project, called Material Scale, that brings the two sides together using a hybrid debt-equity investment vehicle to give materials startups a boost, TechCrunch has learned. Material Scale will initially focus on climate tech startups in the apparel industry.\n\nMaterial Scale is betting on startups with commercial-ready products that are ready to scale if a customer can purchase in bulk. Buyers will commit enough funds to cover the cost of the material at market price. Material Scale will fund the difference through a combination of loans and warrants in the startup.\n\n“It’s really minimally dilutive,” Felser said.\n\nRalp",
      "excerpt": "It’s a challenge every startup faces: They’ve made a prototype and proven the thing works, but now have to sell the product and produce enough to get past the “valley of death” that kills so many companies.\n\n“They are chicken and egg stuck,” Josh Felser, co-founder and managing partner of early-stag",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "SpaceX vets raise $50M Series A for data center links",
      "link": "https://techcrunch.com/2026/02/17/spacex-vets-raise-50m-series-a-for-data-center-links/",
      "author": "Tim Fernholz",
      "date": "2026-02-17T09:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/Screenshot-2026-02-16-at-11.06.38-AM.png?resize=1200,679",
      "category": "AI",
      "content": "Travis Brashears, Cameron Ramos, and Serena Grown-Haeberli began collaborating at SpaceX, developing optical communications links that keep thousands of Starlink internet satellites in constant contact.\n\nNow, the three engineers are co-founders of Mesh Optical Technologies, a Los Angeles startup that announced a $50 million Series A led by Thrive Capital on Tuesday.\n\nMesh aims to mass-produce optical transceivers, devices that convert optical signals from fiber or laser into electrical signals for computers. CEO Brashears, President Ramos, and VP of Product Grown-Haeberli realized the opportunity when designing a new generation of compute-hungry SpaceX satellites forced them to assess the optical transceiver market, and they saw its limitations.\n\nOptical transceivers are particularly important for data centers aimed at training and operating large deep learning models, because they allow multiple GPUs to work in concert. One established U.S. supplier, AOI,won a contractworth $4 billion to provide components for AWS data centers last year.\n\n“Someone will brag about a million GPU cluster; you have to multiply by four to five for the number of transceivers in that cluster,” Brashears explained.\n\nThe company’s goal is to manufacture a thousand units per day within the year so they can begin qualifying for bulk orders in 2027 and 2028.\n\nThe optical transceiver market is dominated by Chinese firms and suppliers, and Mesh sees an advantage in building its supply chain outside of that country. While trade restrictions haven’t impacted the market yet, the founders and their backers see themselves as getting in front of a national security dilemma.\n\n“If AI is the most important technology in several generations (which we believe to be true), to have critical parts of AI data center capex run through misaligned/competitive countries is a problem,” Thrive Partner Philip Clark wrote TechCrunch. “In the immediate term, Mesh is solving our need for better ways to do interconnect i",
      "excerpt": "Travis Brashears, Cameron Ramos, and Serena Grown-Haeberli began collaborating at SpaceX, developing optical communications links that keep thousands of Starlink internet satellites in constant contact.\n\nNow, the three engineers are co-founders of Mesh Optical Technologies, a Los Angeles startup tha",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Thrive raises $10B for new fund, its largest yet",
      "link": "https://techcrunch.com/2026/02/17/thrive-raises-10b-for-new-fund-its-largest-yet/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-17T12:13:12-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2184416821.jpg?w=1024",
      "category": "",
      "content": "Thrive Capital just raised $10 billion for a new fund — the largest fund it has ever raised and nearly double the size of its last fund. Of this, $1 billion is dedicated to early-stage investments, while the rest is for growth-stage investments, according to anannouncement from the firm.\n\nThrive told Bloomberg that this latest fundraise wasoversubscribed. This is the firm’s 10th fund — called Thrive X — and comes as some of the firm’s biggest investments, including OpenAI, Stripe, and SpaceX, continue to soar in value. Some of the firm’s other notable investments include Databricks, Anduril, and Cursor. The firm also incubates companies, having spun up 12 so far, with at least six now having reached unicorn status.\n\nThe firm’s strategy is to “commit deeply to a small number of founders,” the firm said in its announcement. “Concentration demands loyalty to the founders and missions we back.”\n\nSpeaking to Bloomberg, Josh Kushner, founder of the firm, said he believed the winners of the AI boom would “be bigger than we can ever imagine,” and that the technology is still nascent.\n\nThrive’s massive raise also hints at something else. IPO rumors have swirled around OpenAI and SpaceX in particular, bringing considerable interest from limited partners awaiting returns. These two companies could lead to an unprecedented flow of capital back tolimited partners.\n\nWe’ve reached out to Thrive for more information.",
      "excerpt": "Thrive Capital just raised $10 billion for a new fund — the largest fund it has ever raised and nearly double the size of its last fund. Of this, $1 billion is dedicated to early-stage investments, while the rest is for growth-stage investments, according to anannouncement from the firm.\n\nThrive tol",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Apple is reportedly cooking up a trio of AI wearables",
      "link": "https://techcrunch.com/2026/02/17/apple-is-reportedly-cooking-up-a-trio-of-ai-wearables/",
      "author": "Lucas Ropek",
      "date": "2026-02-17T12:14:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/01/tim-cook-speaking-GettyImages-2234517834.jpg?w=1024",
      "category": "",
      "content": "Late last month, The Informationreported thatApple was developing an AI wearable — an AirTag-sized pendant with cameras that could be pinned to a user’s shirt. Now, Bloombergwrites thatthe development of such a device — along with two other AI-powered items — is accelerating as Apple looks to stay competitive with other tech giants that are racing to release similar products.\n\nIn addition to the AI pin, Apple is also speeding up the development of its upcoming AI-powered smart glasses,which have been code-named N50, the report claims. Apple obviously has competition in this space, as other companies — including Meta (which is arguably the mostsuccessful playerwhen it comes to smart glasses) and Snap (whichplans to releaseits “Specs” later this year) — are working on similar products.\n\nApple’s new smart glasses, which will supposedly include a high-resolution camera, may see a public release sooner rather than later, with Bloomberg reporting that the company is “targeting the start of production as early as December, ahead of a public release in 2027.”\n\nAdditionally, Bloomberg reports that Apple is working on AirPods with new AI capabilities.\n\nAll of these items will be designed to connect to the iPhone and will include Siri, the company’s virtual assistant, as a critical component of the user experience, the outlet notes. The glasses are being described as “more upscale and feature-rich” than the AirPods and the AI pendant, however. TechCrunch reached out to Apple for more information.",
      "excerpt": "Late last month, The Informationreported thatApple was developing an AI wearable — an AirTag-sized pendant with cameras that could be pinned to a user’s shirt. Now, Bloombergwrites thatthe development of such a device — along with two other AI-powered items — is accelerating as Apple looks to stay c",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Anthropic releases Sonnet 4.6",
      "link": "https://techcrunch.com/2026/02/17/anthropic-releases-sonnet-4-6/",
      "author": "Russell Brandom",
      "date": "2026-02-17T10:00:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2025/08/Claude-Chrome-Ext_email-hero-hero.png?w=1200",
      "category": "",
      "content": "Anthropic has released a new version of its midsized Sonnet model, keeping pace with the company’s four-month update cycle.In a post announcing the new model, Anthropic emphasized improvements in coding, instruction-following, and computer use.\n\nSonnet 4.6 will be the default model for Free and Pro plan users.\n\nThe beta release of Sonnet 4.6 will include a context window of 1 million tokens, twice the size of the largest window previously available for Sonnet. Anthropic described the new context window as “enough to hold entire codebases, lengthy contracts, or dozens of research papers in a single request.”\n\nThe release comes just two weeks afterthe launch of Opus 4.6, with an updated Haiku model likely to follow in the coming weeks.\n\nThe launch comes with a new set of record benchmark scores, including OS World for computer use and SWE-Bench for software engineering. But perhaps the most impressive is its 60.4% score on ARC-AGI-2, meant to measure skills specific to human intelligence. The score puts Sonnet 4.6 above most comparable models, although it still trails models like Opus 4.6, Gemini 3 Deep Think, and one refined version of GPT 5.2.",
      "excerpt": "Anthropic has released a new version of its midsized Sonnet model, keeping pace with the company’s four-month update cycle.In a post announcing the new model, Anthropic emphasized improvements in coding, instruction-following, and computer use.\n\nSonnet 4.6 will be the default model for Free and Pro ",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Running AI models is turning into a memory game",
      "link": "https://techcrunch.com/2026/02/17/running-ai-models-is-turning-into-a-memory-game/",
      "author": "Russell Brandom",
      "date": "2026-02-17T08:44:14-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2009/01/samsung_50nm_dram.jpg?w=425",
      "category": "AI",
      "content": "When we talk about the cost of AI infrastructure, the focus is usually on Nvidia and GPUs — but memory is an increasingly important part of the picture. As hyperscalers prepare to build out billions of dollars’ worth of new data centers, the price for DRAM chips has jumpedroughly 7x in the last year.\n\nAt the same time, there’s a growing discipline in orchestrating all that memory to make sure the right data gets to the right agent at the right time. The companies that master it will be able to make the same queries with fewer tokens, which can be the difference between folding and staying in business.\n\nSemiconductor analystDoug O’Laughlinhas an interesting look at the importance of memory chips on his Substack, where he talks with Val Bercovici, chief AI officer at Weka. They’re both semiconductor guys, so the focus is more on the chips than the broader architecture; the implications for AI software are pretty significant too.\n\nI was particularly struck by this passage, in which Bercovici looks at the growing complexity ofAnthropic’s prompt-caching documentation:\n\nThe tell is if we go to Anthropic’s prompt caching pricing page. It started off as a very simple page six or seven months ago, especially as Claude Code was launching — just “use caching, it’s cheaper.” Now it’s an encyclopedia of advice on exactly how many cache writes to pre-buy. You’ve got 5-minute tiers, which are very common across the industry, or 1-hour tiers — and nothing above. That’s a really important tell. Then of course you’ve got all sorts of arbitrage opportunities around the pricing for cache reads based on how many cache writes you’ve pre-purchased.\n\nThe question here is how long Claude holds your prompt in cached memory: You can pay for a 5-minute window, or pay more for an hour-long window. It’s much cheaper to draw on data that’s still in the cache, so if you manage it right, you can save an awful lot. There is a catch though: Every new bit of data you add to the query may bump somethin",
      "excerpt": "When we talk about the cost of AI infrastructure, the focus is usually on Nvidia and GPUs — but memory is an increasingly important part of the picture. As hyperscalers prepare to build out billions of dollars’ worth of new data centers, the price for DRAM chips has jumpedroughly 7x in the last year",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Intellexa’s Predator spyware used to hack iPhone of journalist in Angola, research says",
      "link": "https://techcrunch.com/2026/02/17/intellexas-predator-spyware-used-to-hack-iphone-of-journalist-in-angola-research-says/",
      "author": "Lorenzo Franceschi-Bicchierai",
      "date": "2026-02-17T16:01:00-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/whatsapp-iphone-icon.jpg?resize=1200,800",
      "category": "Security",
      "content": "A government customer of sanctioned spyware maker Intellexa hacked the phone of a prominent journalist in Angola, according to Amnesty International, the latest case of targeting someone in civil society with powerful phone-hacking software.\n\nThe human rights organizationpublished a new reportTuesday analyzing several hacking attempts against local journalist and press freedom activist Teixeira Cândido, in which he was sent a series of malicious links via WhatsApp during 2024.\n\nCândido eventually clicked on one and his iPhone was hacked with Intellexa’s spyware, dubbed Predator, Amnesty found.\n\nThe new research shows again that government customers ofcommercial surveillance vendorsare increasingly using spyware to target journalists, politicians, and other ordinary citizens, including critics. Researchers have previously found evidence of Predator abuse inEgypt,Greece, and Vietnam, where the governmentreportedly targeted U.S. officialsby sending the spyware via links on X.\n\nContact UsDo you have more information about Intellexa? Or other spyware makers? From a non-work device, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram and Keybase @lorenzofb, oremail.\n\nIntellexa is one of the most controversial spyware makers of the last few years, operating from different jurisdictions to skirt export laws and using an “opaque web of corporate entities” — as a U.S government officialput itat the time — to hide its activities.\n\nIn 2024, around the same time one of Intellexa’s customers was targeting Cândido with its spyware,the outgoing Biden administration sanctionedthe company, as well as its founder Tal Dilian and his business partner Sara Aleksandra Fayssal Hamou.\n\nEarlier this year, the Treasurylifted sanctionsagainst three other executives tied to Intellexa, a decision that left Senate Democratsdemanding answersfrom the Trump administration.\n\nDilian did not respond to a request for comment.\n\nAmnesty researchers wrote in",
      "excerpt": "A government customer of sanctioned spyware maker Intellexa hacked the phone of a prominent journalist in Angola, according to Amnesty International, the latest case of targeting someone in civil society with powerful phone-hacking software.\n\nThe human rights organizationpublished a new reportTuesda",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Jack Altman joins Benchmark as GP",
      "link": "https://techcrunch.com/2026/02/17/jack-altman-joins-benchmark-as-gp/",
      "author": "Dominic-Madori Davis",
      "date": "2026-02-17T15:54:55-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2019/10/Jack-Eric-_-Founder-Photo-e1758050526778.jpg?w=873",
      "category": "",
      "content": "Jack Altman and Benchmarkannounced todaythat he would be joining the firm as a general partner.\n\nThis news is a big deal, especially since Altman has been running his own VC firm, Alt Capital, since at least 2024. The fund raised a $150 million Fund I in early 2024 and then, just last September,announced a $274 million Fund II, raised in just a week. On LinkedIn,Altman called the past two yearsrunning Alt Capital as an investor “the most rewarding” of his life, adding that he loved “new ideas and being part of a team with a mission.”\n\nAlt Capital invested in at least 52 companies, according to PitchBook, including Rippling, Antares Nuclear, and CompLabs. It’s unclear what happens to Alt Capital or whether Benchmark has acquired its portfolio, as Altman also announced that his teammates from the fund will be following him to Benchmark. (That’s also unusual, given Benchmark has historically been structured as a flat firm with primarily GPs only, versus layers of investors.)\n\nAltman also said he will retain the board seats at the companies he backed while at Alt Capital.\n\nAltman did not respond to requests for comment earlier today; Benchmark declined to comment.\n\nAltman, a younger brother of OpenAI co-founder Sam, is also the founder of the HR platform Lattice, which he still chairs, per his LinkedIn profile.",
      "excerpt": "Jack Altman and Benchmarkannounced todaythat he would be joining the firm as a general partner.\n\nThis news is a big deal, especially since Altman has been running his own VC firm, Alt Capital, since at least 2024. The fund raised a $150 million Fund I in early 2024 and then, just last September,anno",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    },
    {
      "title": "Ford turns to F1 and bounties to build a $30,000 electric truck",
      "link": "https://techcrunch.com/2026/02/17/ford-turns-to-f1-and-bounties-to-build-a-30000-electric-truck/",
      "author": "Kirsten Korosec",
      "date": "2026-02-17T15:43:21-08:00",
      "image": "https://techcrunch.com/wp-content/uploads/2026/02/UEV_aero.jpg?resize=1200,1200",
      "category": "Transportation",
      "content": "Ford is promising to deliver an EV truck next year that starts at $30,000 and can compete with Chinese automakers without undermining profit margins. A combination of 3D-printed Lego-like parts, Formula 1 thinking, and a bounty program will help the company hit that target, Ford said Tuesday.\n\nIt will have to. Ford took a$19.5 billion hitin December and ended production of its battery-electric F-150 Lightning. It can’t afford for this new EV business strategy to fall flat.\n\nFord’s bet on a line of affordable EVs began several years ago with askunkworks teamled by Alan Clarke, a 12-year Tesla veteran. Pieces of its plan were revealed last August, when Ford said it would ditch its traditional moving assembly line andinvest $2 billionin its Louisville factory to adopt a new production system that promises to speed up manufacturing by 15%.\n\nThe company said at the time that its line of EVs would be built on a universal platform with single-piece aluminum unicastings — large components cast as one piece to eliminate parts and allow for faster assembly — and lithium iron phosphate batteries with tech licensed from China’s CATL.\n\nNow Ford is sharing more specifics in aflurry of blog and social media postson how it will fulfill its promise of a desirable EV truck that will be $20,000 cheaper than the average new vehicle while still generating profits. Ford didn’t share specs like the range, features, or charging times of this future EV. But it did reveal how it plans to build lighter, cheaper, more efficient EVs made with fewer parts.\n\nIt all starts with the universal EV platform, or UEV. The platform will underpin a midsized truck first, then could support a sedan, crossover, three-row SUV, and even small commercial vans, according to Clarke. The UEV is Ford’s first “clean sheet” EV built from the ground up — a strategic shift for the company, which built its Mustang Mach-E and the Lightning EVs using existing infrastructure and manufacturing practices.\n\n“It’s a platform t",
      "excerpt": "Ford is promising to deliver an EV truck next year that starts at $30,000 and can compete with Chinese automakers without undermining profit margins. A combination of 3D-printed Lego-like parts, Formula 1 thinking, and a bounty program will help the company hit that target, Ford said Tuesday.\n\nIt wi",
      "tags": [
        "Apple",
        "Amazon",
        "Cloud Computing",
        "EVs",
        "Google"
      ]
    }
  ]
}